[
  {
    "id": "unit_000",
    "start_time": 10.419999999999998,
    "end_time": 99.92,
    "duration": 89.5,
    "text": "Okay, folks, welcome back. This is volume number 9 in a continuing series of 20 videos for the ICT Optimal Trade Entry Pattern Recognition Series for YouTube. Before I get into this, just as a reminder, you can also take a look at the British Pound, Pound versus Dollar, and you'll see that it gave us an optimal trade entry during the New York Session running out the previous days high, so it's kind of like a two for today. But I want to use the Euro Aussie today because it's a pair I don't do too much discussion about. And I want you to take a look at the low from the 18th over here, and this is going to be a question that's going to pop up if you haven't already had it come up in the progression through this series. What happens if the next day we go through it a little bit, but does go higher, or just because it goes below it, and we're expecting it to go below the previous days low, doesn't that negate taking a New York Session trade? And the question is answered with simply no. As you'll see now, take a look at this. Here's Monday's low on the Euro Aussie. So we protect that in the future. This is what I refer to as a shallow run. And basically, it just leaves unfinished business. Okay, the markets want to later at another time run back",
    "detected_concepts": [
      "optimal trade entry"
    ],
    "teaching_type": "explanation",
    "deictic_references": [
      [
        10.624878048780486,
        "this"
      ],
      [
        16.310243902439023,
        "here"
      ],
      [
        12.519999999999998,
        "look"
      ],
      [
        13.032195121951217,
        "see"
      ],
      [
        20.71512195121951,
        "look at this"
      ],
      [
        12.519999999999998,
        "look at"
      ]
    ],
    "confidence": 0.2032520325203252,
    "selected_frames": [
      "data/video_frames/uqptoSAGS30/frame_00009.00s.jpg",
      "data/video_frames/uqptoSAGS30/frame_00012.00s.jpg",
      "data/video_frames/uqptoSAGS30/frame_00015.00s.jpg",
      "data/video_frames/uqptoSAGS30/frame_00021.00s.jpg"
    ],
    "frame_timestamps": [
      9.0,
      12.0,
      15.0,
      21.0
    ],
    "word_count": 246
  },
  {
    "id": "unit_001",
    "start_time": 99.92,
    "end_time": 191.82,
    "duration": 91.89999999999999,
    "text": "for that liquidity just in the same capacity. It does it here. We have an old high from the 18th, and it runs above it very shallow, then runs down below the Monday low, then it rallies all the way back above these relative equal highs, clearing that liquidity out. Then only then does it come down to make a more significant run below Monday's low and the initial daily low formed here. New York Session, based on our rules, we're looking for an optimal trade entry. After seeing a run above for relative equal highs and a shallow run here, and it's starting to really gain momentum. At this point, if we see a retracement like this, we had now a shallow run here, and a shallow run here. That means that it's really primed to make a more significant run lower just later in the day. And we're going to use the New York Session time of day to look for an optimal trade entry. This high to this low price retraces back to the 70.5 level just a little bit above that. But keeping with the rules of this model, we're using the 62% retracement level. In this case, it's 166.97, and 5 pipettes as our entry. Stop would have to be at this high. The trade has 7 pips drawdown, theoretically, and the expansion down takes out the short-term low here, and we can offer 30 pips as a partial. It retraces back to Monday's old daily low, and then the further expansion down again consolidates, and it finally makes",
    "detected_concepts": [
      "liquidity",
      "equal highs",
      "optimal trade entry"
    ],
    "teaching_type": "definition",
    "deictic_references": [
      [
        105.7126893939394,
        "this"
      ],
      [
        100.50458333333333,
        "here"
      ],
      [
        104.22465909090909,
        "look"
      ],
      [
        104.59666666666666,
        "see"
      ]
    ],
    "confidence": 0.5681818181818181,
    "selected_frames": [
      "data/video_frames/uqptoSAGS30/frame_00099.00s.jpg",
      "data/video_frames/uqptoSAGS30/frame_00102.00s.jpg",
      "data/video_frames/uqptoSAGS30/frame_00105.00s.jpg",
      "data/video_frames/uqptoSAGS30/frame_00192.00s.jpg"
    ],
    "frame_timestamps": [
      99.0,
      102.0,
      105.0,
      192.0
    ],
    "word_count": 264
  },
  {
    "id": "unit_002",
    "start_time": 198.34,
    "end_time": 229.34,
    "duration": 31.0,
    "text": "So 30 pips offered, 50 pips offered. From this run here to here, that honestly is what I'm looking for once a week. I'm not in here trying to do a whole lot. So if I capture 50 to 75 pips a week, I'm pretty much done. So hopefully this example has been insightful in regards to do we consider taking the previous days low or previous days high in New York Session if it's already done so, even in a small capacity? No. The answer is you want to stick with",
    "detected_concepts": [],
    "teaching_type": "explanation",
    "deictic_references": [
      [
        198.73565217391305,
        "this"
      ],
      [
        198.83456521739132,
        "here"
      ],
      [
        199.23021739130436,
        "look"
      ]
    ],
    "confidence": 0.0,
    "selected_frames": [
      "data/video_frames/uqptoSAGS30/frame_00198.00s.jpg",
      "data/video_frames/uqptoSAGS30/frame_00213.00s.jpg"
    ],
    "frame_timestamps": [
      198.0,
      213.0
    ],
    "word_count": 92
  },
  {
    "id": "unit_003",
    "start_time": 229.34,
    "end_time": 245.38,
    "duration": 16.039999999999992,
    "text": "where the liquidity is going to be reaching relative to the previous days high or low. And if it's not really clear, just simply stay out. And that way you can live the fight another day without taking any of this risk or focus on another pair. Until next time, wish you good luck and good trading.",
    "detected_concepts": [
      "liquidity"
    ],
    "teaching_type": "explanation",
    "deictic_references": [
      [
        231.43122807017545,
        "this"
      ],
      [
        229.3922807017544,
        "here"
      ]
    ],
    "confidence": 0.8771929824561404,
    "selected_frames": [
      "data/video_frames/uqptoSAGS30/frame_00228.00s.jpg",
      "data/video_frames/uqptoSAGS30/frame_00231.00s.jpg"
    ],
    "frame_timestamps": [
      228.0,
      231.0
    ],
    "word_count": 57
  }
]