{
  "video_id": "-k1eBYoajIo",
  "full_text": "Welcome back folks. This is the 11th video in a series of 20 videos for the ICT optimal trade entry pattern recognition series. Alright, so here's our example for today. The example is shown in the Dollar CAD. This is their 5 minute chart and you know the drill. Pause your video, study it before I show you all the annotations. Okay, and now let's add our annotations. Here's our time of day. Previous days high, Wednesdays daily high, and you can see during the New York session, we have a nice run here and back down in. This is your optimal trade entry here. You can also do it from this low to this high here and trade back into it here. I'm going to run it on this swing here. Alright, so here's the Fibonacci and our annotations shown where you can see the entry at the 62% retracement level. 1.303 and 2 pipettes and the stop would be below 1, 3, 8, 9, 5, 1. Just using a standard 15 pip. It's a little bit wider spread for this pair. 20 pips comes in at one half a standard deviation. 30 pips at one standard deviation. 40 pips at one and a half standard deviations and finally, as I taught with this model, if it ever goes to two standard deviations, you want to take your profits there. Yes, it went a little bit beyond that, but again, we're not trying to split hairs. We want something that delivers very consistent, robust. We're not trying to be absolutely perfect with our entry, not absolutely perfect with our exit. We don't need that. So 50 pips plus from an entry, working with 15 pip stop loss, very, very handsome, are multiple there. Notice how we ran above Wednesday's daily high. We spiked through it, no more drive above it, traded down below it, back again, and then we sank down below and now look at the sensitivity in here. So again, previous days highs and lows set the stage for the easiest bread and butter setup you're ever going to find in the markets. You don't need to be paying single services. You don't need to be paying people for chat rooms. You absolutely can do this and it's something that repeats every single day. Until next time, wish good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 15.44,
      "text": "Welcome back folks. This is the 11th video in a series of 20 videos for the ICT optimal"
    },
    {
      "start_time": 15.44,
      "end_time": 21.36,
      "text": "trade entry pattern recognition series. Alright, so here's our example for today. The"
    },
    {
      "start_time": 21.36,
      "end_time": 27.36,
      "text": "example is shown in the Dollar CAD. This is their 5 minute chart and you know the drill."
    },
    {
      "start_time": 27.76,
      "end_time": 31.6,
      "text": "Pause your video, study it before I show you all the annotations."
    },
    {
      "start_time": 35.76,
      "end_time": 42.16,
      "text": "Okay, and now let's add our annotations. Here's our time of day."
    },
    {
      "start_time": 43.12,
      "end_time": 49.12,
      "text": "Previous days high, Wednesdays daily high, and you can see during the New York session,"
    },
    {
      "start_time": 49.84,
      "end_time": 56.88,
      "text": "we have a nice run here and back down in. This is your optimal trade entry here. You can also do it"
    },
    {
      "start_time": 56.88,
      "end_time": 64.0,
      "text": "from this low to this high here and trade back into it here. I'm going to run it on this swing"
    },
    {
      "start_time": 64.0,
      "end_time": 71.04,
      "text": "here. Alright, so here's the Fibonacci and our annotations shown where you can see the entry"
    },
    {
      "start_time": 71.04,
      "end_time": 81.68,
      "text": "at the 62% retracement level. 1.303 and 2 pipettes and the stop would be below 1, 3, 8, 9, 5, 1."
    },
    {
      "start_time": 81.76,
      "end_time": 87.84,
      "text": "Just using a standard 15 pip. It's a little bit wider spread for this pair. 20 pips comes in at"
    },
    {
      "start_time": 87.84,
      "end_time": 94.88,
      "text": "one half a standard deviation. 30 pips at one standard deviation. 40 pips at one and a half standard"
    },
    {
      "start_time": 94.88,
      "end_time": 100.64,
      "text": "deviations and finally, as I taught with this model, if it ever goes to two standard deviations,"
    },
    {
      "start_time": 100.64,
      "end_time": 104.08,
      "text": "you want to take your profits there. Yes, it went a little bit beyond that, but again, we're not"
    },
    {
      "start_time": 104.08,
      "end_time": 109.76,
      "text": "trying to split hairs. We want something that delivers very consistent, robust. We're not trying"
    },
    {
      "start_time": 110.48,
      "end_time": 115.44,
      "text": "to be absolutely perfect with our entry, not absolutely perfect with our exit. We don't need that."
    },
    {
      "start_time": 115.44,
      "end_time": 123.36,
      "text": "So 50 pips plus from an entry, working with 15 pip stop loss, very, very handsome,"
    },
    {
      "start_time": 124.08,
      "end_time": 129.12,
      "text": "are multiple there. Notice how we ran above Wednesday's daily high. We spiked through it,"
    },
    {
      "start_time": 129.84,
      "end_time": 135.68,
      "text": "no more drive above it, traded down below it, back again, and then we sank down below and"
    },
    {
      "start_time": 135.76,
      "end_time": 143.44,
      "text": "now look at the sensitivity in here. So again, previous days highs and lows set the stage for"
    },
    {
      "start_time": 143.44,
      "end_time": 148.08,
      "text": "the easiest bread and butter setup you're ever going to find in the markets. You don't need to be"
    },
    {
      "start_time": 148.08,
      "end_time": 152.96,
      "text": "paying single services. You don't need to be paying people for chat rooms. You absolutely can do"
    },
    {
      "start_time": 152.96,
      "end_time": 158.48,
      "text": "this and it's something that repeats every single day. Until next time, wish good luck and good"
    },
    {
      "start_time": 158.48,
      "end_time": 158.96,
      "text": "trading."
    }
  ],
  "word_count": 396,
  "segment_count": 24,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:30:37.704514",
  "title": "OTE Pattern Recognition Series - Vol. 11"
}