{
  "video_id": "0LhteuLVuDU",
  "full_text": "you Welcome to the first teaching tutorial from the ICT monthly mentorship for month of September 2016. This is the first of eight each month you'll get eight individual teaching tutorials that will complement general thing for the month. This particular teaching is going to be elements to a trade setup. And as you probably know this month so far we've been focusing primarily on showing the consistency that's able to be delivered to you as a developing trader after you submitted the time and you've done the work with the exercises and the content materials that we're going to be presenting to you. We refer to elements to a trade setup. There's really just two primary concerns and one is obviously context or framework surrounding the idea. And what makes the idea favorable for a trade is not just simply, well my indicator tells me this or my support resistance level tells me that there has to be something that builds a reason to want to do this trade. In my material are we learning for specific principles and we're going to be dealing with them in general terms and then what we do in those conditions where we specifically pairing up with in terms of the ICT tools. The first one is going to be expansion. We're going to talk about expansion and what we look for in that condition. We're going to be talking about retracements and what tool or concept we used for retracements. Reversal and lastly consolidation. Each one of these four give a specific framework and a context to the marketplace that you're going to be trading in. They can only be one of these four conditions. Either the market is going to be expanding, running away in other words, trimming, a retracement or rollback, altogether reversal. And obviously when the market is doing nothing it's consolidating but really we all learned in the market maker series that there's really no assessing is the market doing nothing in consolidation is actually accumulating orders. Now the other characteristic we use for defining elements to a trade setup is using these four criteria for context and framework to specific reference point in institutional order flow. The first one is order blocks. The second one is fair value gaps and liquidity voids. liquidity polls and stop runs. And lastly equilibrium. Now understanding those two characteristics together will give you a greater understanding of market efficiency paradigm. How the smart money interprets price and how they influence the general populace or the speculative un informed money. It's going to be a rather illuminating tutorial actually. You're going to be able to look at the marketplace with an expectation of knowing what to apply based on what the market's providing you right now. It only takes a second or two to look at the marketplace determined okay what characteristic are we trading in so that way you can build a context or framework on how you're going to approach the marketplace. Sometimes you'll have right away an issue where you can say I'm not going to do anything because the market's consolidating I am going to be waiting the other three conditions are going to be providing you an opportunity to take action relative to the tools that we couple with those conditions or context. Now the interbank price delivery algorithm or what I always refer to as the algo or interbank algo is the actual basically artificial intelligence it's a price engine that when we receive our price for currencies it's actually 90% done by electronic algorithms. So it's all computer based now it used to be open I'll cry in the pits but there's no longer an auction market it's all AI and it's based on principles I've been teaching for about seven years now. You're not going to learn these things because number one no one's going to believe that it exists there is this movement away from human involvement with market making it's become much more efficient to be electronically based and these things are programmed by human beings obviously and those intelligence are limited. So while that is probably unsettling for some of you that are listening to this thinking well I thought I had a free market I was trading in it's actually not it's highly manipulated especially in the foreign exchange which is what we're primarily dealing with here because of the nature of it being so manipulated manipulated the fingerprints if you will are easy to see once you understand. The operations and conditions to the market maker interbank price to the real algorithm functions so when the market does what it's doing it gives you indications it gives you fingerprints or clues as to what you should be expecting next and that's where your anticipatory skills are going to be coming in. You're not going to know these things right away the first time watching this video it may go over your head but for some of you that have already went through the prerequisites I believe that are in my free tutorial section on my website if you haven't gone through this like for series it says in trading concepts and the market maker series yet you're going to need those okay so don't be discouraged if you hear some terms in here that go over your head because they're all taught in those three tutorial series for free. It's a lot of material over there so dig into not only the stuff you're getting in this curriculum with the mentorship but fill in the space when I'm not giving you content with the free tutorials those three tutorials and I'm going to say what they are they are market maker series precision trading concepts and a sniper series. Okay the interpank al go okay obviously there's going to be times when the market goes sideways in or ten of consolidation or what I refer to as a holding pattern now when this happens the market will be looking to do an expansion okay so all markets start from a consolidation and move into an expansion that means there's an impulse move or an impulse price swing after the impulse swing okay either it goes back to a consolidation again or it goes back to a consolidation again or it goes back to a consolidation again. Or it goes to a retracement when the retracement happens it goes back down into another level of expansion or after the expansion it can go to a reversal pattern after the reversal pattern it'll see another retracement then back to potentially consolidation these four conditions they interchange throughout the ups and downs and as inflow the marketplace. You're only going to get one of these four conditions now you're probably saying okay well that's a lot I need to know one of these things to make a trade no you just need to know where it's at right now where it's likely to go where it came from and over the course of the month of September you're going to get a lot of understanding about how to know where the market's going to go next and that's going to fill in a lot of the gaps that you've had with teaching directional bias ICT. The main thing is the consolidation begins with everything all the moves that take place in the marketplace start from a measure of consolidation because that's where the markets are building orders so the market maker keeps market in a tight range or defined range until there's enough money on both sides of the upper and lower end of the range that's being defined by the consolidation which ever one has the highest amount of money to be. The next one is the way to get the money absorbed that's the direction it's going to move in we don't always know what that is but we wait for the expansion when the expansion occurs that's when we get the clue as to what the market is most likely going to be doing and we wait for either retracement or an consolidation or reversal but we always wait for the first expansion that gives us all the insight that we need to make a decision. Sometimes it may expand so far that we can't do anything with it we have to wait for the retracement or the next consolidation there's nothing wrong with that it's all normal you're not going to catch every move the main thing is understanding these four individual characteristics to a trade setup because prices delivered by one of these four conditions it can't be any other way. Now what is expansion now expansion is when price moves quickly from a level equilibrium now expansion couples directly with the tool of an order block now what is the what's the importance of knowing expansion well when price leaves a level quickly this indicates a willingness on the part of the market makers to reveal their intended repricing model now what does that mean well if we're in a consolidation or point of equilibrium if price were to move up quickly that would give us an indication of looking for a bullish or block we don't want to chase price we're going to wait for price to come back down into the order block where is that going to occur well where we look for in price the or block that that market makers leave in here or at the equilibrium price point so I know what you're thinking okay Michael is already going over my head give me some examples no problem I'm going to show you that right now. As you see here there's a consolidation and a blue shaded area very clear defined consolidation it's got a clear discernible high and low and the equilibrium price point is directly in the middle of the high and the low end of that range you can simply take the fibonacci tool you have in all your platforms lay the fib from the high in the low and the general consolidation find that midpoint and you can check yourself also by looking at how many times the market touches up up against it from below and from above it going down into an onwards how many times it's touching and hanging around that level eventually the market will move outside the consolidation you can see that impulse move in that tan shaded box it moves away from the equilibrium price point and then all we have to do is go back to the down candle right before that up move that down candle or black candle I'm drawing on a small little segment of that's the bullish order block when the price comes back down into that and hits it that's where we would be buying and obviously you can see it hits that level and expands to the upside over a hundred pips just by using that simple principle it repeats itself all the time it's in price action all the time if you study just to the left of the consolidation we have shaded in blue there's actually a consolidation in the sell side where the market broke down and came right back to the equilibrium price point again and then sold off I'll leave that for your study now but we're going to move on to the next characteristic of a trade setup the next one is a retracement now what is the retracement retracement is when price moves back inside the recently created price range now years ago I think it was in 2012 I did a webinar called trading inside the range and a lot of folks that were following me on one of the forms that is pretty popular on internet they went ahead of a heels when they learned this simple principle of understanding how you can trade it inside of a range and it doesn't even have to break out doesn't have to trend you can define the range by a high and a low and trade inside that range and that was the beginning basis point of how I brought a lot of people from that form into the understanding of an order block the block was introduced in the sniper series tutorial on my website but prior to that I just gave indications and clues about what an order block was without actually really referring to or spelling it out for everyone what's the importance of the retracement or when price returns inside a recent price range this indicates a willingness on the part of the market makers to reprice to levels not efficiently traded for fair value when we're thinking retracement the go to is for ICT tools we're looking for liquidity gaps and liquidity voids when we look for price when we see run ups real quick and run downs in price and lower it's real quick rallies up or real quick rallies down in price many times that range that's created we want to come back in and close that in and I'll give an example of what that looks like now this is an example of a retracement as you see here the orange shaded area we had a real quick sudden movement away from a price level and that quick sudden movement creates what we call as a liquidity void in in other words as the market drops aggressively like that there's going to be pockets where the price wasn't actually delivered on every upper available price level at that range it moved too quickly it skipped or created gaps what we'll do is we'll wait as a trader we want chase price we'll wait and say okay there's going to be either an indication to get long and try to fill in that range or we can wait for the come all way back up to it and fill in the liquidity void once it hits it then it'll probably resume going lower and that's what we're looking for in terms of liquidity void so we've covered three conditions the next one is the reversal the reversal is when price moves the opposite direction current direction has taken in so if we are looking for reversals we're directly coupling that with an ICT tool of liquidity polls now what's the importance of it when the price reverses direction it in case the market makers have ran in level stops and a significant move should unfold in the new direction what do we look for on price the liquidity polls just above an old high and just below an old high and just below an old low okay and we're looking at examples of reversals here every X indicates where stops would be in the market goes just above those levels and rejects and goes the other way or goes just below those levels where there's an X and rejects and goes the other way become many times there's so many opportunities just on this one chart and it's on a pair I don't really like to trade U.S. versus the Swissy this pair is real choppy it tends to have a lot of this type of price action so it has a characteristic that is very favorable if you're into type of trading like this turtle soups and false breaks are really really good in this Swissy and lastly we have consolidation and when we're referring to consolidation we're directly relating that to an ICT tool of equilibrium what is consolidation consolidation is when price moves inside a clear trading range and shows no willingness to move significantly higher lower and what's the importance when price consolidates it indicates the market makers are allowing orders to build on both sides of the market expect a new expansion near term and what do we look for in price we're waiting for the impulse move or impulse swing price away from the equilibrium price level that is found exactly in the halfway point of the consolidation range I'll show you an example what that looks like here we see here we're we've identified a range defined specifically by the bodies of the candles not the wicks I can see price moves out in an expansive manner and then comes right back down to equilibrium price point and then expands to the outside by having an understanding of these specific characteristics and elements of trading set up you'll give yourself framework to first learn how to practice and study price action and eventually work towards understanding consistent setup discovery and by utilizing the time with me on a daily basis we'll be able to frame these characteristics and pull out specific elements to a trade set up by repetition and by using the daily time with me when we can outline the elements of a trade set up we'll be able to do that to do all these things in a manner where you'll be able to retain it make it yours you'll be able to discover really what type of trade you're going to be because one of these characteristics is going to be your bread and butter condition some of you will trust the equilibrium some of you will trust the order block some of you will look for the void or the liquidity gaps the trade into some of you will have one or two of these characteristics and you'll trade within those parameters they'll frame your trades some of you will eventually grow into understanding all of them and be universal but don't think that you have to have all of them well known and under your belt before you're actually consistent because you can just find one element as we describe here if we just find one for you just for you one you can start being consistently profitable in your trading it only takes one setup you know what context or framework you're going to trade in couple that with an ICT tool and then wait for those conditions you're not going to get a trade every single day but you can get a couple of them every single week if you look at four major pairs with one condition or criteria you'll find a trade every single day but that's not what you're trying to do right now you're going to grow into that over time but for now just go through your charts and try to look at all the examples that's already happened in the left side of your chart and outline them individually based on the characteristics and elements that we've identified here in this teaching until next time I wish you good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 2.0,
      "text": "you"
    },
    {
      "start_time": 30.0,
      "end_time": 46.0,
      "text": "Welcome to the first teaching tutorial from the ICT monthly mentorship for month of September 2016."
    },
    {
      "start_time": 46.0,
      "end_time": 55.0,
      "text": "This is the first of eight each month you'll get eight individual teaching tutorials that will complement general thing for the month."
    },
    {
      "start_time": 55.0,
      "end_time": 60.0,
      "text": "This particular teaching is going to be elements to a trade setup."
    },
    {
      "start_time": 60.0,
      "end_time": 80.0,
      "text": "And as you probably know this month so far we've been focusing primarily on showing the consistency that's able to be delivered to you as a developing trader after you submitted the time and you've done the work with the exercises and the content materials that we're going to be presenting to you."
    },
    {
      "start_time": 81.0,
      "end_time": 94.0,
      "text": "We refer to elements to a trade setup. There's really just two primary concerns and one is obviously context or framework surrounding the idea."
    },
    {
      "start_time": 94.0,
      "end_time": 109.0,
      "text": "And what makes the idea favorable for a trade is not just simply, well my indicator tells me this or my support resistance level tells me that there has to be something that builds a reason to want to do this trade."
    },
    {
      "start_time": 109.0,
      "end_time": 124.0,
      "text": "In my material are we learning for specific principles and we're going to be dealing with them in general terms and then what we do in those conditions where we specifically pairing up with in terms of the ICT tools."
    },
    {
      "start_time": 124.0,
      "end_time": 132.0,
      "text": "The first one is going to be expansion. We're going to talk about expansion and what we look for in that condition."
    },
    {
      "start_time": 133.0,
      "end_time": 141.0,
      "text": "We're going to be talking about retracements and what tool or concept we used for retracements."
    },
    {
      "start_time": 142.0,
      "end_time": 155.0,
      "text": "Reversal and lastly consolidation. Each one of these four give a specific framework and a context to the marketplace that you're going to be trading in."
    },
    {
      "start_time": 155.0,
      "end_time": 168.0,
      "text": "They can only be one of these four conditions. Either the market is going to be expanding, running away in other words, trimming, a retracement or rollback, altogether reversal."
    },
    {
      "start_time": 168.0,
      "end_time": 181.0,
      "text": "And obviously when the market is doing nothing it's consolidating but really we all learned in the market maker series that there's really no assessing is the market doing nothing in consolidation is actually accumulating orders."
    },
    {
      "start_time": 182.0,
      "end_time": 199.0,
      "text": "Now the other characteristic we use for defining elements to a trade setup is using these four criteria for context and framework to specific reference point in institutional order flow."
    },
    {
      "start_time": 200.0,
      "end_time": 208.0,
      "text": "The first one is order blocks. The second one is fair value gaps and liquidity voids."
    },
    {
      "start_time": 210.0,
      "end_time": 218.0,
      "text": "liquidity polls and stop runs. And lastly equilibrium."
    },
    {
      "start_time": 218.0,
      "end_time": 233.0,
      "text": "Now understanding those two characteristics together will give you a greater understanding of market efficiency paradigm."
    },
    {
      "start_time": 233.0,
      "end_time": 241.0,
      "text": "How the smart money interprets price and how they influence the general populace or the speculative un informed money."
    },
    {
      "start_time": 242.0,
      "end_time": 256.0,
      "text": "It's going to be a rather illuminating tutorial actually. You're going to be able to look at the marketplace with an expectation of knowing what to apply based on what the market's providing you right now."
    },
    {
      "start_time": 256.0,
      "end_time": 268.0,
      "text": "It only takes a second or two to look at the marketplace determined okay what characteristic are we trading in so that way you can build a context or framework on how you're going to approach the marketplace."
    },
    {
      "start_time": 268.0,
      "end_time": 284.0,
      "text": "Sometimes you'll have right away an issue where you can say I'm not going to do anything because the market's consolidating I am going to be waiting the other three conditions are going to be providing you an opportunity to take action relative to the tools that we couple with those conditions or context."
    },
    {
      "start_time": 284.0,
      "end_time": 313.0,
      "text": "Now the interbank price delivery algorithm or what I always refer to as the algo or interbank algo is the actual basically artificial intelligence it's a price engine that when we receive our price for currencies it's actually 90% done by electronic algorithms."
    },
    {
      "start_time": 313.0,
      "end_time": 329.0,
      "text": "So it's all computer based now it used to be open I'll cry in the pits but there's no longer an auction market it's all AI and it's based on principles I've been teaching for about seven years now."
    },
    {
      "start_time": 329.0,
      "end_time": 355.0,
      "text": "You're not going to learn these things because number one no one's going to believe that it exists there is this movement away from human involvement with market making it's become much more efficient to be electronically based and these things are programmed by human beings obviously and those intelligence are limited."
    },
    {
      "start_time": 355.0,
      "end_time": 381.0,
      "text": "So while that is probably unsettling for some of you that are listening to this thinking well I thought I had a free market I was trading in it's actually not it's highly manipulated especially in the foreign exchange which is what we're primarily dealing with here because of the nature of it being so manipulated manipulated the fingerprints if you will are easy to see once you understand."
    },
    {
      "start_time": 381.0,
      "end_time": 402.0,
      "text": "The operations and conditions to the market maker interbank price to the real algorithm functions so when the market does what it's doing it gives you indications it gives you fingerprints or clues as to what you should be expecting next and that's where your anticipatory skills are going to be coming in."
    },
    {
      "start_time": 402.0,
      "end_time": 430.0,
      "text": "You're not going to know these things right away the first time watching this video it may go over your head but for some of you that have already went through the prerequisites I believe that are in my free tutorial section on my website if you haven't gone through this like for series it says in trading concepts and the market maker series yet you're going to need those okay so don't be discouraged if you hear some terms in here that go over your head because they're all taught in those three tutorial series for free."
    },
    {
      "start_time": 430.0,
      "end_time": 456.0,
      "text": "It's a lot of material over there so dig into not only the stuff you're getting in this curriculum with the mentorship but fill in the space when I'm not giving you content with the free tutorials those three tutorials and I'm going to say what they are they are market maker series precision trading concepts and a sniper series."
    },
    {
      "start_time": 456.0,
      "end_time": 485.0,
      "text": "Okay the interpank al go okay obviously there's going to be times when the market goes sideways in or ten of consolidation or what I refer to as a holding pattern now when this happens the market will be looking to do an expansion okay so all markets start from a consolidation and move into an expansion that means there's an impulse move or an impulse price swing after the impulse swing okay either it goes back to a consolidation again or it goes back to a consolidation again or it goes back to a consolidation again."
    },
    {
      "start_time": 485.0,
      "end_time": 514.0,
      "text": "Or it goes to a retracement when the retracement happens it goes back down into another level of expansion or after the expansion it can go to a reversal pattern after the reversal pattern it'll see another retracement then back to potentially consolidation these four conditions they interchange throughout the ups and downs and as inflow the marketplace."
    },
    {
      "start_time": 514.0,
      "end_time": 543.0,
      "text": "You're only going to get one of these four conditions now you're probably saying okay well that's a lot I need to know one of these things to make a trade no you just need to know where it's at right now where it's likely to go where it came from and over the course of the month of September you're going to get a lot of understanding about how to know where the market's going to go next and that's going to fill in a lot of the gaps that you've had with teaching directional bias ICT."
    },
    {
      "start_time": 544.0,
      "end_time": 573.0,
      "text": "The main thing is the consolidation begins with everything all the moves that take place in the marketplace start from a measure of consolidation because that's where the markets are building orders so the market maker keeps market in a tight range or defined range until there's enough money on both sides of the upper and lower end of the range that's being defined by the consolidation which ever one has the highest amount of money to be."
    },
    {
      "start_time": 574.0,
      "end_time": 599.0,
      "text": "The next one is the way to get the money absorbed that's the direction it's going to move in we don't always know what that is but we wait for the expansion when the expansion occurs that's when we get the clue as to what the market is most likely going to be doing and we wait for either retracement or an consolidation or reversal but we always wait for the first expansion that gives us all the insight that we need to make a decision."
    },
    {
      "start_time": 599.0,
      "end_time": 626.0,
      "text": "Sometimes it may expand so far that we can't do anything with it we have to wait for the retracement or the next consolidation there's nothing wrong with that it's all normal you're not going to catch every move the main thing is understanding these four individual characteristics to a trade setup because prices delivered by one of these four conditions it can't be any other way."
    },
    {
      "start_time": 626.0,
      "end_time": 654.0,
      "text": "Now what is expansion now expansion is when price moves quickly from a level equilibrium now expansion couples directly with the tool of an order block now what is the what's the importance of knowing expansion well when price leaves a level quickly this indicates a willingness on the part of the market makers to reveal their intended repricing model now what does that mean well if we're in a consolidation"
    },
    {
      "start_time": 654.0,
      "end_time": 673.0,
      "text": "or point of equilibrium if price were to move up quickly that would give us an indication of looking for a bullish or block we don't want to chase price we're going to wait for price to come back down into the order block where is that going to occur well where we look for in price the"
    },
    {
      "start_time": 673.0,
      "end_time": 685.0,
      "text": "or block that that market makers leave in here or at the equilibrium price point so I know what you're thinking okay Michael is already going over my head give me some examples no problem I'm going to show you that right now."
    },
    {
      "start_time": 685.0,
      "end_time": 702.0,
      "text": "As you see here there's a consolidation and a blue shaded area very clear defined consolidation it's got a clear discernible high and low and the equilibrium price point is directly in the middle of the high and the low end of that range you can simply take the"
    },
    {
      "start_time": 702.0,
      "end_time": 718.0,
      "text": "fibonacci tool you have in all your platforms lay the fib from the high in the low and the general consolidation find that midpoint and you can check yourself also by looking at how many times the market touches up up against it from below and from above it going down into an"
    },
    {
      "start_time": 718.0,
      "end_time": 737.0,
      "text": "onwards how many times it's touching and hanging around that level eventually the market will move outside the consolidation you can see that impulse move in that tan shaded box it moves away from the equilibrium price point and then all we have to do is go back to the down candle right before that up move that down candle or black"
    },
    {
      "start_time": 737.0,
      "end_time": 747.0,
      "text": "candle I'm drawing on a small little segment of that's the bullish order block when the price comes back down into that and hits it that's where we would be buying and obviously you can see it hits that"
    },
    {
      "start_time": 747.0,
      "end_time": 759.0,
      "text": "level and expands to the upside over a hundred pips just by using that simple principle it repeats itself all the time it's in price action all the time if you study just to the left of the"
    },
    {
      "start_time": 759.0,
      "end_time": 773.0,
      "text": "consolidation we have shaded in blue there's actually a consolidation in the sell side where the market broke down and came right back to the equilibrium price point again and then sold off I'll leave that for your study now but we're going to move on to the next"
    },
    {
      "start_time": 773.0,
      "end_time": 790.0,
      "text": "characteristic of a trade setup the next one is a retracement now what is the retracement retracement is when price moves back inside the recently created price range"
    },
    {
      "start_time": 790.0,
      "end_time": 810.0,
      "text": "now years ago I think it was in 2012 I did a webinar called trading inside the range and a lot of folks that were following me on one of the forms that is pretty popular on internet they went ahead of a heels when they learned this simple"
    },
    {
      "start_time": 810.0,
      "end_time": 829.0,
      "text": "principle of understanding how you can trade it inside of a range and it doesn't even have to break out doesn't have to trend you can define the range by a high and a low and trade inside that range and that was the beginning basis point of how I brought a lot of people from that form into the understanding of an order block the"
    },
    {
      "start_time": 829.0,
      "end_time": 840.0,
      "text": "block was introduced in the sniper series tutorial on my website but prior to that I just gave indications and clues about what an order block was without actually really referring to or spelling it out for everyone"
    },
    {
      "start_time": 840.0,
      "end_time": 852.0,
      "text": "what's the importance of the retracement or when price returns inside a recent price range this indicates a willingness on the part of the market makers to reprice to levels not efficiently traded for fair value"
    },
    {
      "start_time": 852.0,
      "end_time": 875.0,
      "text": "when we're thinking retracement the go to is for ICT tools we're looking for liquidity gaps and liquidity voids when we look for price when we see run ups real quick and run downs in price and lower it's real quick rallies up or real quick rallies down in price many times that range that's created"
    },
    {
      "start_time": 875.0,
      "end_time": 900.0,
      "text": "we want to come back in and close that in and I'll give an example of what that looks like now this is an example of a retracement as you see here the orange shaded area we had a real quick sudden movement away from a price level and that quick sudden movement creates what we call as a liquidity void in"
    },
    {
      "start_time": 900.0,
      "end_time": 917.0,
      "text": "in other words as the market drops aggressively like that there's going to be pockets where the price wasn't actually delivered on every upper available price level at that range it moved too quickly it skipped or created gaps"
    },
    {
      "start_time": 917.0,
      "end_time": 946.0,
      "text": "what we'll do is we'll wait as a trader we want chase price we'll wait and say okay there's going to be either an indication to get long and try to fill in that range or we can wait for the come all way back up to it and fill in the liquidity void once it hits it then it'll probably resume going lower and that's what we're looking for in terms of liquidity void so we've covered three conditions the next one is the reversal"
    },
    {
      "start_time": 947.0,
      "end_time": 976.0,
      "text": "the reversal is when price moves the opposite direction current direction has taken in so if we are looking for reversals we're directly coupling that with an ICT tool of liquidity polls now what's the importance of it when the price reverses direction it in case the market makers have ran in level stops and a significant move should unfold in the new direction what do we look for on price the liquidity polls just above an old high and just below an old high"
    },
    {
      "start_time": 976.0,
      "end_time": 1005.0,
      "text": "and just below an old low okay and we're looking at examples of reversals here every X indicates where stops would be in the market goes just above those levels and rejects and goes the other way or goes just below those levels where there's an X and rejects and goes the other way become many times there's so many opportunities just on this one chart and it's on a pair I don't really like to trade"
    },
    {
      "start_time": 1005.0,
      "end_time": 1025.0,
      "text": "U.S. versus the Swissy this pair is real choppy it tends to have a lot of this type of price action so it has a characteristic that is very favorable if you're into type of trading like this turtle soups and false breaks are really really good in this Swissy"
    },
    {
      "start_time": 1025.0,
      "end_time": 1047.0,
      "text": "and lastly we have consolidation and when we're referring to consolidation we're directly relating that to an ICT tool of equilibrium what is consolidation consolidation is when price moves inside a clear trading range and shows no willingness to move significantly higher lower"
    },
    {
      "start_time": 1047.0,
      "end_time": 1072.0,
      "text": "and what's the importance when price consolidates it indicates the market makers are allowing orders to build on both sides of the market expect a new expansion near term and what do we look for in price we're waiting for the impulse move or impulse swing price away from the equilibrium price level that is found exactly in the halfway point of the consolidation range I'll show you an example what that looks like"
    },
    {
      "start_time": 1073.0,
      "end_time": 1094.0,
      "text": "here we see here we're we've identified a range defined specifically by the bodies of the candles not the wicks I can see price moves out in an expansive manner and then comes right back down to equilibrium price point and then expands to the outside by having an understanding of these specific characteristics and elements of trading"
    },
    {
      "start_time": 1094.0,
      "end_time": 1123.0,
      "text": "set up you'll give yourself framework to first learn how to practice and study price action and eventually work towards understanding consistent setup discovery and by utilizing the time with me on a daily basis we'll be able to frame these characteristics and pull out specific elements to a trade set up by repetition and by using the daily time with me when we can outline the elements of a trade set up we'll be able to do that"
    },
    {
      "start_time": 1124.0,
      "end_time": 1153.0,
      "text": "to do all these things in a manner where you'll be able to retain it make it yours you'll be able to discover really what type of trade you're going to be because one of these characteristics is going to be your bread and butter condition some of you will trust the equilibrium some of you will trust the order block some of you will look for the void or the liquidity gaps the trade into some of you will have one or two of these characteristics and you'll trade within those parameters"
    },
    {
      "start_time": 1154.0,
      "end_time": 1183.0,
      "text": "they'll frame your trades some of you will eventually grow into understanding all of them and be universal but don't think that you have to have all of them well known and under your belt before you're actually consistent because you can just find one element as we describe here if we just find one for you just for you one you can start being consistently profitable in your trading it only takes one setup you know what context or framework you're going to trade in couple that with an ICT tool"
    },
    {
      "start_time": 1183.0,
      "end_time": 1190.0,
      "text": "and then wait for those conditions you're not going to get a trade every single day but you can get a couple of them every single week"
    },
    {
      "start_time": 1190.0,
      "end_time": 1200.0,
      "text": "if you look at four major pairs with one condition or criteria you'll find a trade every single day but that's not what you're trying to do right now you're going to grow into that over time"
    },
    {
      "start_time": 1200.0,
      "end_time": 1212.0,
      "text": "but for now just go through your charts and try to look at all the examples that's already happened in the left side of your chart and outline them individually based on the characteristics and elements that we've identified here in this teaching"
    },
    {
      "start_time": 1212.0,
      "end_time": 1215.0,
      "text": "until next time I wish you good luck and good trading."
    }
  ],
  "word_count": 3145,
  "segment_count": 65,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:44:25.249529",
  "title": "ICT Mentorship Core Content - Month 1 - Elements Of A Trade Setup"
}