{
  "video_id": "9F-anykT7J0",
  "full_text": "All right folks, this is volume 19 in a continuing series of 20 videos for the optimal trade entry pattern recognition series for the NSCC YouTube channel. All right, our example today is the dollar yen and we already got charts trained in on our five minute basis. And I just want to show you the previous days high as they were trading. You can see there's relative equal highs and here's just a lot of retail theory about this being resistance and any shorts, their protective stop loss could be quote unquote protected above these highs. Well, we're going to see about that. So let's again, remember this is the high. I'll show you. That's where it is. Okay, and I'm going to take this off and do our regular approach. All right, so now pause the video. I'll give you an opportunity to study it before I show you the annotations. All right, let's add the annotations now. So we have our New York session again, always static at 8.30 in the morning, New York time to 11 o'clock, New York time. So it goes straight up in there and you'll see that we create optimal trade entries in here. I like this one. Let me take the annotations off real quick. I like this one because we've already came back down and a little deep on that and it broke a high. So I like this right here. So if you look at the scalping or high probability scalping series, I have on my YouTube channel that'll actually give you a little bit more detail as that I can trust bias. And again, there's more tips in that video series as well. But let's go back to this example here. We have the low to the high optimal trade entry dropping down and on the candle at 10.25 New York time, hypothetical entry would be 108.70 and the entry would have suffered three pips drawdown. 10 pips stop loss, which takes us at 108.60. Doesn't give us too much at the old high and not much going on that either about 14 pips and 20 pips at one standard deviation. And finally, make it to the one and a half standard deviation right here on this candle here offering 28 pips and the standard deviation of two or two standard deviations as I say. It looks like it could potentially pop up in here in the Asian session because right now time of this recording is 739 local time in New York. So that's the business for this example. And tomorrow is our last and final episode for this series. And if you give me thumbs up in tomorrow's video, it might even inspire me to do something else after this one ends. Until I talk to you next time, wish you good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 16.46,
      "text": "All right folks, this is volume 19 in a continuing series of 20 videos for the optimal trade entry"
    },
    {
      "start_time": 16.46,
      "end_time": 20.28,
      "text": "pattern recognition series for the NSCC YouTube channel."
    },
    {
      "start_time": 20.28,
      "end_time": 26.18,
      "text": "All right, our example today is the dollar yen and we already got charts trained in on"
    },
    {
      "start_time": 26.18,
      "end_time": 27.18,
      "text": "our five minute basis."
    },
    {
      "start_time": 27.18,
      "end_time": 34.1,
      "text": "And I just want to show you the previous days high as they were trading."
    },
    {
      "start_time": 34.1,
      "end_time": 39.94,
      "text": "You can see there's relative equal highs and here's just a lot of retail theory about"
    },
    {
      "start_time": 39.94,
      "end_time": 44.78,
      "text": "this being resistance and any shorts, their protective stop loss could be quote unquote"
    },
    {
      "start_time": 44.78,
      "end_time": 46.9,
      "text": "protected above these highs."
    },
    {
      "start_time": 46.9,
      "end_time": 48.82,
      "text": "Well, we're going to see about that."
    },
    {
      "start_time": 48.82,
      "end_time": 51.9,
      "text": "So let's again, remember this is the high."
    },
    {
      "start_time": 51.9,
      "end_time": 53.86,
      "text": "I'll show you."
    },
    {
      "start_time": 53.86,
      "end_time": 54.86,
      "text": "That's where it is."
    },
    {
      "start_time": 54.86,
      "end_time": 62.26,
      "text": "Okay, and I'm going to take this off and do our regular approach."
    },
    {
      "start_time": 62.26,
      "end_time": 64.5,
      "text": "All right, so now pause the video."
    },
    {
      "start_time": 64.5,
      "end_time": 69.26,
      "text": "I'll give you an opportunity to study it before I show you the annotations."
    },
    {
      "start_time": 69.26,
      "end_time": 78.18,
      "text": "All right, let's add the annotations now."
    },
    {
      "start_time": 78.18,
      "end_time": 83.3,
      "text": "So we have our New York session again, always static at 8.30 in the morning, New York"
    },
    {
      "start_time": 83.3,
      "end_time": 86.54,
      "text": "time to 11 o'clock, New York time."
    },
    {
      "start_time": 86.54,
      "end_time": 92.26,
      "text": "So it goes straight up in there and you'll see that we create optimal trade entries in"
    },
    {
      "start_time": 92.26,
      "end_time": 93.26,
      "text": "here."
    },
    {
      "start_time": 93.26,
      "end_time": 94.26,
      "text": "I like this one."
    },
    {
      "start_time": 94.26,
      "end_time": 97.62,
      "text": "Let me take the annotations off real quick."
    },
    {
      "start_time": 97.62,
      "end_time": 102.54,
      "text": "I like this one because we've already came back down and a little deep on that and it broke"
    },
    {
      "start_time": 102.54,
      "end_time": 103.54,
      "text": "a high."
    },
    {
      "start_time": 103.54,
      "end_time": 104.54,
      "text": "So I like this right here."
    },
    {
      "start_time": 104.54,
      "end_time": 108.62,
      "text": "So if you look at the scalping or high probability scalping series, I have on my YouTube"
    },
    {
      "start_time": 108.62,
      "end_time": 114.14,
      "text": "channel that'll actually give you a little bit more detail as that I can trust bias."
    },
    {
      "start_time": 114.14,
      "end_time": 116.98,
      "text": "And again, there's more tips in that video series as well."
    },
    {
      "start_time": 116.98,
      "end_time": 119.14,
      "text": "But let's go back to this example here."
    },
    {
      "start_time": 119.14,
      "end_time": 125.62,
      "text": "We have the low to the high optimal trade entry dropping down and on the candle at 10.25"
    },
    {
      "start_time": 125.62,
      "end_time": 132.86,
      "text": "New York time, hypothetical entry would be 108.70 and the entry would have suffered three"
    },
    {
      "start_time": 132.86,
      "end_time": 133.86,
      "text": "pips drawdown."
    },
    {
      "start_time": 133.86,
      "end_time": 142.22,
      "text": "10 pips stop loss, which takes us at 108.60."
    },
    {
      "start_time": 142.22,
      "end_time": 148.66,
      "text": "Doesn't give us too much at the old high and not much going on that either about 14 pips"
    },
    {
      "start_time": 148.66,
      "end_time": 150.94,
      "text": "and 20 pips at one standard deviation."
    },
    {
      "start_time": 150.94,
      "end_time": 154.9,
      "text": "And finally, make it to the one and a half standard deviation right here on this candle"
    },
    {
      "start_time": 154.9,
      "end_time": 162.74,
      "text": "here offering 28 pips and the standard deviation of two or two standard deviations as I say."
    },
    {
      "start_time": 162.74,
      "end_time": 166.66,
      "text": "It looks like it could potentially pop up in here in the Asian session because right"
    },
    {
      "start_time": 166.66,
      "end_time": 172.1,
      "text": "now time of this recording is 739 local time in New York."
    },
    {
      "start_time": 172.1,
      "end_time": 175.86,
      "text": "So that's the business for this example."
    },
    {
      "start_time": 175.86,
      "end_time": 180.98,
      "text": "And tomorrow is our last and final episode for this series."
    },
    {
      "start_time": 180.98,
      "end_time": 186.26,
      "text": "And if you give me thumbs up in tomorrow's video, it might even inspire me to do something"
    },
    {
      "start_time": 186.26,
      "end_time": 188.26,
      "text": "else after this one ends."
    },
    {
      "start_time": 188.26,
      "end_time": 190.42,
      "text": "Until I talk to you next time, wish you good luck and good trading."
    }
  ],
  "word_count": 480,
  "segment_count": 44,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:33:44.035784",
  "title": "OTE Pattern Recognition Series - Vol.19"
}