{
  "video_id": "_x36n9Jc2JQ",
  "full_text": "Okay folks welcome back. This is video number seven in a continuing series of 20 videos in the inner circle trader optimal trade entry pattern recognition series. All right today's example is the British pound versus the US dollar. All right so here's our daily chart and we're looking at the price action from today and we're going to reference Thursday's price range using the rules that I've provided for you for this series. And here's Thursday's daily range and obviously Friday is here. The low on this particular day on Thursday comes in at 1.21.65 and 8 pipettes. So our line is showing that. And the question is is the day that you're sitting down in front of your charts. Okay. Is it likely to take the previous days high out or the previous days low? What's the market been doing all week? It's been reaching for the previous days low. Previous days low taken out. Previous days low taken out. Previous days low taken out. Previous days low taken out. Okay. The classic support resistance crowd in the retail market. They would have seen this low here because look what happened. It's pretty obvious isn't it? I mean it's the price up didn't. So this level here was the magic level. This was the real support level. And when it came back down into it we had nothing. It just rolled right on into it. Oh but this was the real one. My mistake is really what it was. It was this low here. That's the support level that you would look for. Well that didn't do anything either. You see where I'm going this right? Retail support resistance theory is not the answer. It's not. Now some of you that are watching this video probably not privy to my Twitter feed today. I prompted everyone this morning going in a New York session to look at the British pound. And everyone that's been going through this series and or has been trained by me knows exactly what the lower time frame was indicating at the time. So I don't operate as a signal provider. I don't say here by here put a stop here and take the profits here because I'm not licensed to do so. But I am capable of drawing your attention to a specific market a specific time. And I point you shoot. What does that mean? Well it gives you the opportunity to practice real time and study the things that I teach. And what am I specifically talking about in this video? It's the things that I taught in the first video of the series. The pilot episode of the optimal trade entry pattern recognition series. That video lays the groundwork for this entire discussion on cable. So here's the five minute chart of the British pound. And take a look at the price action here. And if you have not looked for this yet, I'm going to ask you to pause your video that way you can have an opportunity to study it and see what you see before I add the lipstick. Okay, so we're going to add some annotations. So here's that previous days low, Thursday, daily low, coming in at 121.65 and 8 pipettes. And here's our New York session. So that's the time when these formations occur. Now obviously you can see ahead of New York is the New York session where you're doing that at 830. That's what this is here to again 11 o'clock. Nothing is changing. This is static. All right, so you can see our swing high, the swing low, and the retracement back up inside the New York session 62% tracing level trades to it here. Remember that's our suggested entry for studying and back testing this and the market starts to break lower. And there's multiple optimal trade entries in here. There's a swing from this high down to this low to this one. You can do your own projections on that as well. And this one here 1, 2, 3. And again, it's inside the New York session time of day that this outline works well in. First scaling comes out at 40 pips down here at the range low and then half of the standard deviation that makes up the non-t range takes us down to 75 pips for a second scaling. And it's drifted a little bit lower just at the time of this recording. But this is sufficient enough. I look personally for 50 to 75 pips a week. You can do very, very well with less than that. It's not absolutely mandatory that you take that much out of the market every time you sit down. This in itself is an opportunity to be short here and take 75 pips out from there. That's nothing wrong with that at all. It's very, very lucrative way of harvesting pips if you can find setups that offer an yield disgearing. So if you found this insightful, I will continue next week on Monday when we get to our next example until then, wish good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 16.64,
      "text": "Okay folks welcome back. This is video number seven in a continuing series of 20 videos"
    },
    {
      "start_time": 16.64,
      "end_time": 21.24,
      "text": "in the inner circle trader optimal trade entry pattern recognition series. All right today's"
    },
    {
      "start_time": 21.24,
      "end_time": 27.92,
      "text": "example is the British pound versus the US dollar. All right so here's our daily chart"
    },
    {
      "start_time": 27.92,
      "end_time": 35.68,
      "text": "and we're looking at the price action from today and we're going to reference Thursday's"
    },
    {
      "start_time": 35.68,
      "end_time": 42.3,
      "text": "price range using the rules that I've provided for you for this series. And here's Thursday's"
    },
    {
      "start_time": 42.3,
      "end_time": 48.36,
      "text": "daily range and obviously Friday is here. The low on this particular day on Thursday comes"
    },
    {
      "start_time": 48.36,
      "end_time": 57.62,
      "text": "in at 1.21.65 and 8 pipettes. So our line is showing that. And the question is is the"
    },
    {
      "start_time": 57.62,
      "end_time": 62.98,
      "text": "day that you're sitting down in front of your charts. Okay. Is it likely to take the previous"
    },
    {
      "start_time": 62.98,
      "end_time": 70.18,
      "text": "days high out or the previous days low? What's the market been doing all week? It's been reaching"
    },
    {
      "start_time": 70.18,
      "end_time": 75.46,
      "text": "for the previous days low. Previous days low taken out. Previous days low taken out."
    },
    {
      "start_time": 75.46,
      "end_time": 81.58,
      "text": "Previous days low taken out. Previous days low taken out. Okay. The classic support resistance"
    },
    {
      "start_time": 81.58,
      "end_time": 87.26,
      "text": "crowd in the retail market. They would have seen this low here because look what happened."
    },
    {
      "start_time": 87.26,
      "end_time": 91.94,
      "text": "It's pretty obvious isn't it? I mean it's the price up didn't. So this level here was the"
    },
    {
      "start_time": 91.94,
      "end_time": 99.46,
      "text": "magic level. This was the real support level. And when it came back down into it we had nothing."
    },
    {
      "start_time": 99.46,
      "end_time": 105.86,
      "text": "It just rolled right on into it. Oh but this was the real one. My mistake is really what it was."
    },
    {
      "start_time": 105.86,
      "end_time": 110.38,
      "text": "It was this low here. That's the support level that you would look for. Well that didn't do anything"
    },
    {
      "start_time": 110.38,
      "end_time": 118.78,
      "text": "either. You see where I'm going this right? Retail support resistance theory is not the answer."
    },
    {
      "start_time": 118.78,
      "end_time": 126.7,
      "text": "It's not. Now some of you that are watching this video probably not privy to my Twitter feed"
    },
    {
      "start_time": 126.7,
      "end_time": 132.5,
      "text": "today. I prompted everyone this morning going in a New York session to look at the British"
    },
    {
      "start_time": 132.5,
      "end_time": 137.94,
      "text": "pound. And everyone that's been going through this series and or has been trained by me knows"
    },
    {
      "start_time": 137.94,
      "end_time": 145.34,
      "text": "exactly what the lower time frame was indicating at the time. So I don't operate as a signal provider."
    },
    {
      "start_time": 145.34,
      "end_time": 151.94,
      "text": "I don't say here by here put a stop here and take the profits here because I'm not licensed to do so."
    },
    {
      "start_time": 151.94,
      "end_time": 160.62,
      "text": "But I am capable of drawing your attention to a specific market a specific time. And I point you"
    },
    {
      "start_time": 160.62,
      "end_time": 167.26,
      "text": "shoot. What does that mean? Well it gives you the opportunity to practice real time and study the"
    },
    {
      "start_time": 167.26,
      "end_time": 172.98,
      "text": "things that I teach. And what am I specifically talking about in this video? It's the things that I"
    },
    {
      "start_time": 172.98,
      "end_time": 178.98,
      "text": "taught in the first video of the series. The pilot episode of the optimal trade entry pattern"
    },
    {
      "start_time": 178.98,
      "end_time": 186.7,
      "text": "recognition series. That video lays the groundwork for this entire discussion on cable. So here's"
    },
    {
      "start_time": 186.7,
      "end_time": 192.5,
      "text": "the five minute chart of the British pound. And take a look at the price action here. And if you have not"
    },
    {
      "start_time": 192.5,
      "end_time": 199.34,
      "text": "looked for this yet, I'm going to ask you to pause your video that way you can have an opportunity"
    },
    {
      "start_time": 199.34,
      "end_time": 208.34,
      "text": "to study it and see what you see before I add the lipstick. Okay, so we're going to add some"
    },
    {
      "start_time": 208.34,
      "end_time": 214.34,
      "text": "annotations. So here's that previous days low, Thursday, daily low, coming in at 121.65 and 8 pipettes."
    },
    {
      "start_time": 214.34,
      "end_time": 223.34,
      "text": "And here's our New York session. So that's the time when these formations occur. Now obviously you can see"
    },
    {
      "start_time": 224.34,
      "end_time": 232.34,
      "text": "ahead of New York is the New York session where you're doing that at 830. That's what this is here to again 11 o'clock."
    },
    {
      "start_time": 232.34,
      "end_time": 238.34,
      "text": "Nothing is changing. This is static. All right, so you can see our swing high, the swing low, and the retracement back up"
    },
    {
      "start_time": 238.34,
      "end_time": 246.34,
      "text": "inside the New York session 62% tracing level trades to it here. Remember that's our suggested entry for studying and"
    },
    {
      "start_time": 246.34,
      "end_time": 252.34,
      "text": "back testing this and the market starts to break lower. And there's multiple optimal trade entries in here."
    },
    {
      "start_time": 253.34,
      "end_time": 257.34,
      "text": "There's a swing from this high down to this low to this one. You can do your own projections on that as well."
    },
    {
      "start_time": 257.34,
      "end_time": 266.34,
      "text": "And this one here 1, 2, 3. And again, it's inside the New York session time of day that this outline works well in."
    },
    {
      "start_time": 267.34,
      "end_time": 276.34,
      "text": "First scaling comes out at 40 pips down here at the range low and then half of the standard deviation that makes up the"
    },
    {
      "start_time": 276.34,
      "end_time": 285.34,
      "text": "non-t range takes us down to 75 pips for a second scaling. And it's drifted a little bit lower just at the time of this recording."
    },
    {
      "start_time": 285.34,
      "end_time": 294.34,
      "text": "But this is sufficient enough. I look personally for 50 to 75 pips a week. You can do very, very well with less than that."
    },
    {
      "start_time": 294.34,
      "end_time": 305.34,
      "text": "It's not absolutely mandatory that you take that much out of the market every time you sit down. This in itself is an opportunity to be short here and take 75 pips out from there."
    },
    {
      "start_time": 306.34,
      "end_time": 315.34,
      "text": "That's nothing wrong with that at all. It's very, very lucrative way of harvesting pips if you can find setups that offer an yield disgearing."
    },
    {
      "start_time": 315.34,
      "end_time": 321.34,
      "text": "So if you found this insightful, I will continue next week on Monday when we get to our next example until then, wish good luck and good trading."
    }
  ],
  "word_count": 860,
  "segment_count": 44,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:29:22.600876",
  "title": "OTE Pattern Recognition Series - Vol. 07"
}