{
  "video_id": "GtTKPt-K9u0",
  "full_text": "Welcome back folks, this is video number 13 in a continuing series of the optimal trade entry pattern recognition series for the inner circle trader YouTube channel. Alright, our example again today is the dollar CAD and our charts are already trained in on the five minute chart. And I'm going to counsel you to take a look at your daily chart and look at the most recent optimal trade entry that formed which led to this strong breakdown on a daily chart. Now when we see big moves like that, the natural assumption is it's going down too far and it's going to have to reverse. And many times that's going to plague your trust in a pattern like this in the New York session. As you can see the market has been going down and we add the annotations to the chart. You'll see that nothing really has changed. It's still the same logic and you can't this simply say the markets are a result of pattern can't work. It's not how this works. The market's going to seek liquidity and it's going to expand and seek that liquidity above or below the marketplace. If you look at the daily chart, it had really obvious equal lows. I teach that as candy land, it's just ripe for the taking sell side liquidity and couple that with optimal trade entry on a daily chart and you get beautiful results like this. We're going to look at the dollar CAD here. If you haven't already done so, polish your video. All right. So now I'm going to add the annotations. All right. So you can see they have the New York session. Again, standard times, never changing 830 AM New York time to 11 AM. Okay. The optimal trade entry is here. Now obviously you can see that market has been going down and we have this retracement in here inside the heart of the New York session. Trades back to optimal trade entry. Now notice it goes just a little bit above that. That's okay. It's fine. It's not a big deal. You may have looked at this and you elected to use this swing high here. I used this one only because it has the direct displacement from this high starting going lower. It did have a higher high here and I'll show you what that looks like in a moment. But drop down and then consolidation and then run more one more time rally up. To me, I'm going to use this point here before I go to this one. I got to take that annotations off from. And once you can see this one's slightly higher than this one, but this one's where all the volume is. And you see that with the bodies of candles versus this wick. Now adding that, 62% trades at level. That's our standard for this model as an energy pattern. Your stock would have to be above the short term high. Whatever fits your risk appetite if it's 1%, half a percent, 2%, 20%, if you don't want to be in the business too long and then I'll be in bed. All right, so the short term low trades to 38, 11 and a half. So that gives you about what's that 20 pips or so. You have about 20 pips just to the old low here. And then you get half a standard deviation at 39, 93, one full standard deviation at 37, 75 and a half. And then one and a half standard deviation set, 137, 57 and a half. And the low of the day comes in exactly at 1.375, 7 and a half. So beautiful, beautiful symmetry in the dollar CAD. Obvious set up from the daily chart using the things that I've taught obviously on this channel for free. You can go through all the tutorials and see everything I've shown in those videos. Just a couple with this optimal trade entry pattern recognition series, you can see how the things that I teach and I look for appear every single market day in this time of day. So this is an example. Again, you can use for your education. I hope you found it insightful. Until next time, wish good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 14.88,
      "text": "Welcome back folks, this is video number 13 in a continuing series of the optimal trade"
    },
    {
      "start_time": 14.88,
      "end_time": 18.92,
      "text": "entry pattern recognition series for the inner circle trader YouTube channel."
    },
    {
      "start_time": 18.92,
      "end_time": 23.96,
      "text": "Alright, our example again today is the dollar CAD and our charts are already trained"
    },
    {
      "start_time": 23.96,
      "end_time": 26.08,
      "text": "in on the five minute chart."
    },
    {
      "start_time": 26.08,
      "end_time": 30.44,
      "text": "And I'm going to counsel you to take a look at your daily chart and look at the most recent"
    },
    {
      "start_time": 30.44,
      "end_time": 37.0,
      "text": "optimal trade entry that formed which led to this strong breakdown on a daily chart."
    },
    {
      "start_time": 37.0,
      "end_time": 43.84,
      "text": "Now when we see big moves like that, the natural assumption is it's going down too far"
    },
    {
      "start_time": 43.84,
      "end_time": 46.08,
      "text": "and it's going to have to reverse."
    },
    {
      "start_time": 46.08,
      "end_time": 53.72,
      "text": "And many times that's going to plague your trust in a pattern like this in the New York"
    },
    {
      "start_time": 53.72,
      "end_time": 54.72,
      "text": "session."
    },
    {
      "start_time": 54.72,
      "end_time": 60.56,
      "text": "As you can see the market has been going down and we add the annotations to the chart."
    },
    {
      "start_time": 60.56,
      "end_time": 62.56,
      "text": "You'll see that nothing really has changed."
    },
    {
      "start_time": 62.56,
      "end_time": 68.76,
      "text": "It's still the same logic and you can't this simply say the markets are a result of pattern"
    },
    {
      "start_time": 68.76,
      "end_time": 69.76,
      "text": "can't work."
    },
    {
      "start_time": 69.76,
      "end_time": 71.96,
      "text": "It's not how this works."
    },
    {
      "start_time": 71.96,
      "end_time": 76.4,
      "text": "The market's going to seek liquidity and it's going to expand and seek that liquidity"
    },
    {
      "start_time": 76.4,
      "end_time": 77.72,
      "text": "above or below the marketplace."
    },
    {
      "start_time": 77.72,
      "end_time": 82.44,
      "text": "If you look at the daily chart, it had really obvious equal lows."
    },
    {
      "start_time": 82.44,
      "end_time": 88.6,
      "text": "I teach that as candy land, it's just ripe for the taking sell side liquidity and couple"
    },
    {
      "start_time": 88.6,
      "end_time": 93.04,
      "text": "that with optimal trade entry on a daily chart and you get beautiful results like this."
    },
    {
      "start_time": 93.04,
      "end_time": 94.64,
      "text": "We're going to look at the dollar CAD here."
    },
    {
      "start_time": 94.64,
      "end_time": 99.04,
      "text": "If you haven't already done so, polish your video."
    },
    {
      "start_time": 99.04,
      "end_time": 100.04,
      "text": "All right."
    },
    {
      "start_time": 100.04,
      "end_time": 103.88,
      "text": "So now I'm going to add the annotations."
    },
    {
      "start_time": 103.88,
      "end_time": 104.88,
      "text": "All right."
    },
    {
      "start_time": 104.88,
      "end_time": 107.84,
      "text": "So you can see they have the New York session."
    },
    {
      "start_time": 108.32,
      "end_time": 114.64,
      "text": "Again, standard times, never changing 830 AM New York time to 11 AM."
    },
    {
      "start_time": 114.64,
      "end_time": 115.64,
      "text": "Okay."
    },
    {
      "start_time": 115.64,
      "end_time": 118.0,
      "text": "The optimal trade entry is here."
    },
    {
      "start_time": 118.0,
      "end_time": 121.6,
      "text": "Now obviously you can see that market has been going down and we have this retracement"
    },
    {
      "start_time": 121.6,
      "end_time": 126.04,
      "text": "in here inside the heart of the New York session."
    },
    {
      "start_time": 126.04,
      "end_time": 127.04,
      "text": "Trades back to optimal trade entry."
    },
    {
      "start_time": 127.04,
      "end_time": 129.44,
      "text": "Now notice it goes just a little bit above that."
    },
    {
      "start_time": 129.44,
      "end_time": 130.44,
      "text": "That's okay."
    },
    {
      "start_time": 130.44,
      "end_time": 131.44,
      "text": "It's fine."
    },
    {
      "start_time": 131.44,
      "end_time": 132.44,
      "text": "It's not a big deal."
    },
    {
      "start_time": 132.44,
      "end_time": 137.64,
      "text": "You may have looked at this and you elected to use this swing high here."
    },
    {
      "start_time": 137.64,
      "end_time": 143.92,
      "text": "I used this one only because it has the direct displacement from this high starting going"
    },
    {
      "start_time": 143.92,
      "end_time": 144.92,
      "text": "lower."
    },
    {
      "start_time": 144.92,
      "end_time": 148.2,
      "text": "It did have a higher high here and I'll show you what that looks like in a moment."
    },
    {
      "start_time": 148.2,
      "end_time": 153.08,
      "text": "But drop down and then consolidation and then run more one more time rally up."
    },
    {
      "start_time": 153.08,
      "end_time": 156.84,
      "text": "To me, I'm going to use this point here before I go to this one."
    },
    {
      "start_time": 156.84,
      "end_time": 160.04,
      "text": "I got to take that annotations off from."
    },
    {
      "start_time": 160.04,
      "end_time": 165.04,
      "text": "And once you can see this one's slightly higher than this one, but this one's where all"
    },
    {
      "start_time": 165.04,
      "end_time": 167.28,
      "text": "the volume is."
    },
    {
      "start_time": 167.28,
      "end_time": 171.88,
      "text": "And you see that with the bodies of candles versus this wick."
    },
    {
      "start_time": 171.88,
      "end_time": 177.4,
      "text": "Now adding that, 62% trades at level."
    },
    {
      "start_time": 177.4,
      "end_time": 180.48,
      "text": "That's our standard for this model as an energy pattern."
    },
    {
      "start_time": 180.48,
      "end_time": 183.72,
      "text": "Your stock would have to be above the short term high."
    },
    {
      "start_time": 183.72,
      "end_time": 191.04,
      "text": "Whatever fits your risk appetite if it's 1%, half a percent, 2%, 20%, if you don't"
    },
    {
      "start_time": 191.04,
      "end_time": 193.68,
      "text": "want to be in the business too long and then I'll be in bed."
    },
    {
      "start_time": 193.68,
      "end_time": 200.4,
      "text": "All right, so the short term low trades to 38, 11 and a half."
    },
    {
      "start_time": 200.4,
      "end_time": 205.6,
      "text": "So that gives you about what's that 20 pips or so."
    },
    {
      "start_time": 205.6,
      "end_time": 209.0,
      "text": "You have about 20 pips just to the old low here."
    },
    {
      "start_time": 209.0,
      "end_time": 215.76,
      "text": "And then you get half a standard deviation at 39, 93, one full standard deviation at 37,"
    },
    {
      "start_time": 215.76,
      "end_time": 217.0,
      "text": "75 and a half."
    },
    {
      "start_time": 217.48,
      "end_time": 222.24,
      "text": "And then one and a half standard deviation set, 137, 57 and a half."
    },
    {
      "start_time": 222.24,
      "end_time": 228.76,
      "text": "And the low of the day comes in exactly at 1.375, 7 and a half."
    },
    {
      "start_time": 228.76,
      "end_time": 232.4,
      "text": "So beautiful, beautiful symmetry in the dollar CAD."
    },
    {
      "start_time": 232.4,
      "end_time": 237.52,
      "text": "Obvious set up from the daily chart using the things that I've taught obviously on this"
    },
    {
      "start_time": 237.52,
      "end_time": 238.52,
      "text": "channel for free."
    },
    {
      "start_time": 238.52,
      "end_time": 242.88,
      "text": "You can go through all the tutorials and see everything I've shown in those videos."
    },
    {
      "start_time": 242.88,
      "end_time": 247.72,
      "text": "Just a couple with this optimal trade entry pattern recognition series, you can see how"
    },
    {
      "start_time": 247.72,
      "end_time": 253.32,
      "text": "the things that I teach and I look for appear every single market day in this time of"
    },
    {
      "start_time": 253.32,
      "end_time": 254.32,
      "text": "day."
    },
    {
      "start_time": 254.32,
      "end_time": 255.32,
      "text": "So this is an example."
    },
    {
      "start_time": 255.32,
      "end_time": 257.32,
      "text": "Again, you can use for your education."
    },
    {
      "start_time": 257.32,
      "end_time": 258.32,
      "text": "I hope you found it insightful."
    },
    {
      "start_time": 258.32,
      "end_time": 260.56,
      "text": "Until next time, wish good luck and good trading."
    }
  ],
  "word_count": 720,
  "segment_count": 69,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:31:12.278531",
  "title": "OTE Pattern Recognition Series - Vol. 13"
}