{
  "video_id": "j5x90p55O8A",
  "full_text": "Okay folks welcome back this is video number 10 in a continuing series of 20 videos for the SCT Optimal Trade Entry Pattern Recognition Series. Alright so today's example is going to be on the Australian dollar versus the US dollar and we have our chart already trained in on the 5 minute chart. I want you to take a look at the chart and pause the video. Alright this is your last warning before I show you the lipstick on the chart. Alright so we have Tuesday's previous daily high annotated here beginning of May 20th 2020 and we have our New York session time of day delineated on our chart. So we're looking for price to run above Tuesday's daily high. You can see it's reaching out for it there. It's it just pierces it very very very modestly and then it retraces down into our time of day and we're going to add our fib. There's our fib here on our low to high optimal trade entry beautiful touch to the 79 centric level. Touch it again at the 70.5 level which is a sweet spot and price expands above. Comes back find some support at the previous day high and price runs and expands above the big figure 0.6600. Now for the fib I've shown you this in the first video but I just want to show you the levels again like that. People asking on Twitter those are the levels that are highlighted on this fib and the one I've added but I said in one of that can recall what video was in this series but you can add a negative 1.5 level and you can see that being applied here. Okay so that way you have your half standard deviation full standard deviation one and a half standard deviation and two standard deviations. Further look with the details here 65776 entry right at the 60 percent of the trades at level your fill of the on this candle here and using a temp PIP stop 30 PIPs is offered when we're using 0.6610 as our target. So the big figure in here which would be it would be about in here 0.660 doesn't really line up with any of the fib but if we're going to run above Tuesday's high it's probably going to run above the big figure so it's nice to be able to try to capture some kind of movement above that big figure. Now you can simply just use the once standard deviation here and that would be 0.660 again rounding down not demanding that 6603 and 2 PIPs. So we're just using the fib again as a framework it's just a rough idea in terms of the basic profile to the trade it doesn't require or we don't rather demand that these fib levels get hit. It just helps us structure the trade and where we can put our entries in what our stops are going to be and then project it up for potential targets but we use the liquidity above this old high as the real framework and the big figure level I'll add here just for completeness sake so you can appreciate the run on liquidity above that. So it's not that we're requiring this absolute high I have tools and techniques that will give you this very high but it's not important especially not in the scope of a YouTube video series. Okay hopefully you found this insightful until next time I wish you good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 16.0,
      "text": "Okay folks welcome back this is video number 10 in a continuing series of 20 videos for"
    },
    {
      "start_time": 16.0,
      "end_time": 20.0,
      "text": "the SCT Optimal Trade Entry Pattern Recognition Series."
    },
    {
      "start_time": 20.0,
      "end_time": 25.16,
      "text": "Alright so today's example is going to be on the Australian dollar versus the US dollar"
    },
    {
      "start_time": 25.16,
      "end_time": 28.32,
      "text": "and we have our chart already trained in on the 5 minute chart."
    },
    {
      "start_time": 28.32,
      "end_time": 35.32,
      "text": "I want you to take a look at the chart and pause the video."
    },
    {
      "start_time": 35.32,
      "end_time": 41.32,
      "text": "Alright this is your last warning before I show you the lipstick on the chart."
    },
    {
      "start_time": 41.32,
      "end_time": 51.32,
      "text": "Alright so we have Tuesday's previous daily high annotated here beginning of May 20th 2020 and we have our New York"
    },
    {
      "start_time": 51.32,
      "end_time": 55.32,
      "text": "session time of day delineated on our chart."
    },
    {
      "start_time": 55.32,
      "end_time": 59.32,
      "text": "So we're looking for price to run above Tuesday's daily high."
    },
    {
      "start_time": 59.32,
      "end_time": 61.32,
      "text": "You can see it's reaching out for it there."
    },
    {
      "start_time": 61.32,
      "end_time": 72.32,
      "text": "It's it just pierces it very very very modestly and then it retraces down into our time of day and we're going to add our"
    },
    {
      "start_time": 72.32,
      "end_time": 81.32,
      "text": "fib. There's our fib here on our low to high optimal trade entry beautiful touch to the 79 centric"
    },
    {
      "start_time": 81.32,
      "end_time": 88.32,
      "text": "level. Touch it again at the 70.5 level which is a sweet spot and price expands above."
    },
    {
      "start_time": 88.32,
      "end_time": 96.32,
      "text": "Comes back find some support at the previous day high and price runs and expands above the big"
    },
    {
      "start_time": 96.32,
      "end_time": 105.32,
      "text": "figure 0.6600. Now for the fib I've shown you this in the first video but I just want to show you the"
    },
    {
      "start_time": 105.32,
      "end_time": 113.32,
      "text": "levels again like that. People asking on Twitter those are the levels that are highlighted on this fib"
    },
    {
      "start_time": 113.32,
      "end_time": 120.32,
      "text": "and the one I've added but I said in one of that can recall what video was in this series but you can add a"
    },
    {
      "start_time": 120.32,
      "end_time": 126.32,
      "text": "negative 1.5 level and you can see that being applied here."
    },
    {
      "start_time": 126.32,
      "end_time": 131.32,
      "text": "Okay so that way you have your half standard deviation full standard deviation one and a half"
    },
    {
      "start_time": 131.32,
      "end_time": 133.32,
      "text": "standard deviation and two standard deviations."
    },
    {
      "start_time": 133.32,
      "end_time": 142.32,
      "text": "Further look with the details here 65776 entry right at the 60 percent"
    },
    {
      "start_time": 142.32,
      "end_time": 149.32,
      "text": "of the trades at level your fill of the on this candle here and using a temp PIP stop 30"
    },
    {
      "start_time": 149.32,
      "end_time": 160.32,
      "text": "PIPs is offered when we're using 0.6610 as our target. So the big figure in here which would be"
    },
    {
      "start_time": 160.32,
      "end_time": 169.32,
      "text": "it would be about in here 0.660 doesn't really line up with any of the fib but if we're going to run above"
    },
    {
      "start_time": 169.32,
      "end_time": 174.32,
      "text": "Tuesday's high it's probably going to run above the big figure so it's nice to be able to try to"
    },
    {
      "start_time": 174.32,
      "end_time": 179.32,
      "text": "capture some kind of movement above that big figure. Now you can simply just use the once"
    },
    {
      "start_time": 179.32,
      "end_time": 189.32,
      "text": "standard deviation here and that would be 0.660 again rounding down not demanding that 6603"
    },
    {
      "start_time": 189.32,
      "end_time": 197.32,
      "text": "and 2 PIPs. So we're just using the fib again as a framework it's just a rough idea in terms of the"
    },
    {
      "start_time": 198.32,
      "end_time": 206.32,
      "text": "basic profile to the trade it doesn't require or we don't rather demand that these fib levels get hit."
    },
    {
      "start_time": 206.32,
      "end_time": 212.32,
      "text": "It just helps us structure the trade and where we can put our entries in what our stops are going to be"
    },
    {
      "start_time": 212.32,
      "end_time": 221.32,
      "text": "and then project it up for potential targets but we use the liquidity above this old high as the"
    },
    {
      "start_time": 221.32,
      "end_time": 231.32,
      "text": "real framework and the big figure level I'll add here just for completeness sake so you can appreciate the"
    },
    {
      "start_time": 235.32,
      "end_time": 242.32,
      "text": "run on liquidity above that. So it's not that we're requiring this absolute high I have tools and"
    },
    {
      "start_time": 242.32,
      "end_time": 247.32,
      "text": "techniques that will give you this very high but it's not important especially not in the scope of a"
    },
    {
      "start_time": 247.32,
      "end_time": 252.32,
      "text": "YouTube video series. Okay hopefully you found this insightful until next time I wish you good luck and good"
    },
    {
      "start_time": 252.32,
      "end_time": 254.32,
      "text": "trading."
    }
  ],
  "word_count": 595,
  "segment_count": 36,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:30:20.197705",
  "title": "OTE Pattern Recognition Series - Vol. 10"
}