{
  "video_id": "L--1zBIEanY",
  "full_text": "Okay folks welcome back. This is our 20th video and final in this series. As you know all good things must come to an end. So here we have today's example and it's in the Euro Dollar and we have our charts already trained in on a 5 minute chart and you know the drill, you pause the video and take a look at this example and see what you see. And here's the previous days high and I'll scroll back when I have to go over this portion here but between 8.30 in the morning, New York time to 11 o'clock, right there every single day. New York time we have a market run here above the previous days high and it retraces all the way back down into the 70.5 level but for this model, for the YouTube channel, we have a high price entry of 1.1250 and the position entry would have suffered 8 pip drawdown. You do a 30 pip stop loss. At the old high, it's a plus 47. At 1.5 standard deviation, it is 86 pips. Ultimately at 1 standard deviation, it's 124 pips. Really really nice day. Really easy day actually. You don't get these every single day of the week but when they do come, wow, it's very very fun to do it. We participated in an observation today on the British pound versus the US dollar. I'll reserve that for my private group but for now, this is just a wonderful example to close this series out. The previous days high, you can see here and we drew that out on time. And again, as I mentioned earlier in this series, you're going to see examples of this setup that will form when it runs the previous days high or the previous days low and don't think that that's the end of the move. Many times it's just, is the very perfect setup actually. It just shows you that it wants to go higher and it's retracing lower. This gets a lot of the retail traders tripped out. They think that the market's reversing or something that had effect on top information. I remember back in the 90s when I first started, I thought that everyone picked tops and everyone picked bottoms and I quickly found out that I personally at the time couldn't do that. Learning how these markets operate initially with commodities, that market is no different from the foreign exchange market in a lot of ways but the foreign exchange market has a whole lot more subtle nuances that are very specific to it just like the bond market has subtle nuances that are very unique to it. And I'm sure if I were a crypto trader which I'm not, I could probably give a list of things about that asset class that would be very germane to just that asset class alone. So when we go through all these examples and I'm going to count you to go through them multiple times, I'm purposely went in and made them as short as I possibly can right to the point and it gives you basically what a one full month or 20 trading days would be like logging the examples of one market that you find the optimal trade entry in. What will happen is is you will assume, especially if you're new watching this video series, that this pattern should form every single day in the same market and that's not true. There is this pattern always every single day but not every single day is the market that you're following exclusively going to make a really easy run above the previous days higher below the previous days below. So that part you have to work out and build a watch list and those things you can learn how to do that in my free YouTube channel videos and other series. So if you found this insightful, I wish you all good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 13.12,
      "text": "Okay folks welcome back."
    },
    {
      "start_time": 13.12,
      "end_time": 17.56,
      "text": "This is our 20th video and final in this series."
    },
    {
      "start_time": 17.56,
      "end_time": 20.4,
      "text": "As you know all good things must come to an end."
    },
    {
      "start_time": 20.4,
      "end_time": 26.62,
      "text": "So here we have today's example and it's in the Euro Dollar and we have our charts already"
    },
    {
      "start_time": 26.62,
      "end_time": 30.74,
      "text": "trained in on a 5 minute chart and you know the drill, you pause the video and take"
    },
    {
      "start_time": 30.74,
      "end_time": 33.62,
      "text": "a look at this example and see what you see."
    },
    {
      "start_time": 33.62,
      "end_time": 43.78,
      "text": "And here's the previous days high and I'll scroll back when I have to go over this portion"
    },
    {
      "start_time": 43.78,
      "end_time": 51.42,
      "text": "here but between 8.30 in the morning, New York time to 11 o'clock, right there every single"
    },
    {
      "start_time": 51.42,
      "end_time": 52.42,
      "text": "day."
    },
    {
      "start_time": 52.42,
      "end_time": 59.5,
      "text": "New York time we have a market run here above the previous days high and it retraces"
    },
    {
      "start_time": 59.5,
      "end_time": 64.54,
      "text": "all the way back down into the 70.5 level but for this model, for the YouTube channel,"
    },
    {
      "start_time": 64.54,
      "end_time": 72.02,
      "text": "we have a high price entry of 1.1250 and the position entry would have suffered 8 pip"
    },
    {
      "start_time": 72.02,
      "end_time": 73.02,
      "text": "drawdown."
    },
    {
      "start_time": 73.02,
      "end_time": 77.14,
      "text": "You do a 30 pip stop loss."
    },
    {
      "start_time": 77.14,
      "end_time": 82.18,
      "text": "At the old high, it's a plus 47."
    },
    {
      "start_time": 82.18,
      "end_time": 86.06,
      "text": "At 1.5 standard deviation, it is 86 pips."
    },
    {
      "start_time": 86.06,
      "end_time": 89.62,
      "text": "Ultimately at 1 standard deviation, it's 124 pips."
    },
    {
      "start_time": 89.62,
      "end_time": 91.58,
      "text": "Really really nice day."
    },
    {
      "start_time": 91.58,
      "end_time": 93.14,
      "text": "Really easy day actually."
    },
    {
      "start_time": 93.14,
      "end_time": 98.58,
      "text": "You don't get these every single day of the week but when they do come, wow, it's very"
    },
    {
      "start_time": 98.58,
      "end_time": 100.14,
      "text": "very fun to do it."
    },
    {
      "start_time": 100.14,
      "end_time": 105.7,
      "text": "We participated in an observation today on the British pound versus the US dollar."
    },
    {
      "start_time": 105.7,
      "end_time": 111.48,
      "text": "I'll reserve that for my private group but for now, this is just a wonderful example"
    },
    {
      "start_time": 111.48,
      "end_time": 113.38,
      "text": "to close this series out."
    },
    {
      "start_time": 113.38,
      "end_time": 120.66,
      "text": "The previous days high, you can see here and we drew that out on time."
    },
    {
      "start_time": 120.66,
      "end_time": 127.54,
      "text": "And again, as I mentioned earlier in this series, you're going to see examples of this setup"
    },
    {
      "start_time": 127.54,
      "end_time": 132.58,
      "text": "that will form when it runs the previous days high or the previous days low and don't"
    },
    {
      "start_time": 132.58,
      "end_time": 135.18,
      "text": "think that that's the end of the move."
    },
    {
      "start_time": 135.18,
      "end_time": 139.58,
      "text": "Many times it's just, is the very perfect setup actually."
    },
    {
      "start_time": 139.58,
      "end_time": 142.94,
      "text": "It just shows you that it wants to go higher and it's retracing lower."
    },
    {
      "start_time": 142.94,
      "end_time": 145.06,
      "text": "This gets a lot of the retail traders tripped out."
    },
    {
      "start_time": 145.06,
      "end_time": 151.26,
      "text": "They think that the market's reversing or something that had effect on top information."
    },
    {
      "start_time": 151.26,
      "end_time": 155.22,
      "text": "I remember back in the 90s when I first started, I thought that everyone picked tops and"
    },
    {
      "start_time": 155.22,
      "end_time": 159.54,
      "text": "everyone picked bottoms and I quickly found out that I personally at the time couldn't"
    },
    {
      "start_time": 159.54,
      "end_time": 161.06,
      "text": "do that."
    },
    {
      "start_time": 162.06,
      "end_time": 169.42,
      "text": "Learning how these markets operate initially with commodities, that market is no different"
    },
    {
      "start_time": 169.42,
      "end_time": 173.26,
      "text": "from the foreign exchange market in a lot of ways but the foreign exchange market has"
    },
    {
      "start_time": 173.26,
      "end_time": 179.74,
      "text": "a whole lot more subtle nuances that are very specific to it just like the bond market"
    },
    {
      "start_time": 179.74,
      "end_time": 182.9,
      "text": "has subtle nuances that are very unique to it."
    },
    {
      "start_time": 182.9,
      "end_time": 188.3,
      "text": "And I'm sure if I were a crypto trader which I'm not, I could probably give a list of"
    },
    {
      "start_time": 188.38,
      "end_time": 194.78,
      "text": "things about that asset class that would be very germane to just that asset class alone."
    },
    {
      "start_time": 194.78,
      "end_time": 199.34,
      "text": "So when we go through all these examples and I'm going to count you to go through them"
    },
    {
      "start_time": 199.34,
      "end_time": 203.7,
      "text": "multiple times, I'm purposely went in and made them as short as I possibly can right"
    },
    {
      "start_time": 203.7,
      "end_time": 210.1,
      "text": "to the point and it gives you basically what a one full month or 20 trading days would"
    },
    {
      "start_time": 210.1,
      "end_time": 217.82,
      "text": "be like logging the examples of one market that you find the optimal trade entry in."
    },
    {
      "start_time": 218.82,
      "end_time": 223.7,
      "text": "What will happen is is you will assume, especially if you're new watching this video series,"
    },
    {
      "start_time": 223.7,
      "end_time": 231.26,
      "text": "that this pattern should form every single day in the same market and that's not true."
    },
    {
      "start_time": 231.26,
      "end_time": 237.7,
      "text": "There is this pattern always every single day but not every single day is the market that"
    },
    {
      "start_time": 237.7,
      "end_time": 244.18,
      "text": "you're following exclusively going to make a really easy run above the previous days"
    },
    {
      "start_time": 244.18,
      "end_time": 246.42,
      "text": "higher below the previous days below."
    },
    {
      "start_time": 246.42,
      "end_time": 251.22,
      "text": "So that part you have to work out and build a watch list and those things you can learn"
    },
    {
      "start_time": 251.22,
      "end_time": 256.14,
      "text": "how to do that in my free YouTube channel videos and other series."
    },
    {
      "start_time": 256.14,
      "end_time": 259.26,
      "text": "So if you found this insightful, I wish you all good luck and good trading."
    }
  ],
  "word_count": 669,
  "segment_count": 53,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:34:07.558528",
  "title": "OTE Pattern Recognition Series - Vol. 20"
}