{
  "video_id": "Q0SFXEQqI08",
  "full_text": "Welcome back folks. This is part four of the continuing series of the ICT optimal trade entry pattern recognition series. All right. So now we're going to look at a 4x pair, the British pound versus the US dollar. And this is going to be an example of a trendless market where it's not really dependent upon a specific daily bias. And we're just using intraday volatility to find an optimal trade entry. But before I get into it, I want you to take a look at this chart. And I want you to think about what the Neophyte or the new trader that's just being exposed to what I teach or someone that thinks they've been around the block a few times. And they think it's just something being renamed, rehashed, reinvented to try to take credit from some old guy that's perioded and long since been forgotten. Look at this chart. Now, classically, people will say, well, it's just support resistance. And old highs and old lows where the markets turn before. That's all you need to do. Look for those points. And when I first started, I read the same books these people do too. And I can tell you that if it was just that simple, everyone would be billionaires. Okay. It's not support resistance that leads to 4x riches. I needed to find out what was really going on. And when I did all these ideas of support resistance levels faded away. And I got to the real heart of what turns the market and then why the market should react at specific price levels. So now I want to kind of show you what it is. And it's something that you guys are familiar with. If you've been looking at my content for any length of time, but let's go to another chart. Now I'm going to add the perspective that I teach my students. This is the market efficiency paradigm. Okay. And what is that? It's basically the narrative of why price goes where it does and why it reacts the way it does once it gets there. And where is it reaching to next? Okay. So this particular candle here cuts to the whole narrative immediately. And the reason why is you want to look at price and look for areas where they run an old high because old highs right above that is going to be buy stops. And that's what buy side liquidity is. Buy side liquidity could be in the form of buy stops for new entries going long or it could be buy stops protecting existing shorts. The market rams through that. And this action right here is what I teach as a Judas swing. In other words, it's a fake move. It's the low people in the thinking that the market is going to be bullish. It's going to go up. But generally when we see these sharp moves that run previous highs, this to me is highly suspect. And if we get back below the lowest down close candle, once it breaks that, which it does here, the narrative changes to bearish. So all I need to do and my students do is we go to this candle here, draw it out in time. There's your turning point. That's your real support resistance level because it's based on the market efficiency paradigm. That is mind you. Not going to find that in books. You're not going to see any of that anywhere outside of what I teach. And there's a lot of things that go along with this pattern. Too many people go on YouTube now and talk about the ICT breaker or they just remove the ICT and they call it something else of bankers candle. Everybody's got a new twist on what I'm teaching. And they don't know what they're talking about. What I'm showing you here is the narrative behind finding an optimal trade entry with this structure in place. It's a trendless market environment. It doesn't have to have a bullish repair bias on the daily chart. So go into lower time frames and this right in here is what we're going to zoom in on. Okay, so we're going to look at the lower time frame, five minute chart rate here. Okay, but before we go into it, since we're on the hourly chart, I want to annotate the previous days range. Okay, so we have this as the beginning of the 11th and the 12th, which is the day of this recording. And if this is going to be a breaker that's bearish, we're going to be looking at previous days low. That's where we're going to be targeting. So the liquidity that we're just below that, that's what we're really aiming for. So we're just drop down to a five minute chart in this box here and get a closer look at where the OTE forms. Okay, so here's the five minute chart on the British pound versus US dollar and five minute chart for May 12, 2020. And here's straighting up into that area. I outlined on the hourly chart where we can see that breaker price trades up into it. And this old high, returning to it here, hits the same level. Again, it's the breaker. It's not the classic support resistance. It's not the supply zone. It's none of that stuff. Okay, it's the optimal trade entry. Okay, and we'll project this out in time. Okay, so we have high to the low returns back to optimal trade entry. Seven-hours-time tradesmen level lays right on top of that level here. Your stop will be above here. And the market rates an old low here and the fifth levels here. So you could use 123 big figure as your level, not reaching for the fifth because the magic is not the fifth, but reaching below this low for the liquid that resides below here. Now, this is the previous days range. Okay, to the 11th, we also have more time here in our New York session to look for another trade if it forms. Has it taken out previous days? Well, not here. It starts to retrace on this candle here. What time of day is that? 11 o'clock in the morning. That is still time to take another trade. And if it's still there, if it's valid. Alright, so we can see the optimal trade entry here. Low and high retrace back into the New York session and previous day or the 11th of May's low, we will be targeting that next stop would be above here. Your short would be in here at the 62% tradesmen level. And again, below the level of the previous days range low at was at 122, 83 and one pipette. And then the next fifth level would be 122 and 65 and 5 pipettes. So we will be looking for this as a potential objective. But we can just simply use the 12270 level. It would be below the 11th low and not demand the full fib. Now you can do that. But in this example, we're sticking to the rules rounding down and being content. And the result of this is here. Market trades down to the standard deviation of one on the range. And we blow below the 11th's low. Sweep it here, work on it here, and then expand down. So again, this is another example of the optimal trade entry. And this is video number four in a continued series of 20. And I hope you found it insightful. Until next time, good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 16.44,
      "text": "Welcome back folks. This is part four of the continuing series of the ICT optimal trade"
    },
    {
      "start_time": 16.44,
      "end_time": 22.44,
      "text": "entry pattern recognition series. All right. So now we're going to look at a 4x pair, the"
    },
    {
      "start_time": 22.44,
      "end_time": 27.46,
      "text": "British pound versus the US dollar. And this is going to be an example of a trendless"
    },
    {
      "start_time": 27.46,
      "end_time": 33.56,
      "text": "market where it's not really dependent upon a specific daily bias. And we're just"
    },
    {
      "start_time": 33.56,
      "end_time": 38.86,
      "text": "using intraday volatility to find an optimal trade entry. But before I get into it, I want"
    },
    {
      "start_time": 38.86,
      "end_time": 46.44,
      "text": "you to take a look at this chart. And I want you to think about what the Neophyte or the"
    },
    {
      "start_time": 46.44,
      "end_time": 52.58,
      "text": "new trader that's just being exposed to what I teach or someone that thinks they've been"
    },
    {
      "start_time": 52.58,
      "end_time": 57.42,
      "text": "around the block a few times. And they think it's just something being renamed, rehashed,"
    },
    {
      "start_time": 57.42,
      "end_time": 62.58,
      "text": "reinvented to try to take credit from some old guy that's perioded and long since been"
    },
    {
      "start_time": 62.58,
      "end_time": 71.84,
      "text": "forgotten. Look at this chart. Now, classically, people will say, well, it's just support"
    },
    {
      "start_time": 71.84,
      "end_time": 77.1,
      "text": "resistance. And old highs and old lows where the markets turn before. That's all you need"
    },
    {
      "start_time": 77.1,
      "end_time": 82.96,
      "text": "to do. Look for those points. And when I first started, I read the same books these people"
    },
    {
      "start_time": 82.96,
      "end_time": 91.68,
      "text": "do too. And I can tell you that if it was just that simple, everyone would be billionaires."
    },
    {
      "start_time": 91.68,
      "end_time": 100.16,
      "text": "Okay. It's not support resistance that leads to 4x riches. I needed to find out what was"
    },
    {
      "start_time": 100.16,
      "end_time": 108.12,
      "text": "really going on. And when I did all these ideas of support resistance levels faded away."
    },
    {
      "start_time": 108.12,
      "end_time": 113.12,
      "text": "And I got to the real heart of what turns the market and then why the market should react"
    },
    {
      "start_time": 113.12,
      "end_time": 118.68,
      "text": "at specific price levels. So now I want to kind of show you what it is. And it's something"
    },
    {
      "start_time": 118.68,
      "end_time": 122.0,
      "text": "that you guys are familiar with. If you've been looking at my content for any length of"
    },
    {
      "start_time": 122.0,
      "end_time": 127.16,
      "text": "time, but let's go to another chart. Now I'm going to add the perspective that I teach"
    },
    {
      "start_time": 127.16,
      "end_time": 135.32,
      "text": "my students. This is the market efficiency paradigm. Okay. And what is that? It's basically"
    },
    {
      "start_time": 135.32,
      "end_time": 141.12,
      "text": "the narrative of why price goes where it does and why it reacts the way it does once"
    },
    {
      "start_time": 141.12,
      "end_time": 147.8,
      "text": "it gets there. And where is it reaching to next? Okay. So this particular candle here"
    },
    {
      "start_time": 147.8,
      "end_time": 154.24,
      "text": "cuts to the whole narrative immediately. And the reason why is you want to look at price"
    },
    {
      "start_time": 154.24,
      "end_time": 158.6,
      "text": "and look for areas where they run an old high because old highs right above that is going"
    },
    {
      "start_time": 158.6,
      "end_time": 162.48,
      "text": "to be buy stops. And that's what buy side liquidity is. Buy side liquidity could be in the form"
    },
    {
      "start_time": 162.48,
      "end_time": 167.44,
      "text": "of buy stops for new entries going long or it could be buy stops protecting existing"
    },
    {
      "start_time": 167.44,
      "end_time": 174.88,
      "text": "shorts. The market rams through that. And this action right here is what I teach as a"
    },
    {
      "start_time": 174.88,
      "end_time": 179.64,
      "text": "Judas swing. In other words, it's a fake move. It's the low people in the thinking that"
    },
    {
      "start_time": 179.64,
      "end_time": 183.96,
      "text": "the market is going to be bullish. It's going to go up. But generally when we see these"
    },
    {
      "start_time": 183.96,
      "end_time": 191.48,
      "text": "sharp moves that run previous highs, this to me is highly suspect. And if we get back"
    },
    {
      "start_time": 191.48,
      "end_time": 200.2,
      "text": "below the lowest down close candle, once it breaks that, which it does here, the narrative"
    },
    {
      "start_time": 200.2,
      "end_time": 206.48,
      "text": "changes to bearish. So all I need to do and my students do is we go to this candle here,"
    },
    {
      "start_time": 206.48,
      "end_time": 211.04,
      "text": "draw it out in time. There's your turning point. That's your real support resistance level"
    },
    {
      "start_time": 211.04,
      "end_time": 215.56,
      "text": "because it's based on the market efficiency paradigm. That is mind you. Not going to find"
    },
    {
      "start_time": 215.56,
      "end_time": 220.0,
      "text": "that in books. You're not going to see any of that anywhere outside of what I teach. And"
    },
    {
      "start_time": 220.0,
      "end_time": 223.52,
      "text": "there's a lot of things that go along with this pattern. Too many people go on YouTube"
    },
    {
      "start_time": 223.52,
      "end_time": 228.12,
      "text": "now and talk about the ICT breaker or they just remove the ICT and they call it something"
    },
    {
      "start_time": 228.12,
      "end_time": 234.4,
      "text": "else of bankers candle. Everybody's got a new twist on what I'm teaching. And they don't"
    },
    {
      "start_time": 234.4,
      "end_time": 239.84,
      "text": "know what they're talking about. What I'm showing you here is the narrative behind finding"
    },
    {
      "start_time": 239.84,
      "end_time": 245.4,
      "text": "an optimal trade entry with this structure in place. It's a trendless market environment."
    },
    {
      "start_time": 245.4,
      "end_time": 249.32,
      "text": "It doesn't have to have a bullish repair bias on the daily chart. So go into lower time"
    },
    {
      "start_time": 249.32,
      "end_time": 253.76,
      "text": "frames and this right in here is what we're going to zoom in on. Okay, so we're going to"
    },
    {
      "start_time": 253.76,
      "end_time": 257.96,
      "text": "look at the lower time frame, five minute chart rate here. Okay, but before we go into"
    },
    {
      "start_time": 257.96,
      "end_time": 265.32,
      "text": "it, since we're on the hourly chart, I want to annotate the previous days range. Okay,"
    },
    {
      "start_time": 265.32,
      "end_time": 272.32,
      "text": "so we have this as the beginning of the 11th and the 12th, which is the day of this recording."
    },
    {
      "start_time": 272.32,
      "end_time": 276.68,
      "text": "And if this is going to be a breaker that's bearish, we're going to be looking at previous"
    },
    {
      "start_time": 276.68,
      "end_time": 282.6,
      "text": "days low. That's where we're going to be targeting. So the liquidity that we're just"
    },
    {
      "start_time": 282.6,
      "end_time": 286.28,
      "text": "below that, that's what we're really aiming for. So we're just drop down to a five minute"
    },
    {
      "start_time": 286.28,
      "end_time": 292.24,
      "text": "chart in this box here and get a closer look at where the OTE forms. Okay, so here's the"
    },
    {
      "start_time": 292.24,
      "end_time": 296.8,
      "text": "five minute chart on the British pound versus US dollar and five minute chart for May"
    },
    {
      "start_time": 296.8,
      "end_time": 302.68,
      "text": "12, 2020. And here's straighting up into that area. I outlined on the hourly chart where"
    },
    {
      "start_time": 302.68,
      "end_time": 309.28,
      "text": "we can see that breaker price trades up into it. And this old high, returning to it here,"
    },
    {
      "start_time": 309.28,
      "end_time": 314.8,
      "text": "hits the same level. Again, it's the breaker. It's not the classic support resistance."
    },
    {
      "start_time": 314.8,
      "end_time": 325.24,
      "text": "It's not the supply zone. It's none of that stuff. Okay, it's the optimal trade entry."
    },
    {
      "start_time": 326.24,
      "end_time": 332.24,
      "text": "Okay, and we'll project this out in time."
    },
    {
      "start_time": 332.24,
      "end_time": 344.8,
      "text": "Okay, so we have high to the low returns back to optimal trade entry. Seven-hours-time"
    },
    {
      "start_time": 344.8,
      "end_time": 349.52,
      "text": "tradesmen level lays right on top of that level here. Your stop will be above here. And the"
    },
    {
      "start_time": 349.52,
      "end_time": 360.16,
      "text": "market rates an old low here and the fifth levels here. So you could use 123 big figure"
    },
    {
      "start_time": 360.16,
      "end_time": 365.84,
      "text": "as your level, not reaching for the fifth because the magic is not the fifth, but reaching"
    },
    {
      "start_time": 365.84,
      "end_time": 370.92,
      "text": "below this low for the liquid that resides below here. Now, this is the previous days range."
    },
    {
      "start_time": 370.92,
      "end_time": 378.76,
      "text": "Okay, to the 11th, we also have more time here in our New York session to look for another"
    },
    {
      "start_time": 378.76,
      "end_time": 386.04,
      "text": "trade if it forms. Has it taken out previous days? Well, not here. It starts to retrace on"
    },
    {
      "start_time": 386.04,
      "end_time": 390.58,
      "text": "this candle here. What time of day is that? 11 o'clock in the morning. That is still"
    },
    {
      "start_time": 390.58,
      "end_time": 395.08,
      "text": "time to take another trade. And if it's still there, if it's valid. Alright, so we can see"
    },
    {
      "start_time": 395.08,
      "end_time": 404.32,
      "text": "the optimal trade entry here. Low and high retrace back into the New York session and"
    },
    {
      "start_time": 404.32,
      "end_time": 409.96,
      "text": "previous day or the 11th of May's low, we will be targeting that next stop would be above"
    },
    {
      "start_time": 409.96,
      "end_time": 416.16,
      "text": "here. Your short would be in here at the 62% tradesmen level. And again, below the level"
    },
    {
      "start_time": 416.16,
      "end_time": 424.8,
      "text": "of the previous days range low at was at 122, 83 and one pipette. And then the next"
    },
    {
      "start_time": 424.8,
      "end_time": 432.28,
      "text": "fifth level would be 122 and 65 and 5 pipettes. So we will be looking for this as a potential"
    },
    {
      "start_time": 432.28,
      "end_time": 439.52,
      "text": "objective. But we can just simply use the 12270 level. It would be below the 11th low"
    },
    {
      "start_time": 439.52,
      "end_time": 445.64,
      "text": "and not demand the full fib. Now you can do that. But in this example, we're sticking"
    },
    {
      "start_time": 445.64,
      "end_time": 456.0,
      "text": "to the rules rounding down and being content. And the result of this is here. Market trades"
    },
    {
      "start_time": 456.0,
      "end_time": 465.08,
      "text": "down to the standard deviation of one on the range. And we blow below the 11th's"
    },
    {
      "start_time": 465.08,
      "end_time": 471.44,
      "text": "low. Sweep it here, work on it here, and then expand down. So again, this is another example"
    },
    {
      "start_time": 471.44,
      "end_time": 476.88,
      "text": "of the optimal trade entry. And this is video number four in a continued series of 20."
    },
    {
      "start_time": 476.88,
      "end_time": 479.72,
      "text": "And I hope you found it insightful. Until next time, good luck and good trading."
    }
  ],
  "word_count": 1282,
  "segment_count": 76,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:28:09.832569",
  "title": "OTE Pattern Recognition Series - Vol. 04"
}