{
  "video_id": "qC0LogyIk2I",
  "full_text": "This is the fourth of eight installments for the first month of the ICT Man's tour ship. We are covering equilibrium versus discount. Now, again, just as a full warning for some of you, we're actually pupils applying prior to me starting this mentorship. This is going to seem a little bit elementary initially, but I promise I'll add something to it that may bring a little bit more depth to the understanding of what optimal trade entry is. Long time ago, back in 2010, I introduced a simple idea of looking at swing projections, retracements, and identifying what would be deemed as optimal trade entry. Everyone that saw it obviously fell in love with it. It was easy for them to see. They would apply it really quick to the chart. I think the reason why is because it had an indicator applied to it and it being the Fibonacci. Now, Fibonacci doesn't have any magic, doesn't have any significance by itself yet to understand where the market may want to reach for. There's going to be a certain measure of provocation on your part. The Fib doesn't do everything for you. I want to draw your attention to looking at where markets are most likely to create by conditions. This is not by signal entries. This is just framing a context initially as a new trader. Someone new to technical analysis, someone new to my principles. It's going to give you a foundation so that we can go into the chart and start looking at these things and measure them and study them. All this is meant is to give you a framework to work within in your demo account. Everyone should be working inside the FORX LTD demo account as I established at the beginning of this mentorship. We have multiple price swings in here on this daily chart. We're looking at primarily a daily chart initially for our setups. If you're a new trader and you just seemed overwhelmed, and you probably heard me talk about certain things already in this mentorship, maybe you've watched some of my videos on YouTube or my website's tutorial section. You heard terms that went right over your head. Some of the terms are created by me. Some of them are industry standards. Some are going to require a little bit more description about what they mean later on in the mentorship. If you hear something even in this presentation, just make a note of it in your notes and then obviously you'll pick up the understanding as you go deeper every month or something new. For now, I want you to focus on a simple question. If a trader believes that the market is going to go higher, what would frame that context? What would give the trader that conclusion to trust buying a specific market? What goes into making that decision? Well, the first thing I want you to understand is this is going to be like the very first baby step to understanding institutional order flow. The first thing you need is movement. You have to understand that to be a buyer, there has to be a willingness of somebody with bigger, bigger pockets than you, more money than you, and they are the ones that move price around and they are the banks. They are only going to let price go higher when it suits their purpose. It is not going to be a supply demand factor. It is going to be a greed factor. They want money. They are in the business of making money. After all, that is their nature of their business. That is a bank. If we are looking for buying opportunities, many retail traders look for all of these patterns and indicator based ideas. I want you to focus primarily on price. Price alone will give you everything you will ever need in terms of indicating higher or lower price and it will actually give you the actual specific entries and your exits. You don't need anything else outside of a price chart. The open high loan closed does everything for you. I want you to look at this low down here and I want you to look at this high up here. Do you see how that is the biggest price swing on this entire chart? So between August 14th, all the way to the present time in September, there has only been one major price swing higher and lower. If we take a Fibonacci level, I am only going to use Fibonacci to illustrate equilibrium. This is the largest price range or the market range that is presently being traded in. What do I mean by present market range? This is the highest range we have seen in the last month or so. If we look at this range, there is nothing more significant than that except for this one back here. We are going to primarily use this because it has a very strong reaction. We can use these back here. I will do it for a complete mistake later on in the video. But for now, I want you to see we have a very strong and positive move away. Then it comes back, retraces, then it has another strong and positive move away and comes all up here to the high. When we say impulsive price move or what we have referred to as impulsive price swing going forward throughout this mentorship, that is the indication that there has been displacement. Now displacement is where someone with a lot of money comes in the marketplace and they have a strong conviction to move price higher. We already know that price is going to be set by the central bank. If they are letting price run this high, they are offering at a higher price as long as there is buyers coming in. They are going to keep offering at price there. As long as they keep finding buyers as they keep raising price up, they will keep expanding price higher, higher, higher until there is no longer any interest for them to pair up orders with participants. They will allow price to retreat a little bit until they can get more buy stops above the marketplace. It is not a buyer, buyer, buyer, buyer, buyer market and then keep stretching price. They have already bought down here and then they are allowing price to be offered to the marketplace at higher prices. As that happens, they are selling off their positions at a lower low. From here, the banks are in long positions in here, they are accumulating long positions. Once they are accumulating a position, they allow price to go higher. Once that price goes higher, higher, higher, higher, higher, it keeps going higher until their position is funded and they no longer want any more position held. They are looking for localization areas where they know that they are going to be willing participants to buy. That is going to be above this old high back here. Why would they want to take price above that old high here? Because there are going to be buy stops on a fund level. That means big money managed funds will have stop loss orders right above that high. I am going to go into details in this mentorship about where stops are, how to pick out institutional funds, levels where their stops are at, where high target big money moves are going to occur. All those things will be taught to you. But for now, I just want to start you very small because there are a lot of folks that just started with this mentorship and they have never really been through the complete library of my concepts. They have really exposed themselves to technical analysis. All this seems Greek to them. I don't mean that offended by that maybe Greek, but it is an expression in the States. It means it is alien to them. The first thing I want you to look for in price is you want to see impulsive price swings. Since we are primarily looking for discount markets and relative terms to equilibrium, we first have to understand what an impulse price swing is. Let me take the fifth off real quick and go back to that price leg right here. Let me take all this off over here. We have one big strong impulsive price swing right here. It comes off this low and rallies up. We don't need to know what calls the buy down here. It is not interesting at all to me. I don't care. We don't know this price link is going to start until I'm sorry. We don't know this price leg is here until it forms. I'm giving you a perspective studying in hindsight the low to this high in here. That rally up or that impulsive price swing. We only require price to start coming down off of that and it takes at least four candles. No matter what time frame you're on, you need four candles. When the market makes a low and starts rallying up, what you're going to look for is once you see a high form, let me zoom in. Once you see a high form, you need four candles, why four candles? You need to have one candle to the left, one candle in the center of the highest one, then a lower candle to the right. That's a swing high and then you got to see price go lower. When that happens, you start waiting for price to retrace back to equilibrium. Now what is equilibrium? Equal equilibrium is a midway point of a price move. We're matching the high from this low. You take your fib, you draw it up to the low and you drop it. Equal equilibrium is over here. Let me scrunch this up a little bit more. We have this price leg up. Impulsive price swing goes higher. As soon as we get three candles, then only then will we start watching for price to come down to the equilibrium price point. That is basically the Fibonacci level 50%. We're looking for price to come down to that level. As soon as it comes back to that level and more on a daily chart, we go down into a lower time frame and we hunt buying opportunities. I'm not teaching you buying entry signals. I'm giving you context of how to discern when the market goes to discount and when it's at a premium. We're not trading at premiums. I'll teach you how to use premiums the first video of next week. We're only focusing primarily on equilibrium versus discount. We have a price swing that moves from a low aggressively up. We don't do anything until we start seeing a down move and it has to happen after three candles basically making a swing high. Swing high looks like this. You can see it has a high and a candle to the left that's lower and a candle to the right that's lower. That's a swing high. Once that swing high forms, we're waiting for the fourth candle to start coming lower. We're looking for four candles to start turning around. When that happens, that gives you now you're allowed to start looking for the market to come down into equilibrium. That means the 50% level. Once you're on a 50% level and you're in a higher time frame and we start everything at a daily chart. At the daily chart, we know now that between the low here and the high here, the market now has gone back to equilibrium. It's at fair value for it fair market value. If you get something in fair market value, obviously you're not paying a premium but you're not really getting a discount either. It's still a neutral to bullish condition. That means you're not buying at an inflated price. This time period right here to market is offering an opportunity to be long. I'm not going down to lower time frames today. I'm not going to teach you that today. The only thing I'm giving you right now is developing context around the daily institutional price levels that are derived at on the daily chart. All you're looking for is impulsive price swings first, letting price settle back down into equilibrium. Then we discern what we're going to do once we get to that level. As you see, without going to lower time frames, the price does rally again. Where does it rally back up to? It's old institutional order flow reference point, which is an old high back here. It goes right above that previous high. See that? Now the market trades off again and goes lower. So we have now a new range. We have to now put the Fibonacci on this high keeping it off the same low. Now why did I do that? Because this price low has not been violated. It only retraced down to here and rallyed up again. Then we wait for three candles. The high candle to the left is a lower one to the right is a lower one. This is probably a Sunday and even still this is one here. Either way, you don't want to count Sundays, by the way, empty for one else for XLTD does give you the Sunday candle. So you got to factor that out. Don't don't count Sundays candle because it's a non event. So that's probably going to end up becoming this candle here. Once you get the down candle here that the market has in fact turned it's starting to go lower. Notice what's happening here. We're not rushing. We don't need the catch to high. Okay, it gives us all kinds of time to wait and plan and build an idea about what it is specifically we're going to do when price gets to equilibrium price drops down a little bit more than it goes up. What do we do the whole time this is happening nothing. We're not doing anything. This is a higher time frame principle. Most of you are all begging for a higher time frame principle to trade with. This is the beginning building blocks to that. Okay, market trades lower lower. What do we do here nothing. We're not doing anything here yet. Okay, nothing. Train lower, lower, lower, lower. All of a sudden boom, it hits equilibrium over here. Now we can start studying price. We want to study price when the lower time frames will look for entries, but not teaching you entry signals here. I'm giving you context. As soon as we get to equilibrium, we are now at fair market value. So the market is permitted to be bought. Okay, at the banking level they will be able to buy at these levels because they're not at a premium based market. The levels of trading at this level here are fair market value. Now banks are just like anyone else. If you go to the grocery store and you see stakes for $10 of, I don't even know what they cost because my wife does all shopping. If a stake costs $10 at the market and it drops down to $8.50 a stake that's probably a discount. And it may not be that price. I don't know, but for the sake of analogy, we're using it. That means that we now at a discount anything below equilibrium is now a discount market. When markets go below equilibrium, they do not spend much time below equilibrium and there's usually a very dynamic price move away from that, especially if the context behind the marketplace is bullish. Now looking at this framework we have here, we had an impulsive price swing here, a little tiny little trace and came back to equilibrium. One time took out the high over here and then sold off. Okay, went back down into equilibrium again and went to a discount below 50% of the impulse price swing. That is now at a discount. So the market on the banking perspective is that this now is now at a discount. It is allowed to be bought. Now you just don't go indiscriminately in there trying to buy it just because it goes back to 50% or less. That's not enough. You've got to have more information. But for now, I just want to give you when we have a bullish scenario for a marketplace. Okay, if we think it pairs bullish, we look for impulsive price swings on the daily chart, the frame, higher time frame ideas. There's other trades that you can take in lower time frames in between these, but for now, I want you primarily focused on just this because it'll give you all the things that you've probably been lacking with higher time frame ideas and the beginning box of directional bias. Because it's daily, it gives you a lot of time too. You don't have to be sitting in front of an intraday chart. You don't have to worry about the balls catching you doing something and stealing time at the job. This gives you a lot of flexibility and time to prepare for an idea of the trade on. So when we get the equilibrium, we know that we are at fair market value. It's a market that can be bought if we are bullish, but we can't buy it. We can't buy above this level up to here. Okay, that's the plan what I'm saying. The best buys come at equilibrium or less anything below equilibrium or 50% level is viewed as a discount. Now, the wonderful thing about understanding this is when a market is at discount and it's underlying basis is bullish, discount prices don't stay in the market very long. The market is going to want to run away from that really quick because this is a daily chart. This isn't that bad in terms of how much time it spent down here below equilibrium. When you can see finally it explosively moved away from that and rally up through what I asked you guys to do in the third tutorial, which was to win your charts and mark out areas of where equal highs would be and where old highs would be. The market rallies from that price point and goes right back up and clear that these equal highs. When these equal highs are taken out if you were a trader that only took along in this area and it don't have to be exact science as far as where it was. We're just going to speak in general terms if you went along somewhere in this small little consolidation before the expansion. Okay, between buying the 95 big figure roughly up to these equal highs that's about 98 50. You have about 98 50 and you bought around 95 50 sets 300 pips move on a signal that would have formed it took a little bit of while to come the fruition, but based on equilibrium and discounting. Okay, you can frame the ideas in which the market should react. It should be viewed as a discount across the board and if it is in fact bullish, the banks will dog pile on this and send the price higher and it should be with quick dynamic price action. Understanding where it should be reaching for above old highs above equal highs above close in a range. Okay, which we don't really have in here, but I'm just showing you just one example here already the first one it's 300 pips. Okay, then we have another price move all up here this there's no real retracement in here because lots we have a high equal a little bit lower here and then here's one here. If we were to measure the low to this high, it doesn't come down the 50% is nowhere near I can eyeball that you can probably do that too, but I probably might let's just do it because some probably going to have some of you folks that are from different countries have a hard time understanding my English low loan 4x. If we would have measured just this impulsive price swing right here notice that even though we had the candle here lower on the fourth one it had up close but it was still lower. Nothing came back down the equilibrium it stayed at a high price and it's kept going higher and higher and higher and higher and higher. So if we go back to adding the feed to that initial price low here and we stretch it because now we broke we broke this high. We're going to keep drawing the fifth up on swings that move up dynamically so we have this big parent price swing. So now we're going to wait until price gets back down the equilibrium when do we start waiting for that when the market show is a swing high which it does here. Then we start counting to the fourth candle where it drops to the fourth candle has to move lower or be lower than the highest candle that makes a swing high. It's all it's a very simple thing and then from there we just start waiting and count down every time it goes down to a new low low low low low low and finally what's it hit right here. Equilibrium at that 50% mark as soon as it does that the market is at a fair market value so that it can be bought on the banking level it cannot be bought until it gets to that level or below. They won't come in they won't do it it's not based on Sibonacci I'm just showing you in terms of equilibrium between old highs and old lows it's just evaluation marker that's all it is. Okay so the algo will kick into a buy mode in here especially if they have orders at that level or just a little bit below it and if they are there you'll know it because the price will react immediate like it does here it hits it one time it doesn't have another camera touch it this one gets close to it but it's still rallies away. Okay so now watch what happens we have another impulse swing here price moves away from an area where we expect it to rally why do we expect it to rally there because between this low and this high price should be sensitive here on the upside and it rallies now watch what happens this is a big big step I'm going to keep this Fibonacci just like it is I'm going to add another one. Right on the low that starts here and it runs up here see that so between this low up to this high why we count in this swing why are we using this Fibonacci price swing Michael and not something else because this one showed reaction to want to move away from an area we would expect it to move and now watch we have a swing high here's a high lower high lower high and this candle is lower than the one on the highest portion of the swing high so now we start counting down until we get the swing high. So we start counting down until price gets to what equal liberal or less the next candle doesn't do it this candle does it goes right down through equilibrium down into what we call optimal trade entry so when we get below equilibrium all this timing here look how much time it gives you opportunities to get in at 62 to 70 and a half percent which is optimal trade entry sweet spot if you look at that price gathers up more orders and we're going to get a little bit more of a swing high. Rally's away aggressively much it happens again now we have another reference point. This is where we expect it price to react and it did it gets us another price leg before all up here from this low to this high we get high a low a lower low on this one and we're already below equilibrium look at the eyes of the candle we wick through it. I'm not going to talk about order blocks here as much as I want to right now. It's for some of you guys that do know and a block you'd probably know what I'm talking about before I would say it. But in here we expect price to be sensitive in here. Okay, because we're below 50% or equilibrium, we're at a discount price should not spend much time there at all. It quickly rallies away. Okay, and it comes back down. I could draw a fib on this low to this high. I mean, just do it. After all that's the context of what we're teaching here today, right? Coal in a fib on all these levels where there should be reaction. Okay, market rallies up. Here's the swing high. The next candle, the fourth candle's got to be lower. It does. It trades through equilibrium right into optimal trade entry. Does it stay there along? No, it rallies up. Comes back. It doesn't break the high. Comes back one more time to equilibrium and then the aggressive moves away. Expans, expands, expands, expands, expands, expands, expands. And then finally, it gets us a reversal. But nonetheless, that right there from buying in here to here, let's look at that in terms of range. 300 pips again. Okay, it's not every day setups. Okay, but it's giving you significant setups. If we look at the moves that we called in here using what I'm showing you, if you bought down in here, just to this level here's 140 pips. To here, it's 272 pips. If you held onto it, it's 400 pips. This price move in here. Price should be sensitive right here. I thought it in here. Order blocks right here. You'll learn about those. But the Fibonacci we just showed you, it's still there. And watch this. We had a price swing here that reacted off of the level that should be bullish. Here's our new price leg here. We have a high and a higher high. So we have a higher magnitude price swing that's going higher. We wait for the swing high to form. Down candles right here. Equalibrians right here. The optimal trade entry, which is discount. It's got to be below equilibrium. If the market is below equilibrium, we are in a discount market and it should not go below the old, low it forms. In other words, wherever the impulse price swing is, that low it starts from. It can't go below that. So think about what it's already giving you. It's giving you a framework to work within. Okay, I don't need to know exactly where I'm buying it. I just know a general area. I can fine tune that down into lower timeframes when we do top down analysis. I'll teach that. But for now, if we understand this is the low we draw our Fibonacci from, a stop loss has to be below there when this time frame. So we can buy in this area here, put a stop loss down here, define the risk between that and in how much of a risk through war will we get based on how far it should reach up. Every time, every time that price makes an impulse price swing higher, we just wait for it to come back down and there's no rush. We just wait. It takes three candles on the third candle. It can hit equilibrium go below it, but we need to just simply wait for the swing high to form and then you watch it drop down. Want to drop down? You know what you're going to be expecting. The price move should be explosive to the upside because the market goes back to a discount below equilibrium. It can be a sensitive at equilibrium, but here's what we're supposed to be focusing primarily on. You want high odds trades. You want high probability explosive price action moves in your favor. That happens when it goes below equilibrium because the market will go to a very, very suppressed levels. And when they go below equilibrium to a discount level, the markets will not sustain discount prices very long. If the underlying pinnings of the marketplace is bullish. So it gives you two things. It gives you a context to work with them when you provides and it gives you also a relative strength study that's built in. It should be sensitive. It should be dynamic price action moves away from that equilibrium or less. More specifically, below equilibrium. So that's where the optimal trade entry idea came from when I was using the 62% to 7% tradesmen levels that you've been using. I was using the 62% to 7% tradesmen levels that you see on my Fibonacci's. Well, it's this area 62, 70.5 and 79%. OK, and those levels are very, very sensitive, not because of Fibonacci's sake, but because it's really just measuring how far the current price range has been. The Alga had a low down here and it had a high here. This is the total range that we're trading inside of. Right now, OK, right now, this is, this is right now current as of today. Friday's close of September 16th. So right now, we are in the range that's been defined by the high and the low here. So that level of equilibrium still exists, which is here. So any by condition that occurs below this level here is high probability. What does that mean? That means you just measure every single impulsive price lag higher when it moves up. Actually, let's do this. Let's shade this area. And that way, we'll understand that anything below anything below here, that's in a high probability or discount market. OK, so now when we when we understand that, we can define every single price lag that moves up, which is an impulsive price swing. When it moves higher, all we have to do is measure the new equilibrium point that which it's created. And here, I'm going to start right here. There's an impulse price lag right there. So we have the low up to the high swing high. Fourth canals gotta be down. It does hit equilibrium. Should it respond? Yes, it should be dynamic. Does it go higher? Yes, it does. Makes a new high. Where's it go to, Michael? Above a previous high over here. And then it trades back down. Now, here we have equilibrium. It trades the equilibrium and then aggressively trades through it. You're probably thinking, oh, it's failed. It does. That's what's going to happen sometimes. You're going to lose money. I want you to understand that it's not going to be perfect, but it's going to give you more context than you have right now, especially if you're new. If you have been looking at price action before, you probably have never looked at it like this in terms of valuation between equilibrium and discount. And we're going to teach the importance of that the rest of this month in the remaining teachings. But for now, I'm going to introduce you the idea of viewing price in this context. Below equilibrium here, no discount. We come all the way back down and take out a stop. Stop runs is what's going to be a different profile. And if you take a loss, that's what you expect. You expect this occurrence to happen where the market takes the low out. Well, if it does take that low out, what is it probably really doing? It's taking stops out so that it should be a turtle soup. Turtle soups a false breakout pattern. It went below that low. We should see a responsiveness that's aggressive that moves higher. We see that here. Market trades up makes an impulsive price leg. From that low, all the way up to here. Now watch, here's the cool part about this. We have a swing high. You have the high, the lower high, the lower high. And the fourth candle is damn. Does it ever get down to equilibrium? No. So we have no trade. We don't catch anything that keeps going up. No problem. I'm worried about you. I'm worried about it. Next price leg. We look for. Okay, we have this price leg here. We're only focusing on inside the yellow area. That's the shaded discount portion of this market. The dollar is swissy. This current market is at discount below. Below this line here, this is equilibrium. The top of the yellow shaded area. And below is discount. So the market should be responsive at levels of discount. After we see this high form, we look for the high, the swing high form, and the fourth candle's got to show willingness to be lower. It does. And then we simply just wait. Wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, until it hits the equilibrium. And then we go down to lower time frames. And we look for trading signals. There may or may not been, they may or may not have, rather, then one here. Okay. I'm going to say, maybe you took one there and maybe it took, and you took a loss. Great. No problem. You took a loss. Great. No problem. You took a loss. Here's a here's a losing trade here. And here's a losing trade here. No problem. We had a winner here. Market's going down into a deeper discount. Look at this swing low over here. Okay. This is the building blocks of understanding how institutional overflow will incorporate bullish order blocks. When market comes down into a discount and a deep retracement of this impulsive price swing, you're looking at the down candles right at the low. Okay. If you have two of them consecutively, it begins at the top of this candle right here. So draw that out in time. The market goes into that area. This is a buying opportunity. You would go down to a lower time frame. Again, the daily chart is very high. It's a tie time frame. So you're going to be able to break that down into four hours, 60 minute, 15 minute, and five minute. Look for buying opportunities in that that area for discounting. Market immediately aggressively moves away. When we get that, we get another price leg. And we can take our Fibonacci and measure it to come up with another equilibrium. Doesn't come back down to discount or equilibrium in here. So we don't have any trade here. The market rallies again. From that level, we put our low on our Fibonacci. And here's our high here. So we have a high, a lower high, and a down candle. It hits equilibrium. We get a response, rallies up, trades back up to an old low. Rejection. I'm not looking for cell signals. We're not teaching that here. Now we have a higher magnitude price swing. All this impulsive price swing, even though it's broken up into three legs. You still have to measure that because that's the, there's the parent price swing that's currently being traded in right there. Okay, so this movement here, when price gets down the equilibrium, we would study and see if there's a reason to be a buyer. There's an order block over here. So then maybe it's something to look at on the lower timeframe. Maybe there was a loss. Maybe you didn't take a trade. I don't know, but price goes down into a deeper discount. Trades right into. Bullets over block. Now price hits it. Does it spend much time there? No, it rallies aggressively. And it fills in an area where price had already moved in rather quickly. And now this tosses in there for teasing purposes. It goes right up to the bottom of this bullish candle, which is a bearish order block. And that's an area where you would look to take profits on a long position. If you did something like that, buying a savings bottle made here in the middle of this range here. And you got out there. That's 175 tips. Factory and spend about 170 tips. How can anyone be upset with something like that? When you're waiting around, you're not getting a million trades. Okay, there's not a lot of, this is the daily chart. So you're getting about one per week. Really good high odds opportunities. So when you see moves like this, okay, you can see there's a willingness to recapitalize these levels based on the fact that market goes to a discount. We have the same current price swing back here. You always use the same ranges that we're currently in. This range is still in effect. And our comes back down into the seven-time exchange level, which is still a deep discount market. And also it blows out an old low. So there may be some stops down here that the market takes out. Now think, if the market's going to go higher, generally, now think if the market's going to go higher and it's bullish and it comes down below an old low, that's generally going to be a stop loss run. That was the first thing I taught in 2010 to look for dynamic price moves. If you understand what a bullish market is, okay, you want to define every time the market creates a low and then violates that low. If it does that, generally that means that the market makers or the institutional bank and algo will go down below the lows and gather up any orders that will be resting below those orders. Blow that low. This low here, it's violated here, immediately rejects and goes higher. This low here, it goes below here, rejects immediately and goes higher. This low here, it goes down below it, rejects and immediately goes higher. So now think about what I've just given you. I've given you framework to map out what equilibrium is. Okay, what is that? Then I told you what the benefit of knowing what below equilibrium is, it's discount. When you're looking for a market and when you're looking at a range in the marketplace and the market goes below an old low, that gives you context to look for what? Stop rates below the lows and there should be a reaction going higher. If the market's bullish, if the market's underlying tone is bullish and we're going to frame all that stuff, but for now, I want you to study going your charts and you'll see a plethora of these things occurring all the time. And it gives you the building blocks of knowing what trading setups form, how the market should react and you'll start seeing these things before they happen. You want to study them in the past first, but then start looking for them to anticipate future moves based on what I'm teaching in here. So it gets in summary. We understand that equilibrium is the midway point of a range. We need an impulsive price leg higher. Once we identify that individual impulse price swing, we run our Fibonacci from the low up to the high and then we wait for four candles. Once there's fourth candle is lower than the highest one, we start waiting for price to come down into equilibrium. When it does that, we can go in and hunt for buying opportunities on the lower timeframes. We blend in institutional order flow ideas like the order blocks, mitigation blocks, breakers, turtle soups, okay, and optimal trade entries. All those things, either one of them, any one of them can be applied for a buying scenario. But if you ever see the conditions that's bullish and a low is swept out, that's when you anticipate a turtle soup. The question I get all the time is, is how do I know if the market's going to keep going lower or if it's going to just go below and below and then rally up? This is the beginning basis point of knowing when that occurs and when not to expect it to turn around. So we have the market reacting off of this, it rallies up. Now we have another price leg rate in here. It took out an old high, so we can go over here, draw our Fibonacci on that low. Up to this high, price comes down to equilibrium, we start hunting for buying opportunities right in here in a lower time frame. I don't know if there's anything there yet. You'll have to go and look in your chart yourself. But we go down into 62% trace level, which is now discount, okay. So when we identify equilibrium, that's the 50% level. When price goes below 50%, it's at a discount. When is it the highest probable degree of bullishness at a discount price? That's when you have this. To 62% to 79% trace level in that area right there, that's the deep discount that we look for in bullish conditions and why Fibonacci 62% to 79% trace level work. Any other time Fibonacci is going to fail you all the time. It's the foundations behind price action that calls these indicators to work sometimes. Even overbought nervous sold indicators will work if you apply these ideas to them. Bullish divergence, trendfelling, hidden divergence, okay, or type 2 trendfelling, which is really what it is developed and discovered by Nick Van Nijsen, not George Lane, by the way. The the ideas have to come by way of sound price action understanding. If it's not there, based on what foundations of price action are implying, then it's not going to work. It doesn't matter when it's in here, you slap on your chart. You need to have the underpinnings of the market being dictated by price action, not by a mathematically derived or crunching of past price to give you some prognostication. It doesn't work like that. The market will not respond to an indicator. The indicator is only reflecting a mathematical historical reference of something that price is already done. It has no basis on what the market is going to do going forward. When we look at markets, we have the number one define what these price ranges are. That means number one, if we're bullish, all we're doing is waiting around. When we wait around for Michael, we're waiting for a price move. I'm missing all that. Yeah, you probably are. That's patience. Traders that make money, professionally, or manage funds are not chasing everything that goes on in the marketplace. They're no exactly what they're looking for. Once you get a price run like this, it's an impulsive price swing. Then you wait. What are you waiting for? Four candles up here. When the fourth one comes, then you certainly wait for the comeback down the equilibrium. Once it gets the equilibrium, you can look for a signal. But I'm stressing the difference between equilibrium versus discount is you want it to now go below equilibrium into 62% minimum down into 79% tracement. When it does that, that's when you have the highest probable degree of bullishness while in the markets in a discount. Then you should see explosive price acting to the upside. If you're using a daily chart, you'll be able to use this as a day trader, as a short-term trader, a position trader, swing trader. Nothing has been changed in the delivery of what I look for relative to bullish order blocks, turtle soups, all that business. Here's the cool thing. If we understand that we're bullish in the discount zone, like we've had here defined by this Fibonacci level, okay, down in this area here, we're looking for specific things to happen. We're not just looking at why this used to term zone, but not like zone like supply and demand zone in this section, or, well, say here, it's not because it's not really defined in the sense that it's supplying demand zones, but it's a total area of valuation where between equilibrium and less than it's in a discount. If you're going to have this as a range to work with them, what inside of the range are you really specifically looking for? Well, you're looking for specific reference points in terms of institutional order flow. That means a stop run, like we defined here and here where the market went lower than a previous low and here, and then you anticipate what? The market to expand the upside. If we understand that that's the occurrence, it should take place when we're down here and we're looking for buy scenarios. So if it goes below equilibrium and blows out a Fibonacci level and you take a loss, just find the low that it just blew out and then expect the buy signal there. Then you're buying at a really deep discount. Then you're going to get it explosive with the upside. So now if we're using false breaks below previous lows down here, what can you do to get out of a profitable position? The same thing. You look for a high. If you're buying down here after a stop spin run, you take your profit once this market goes above a previous high. Over here, the market makes a lower low. It rallies. Okay. It rallies up. It starts to retrace where you want to get out at when it gets about an old high. Here's an old high. You take your profits right there. But wait a minute, Michael. Wait a minute. It didn't go above this one here. What if I were to help on it that one? Then you would have been greedy. He gave you two chances to do it. The market made a new high here, turn back a little around and then one more time, punch it above it. Get out above an old high. Markets will distribute, or let me say it this way, market makers and smart money will distribute long positions above old highs. It doesn't have to be the oldest high. You think go above this one either. You think go above this one. You don't need it to. Once it creates a high, they only allow price to retrace to allow stops to build up above an old high. That's how the engineer liquidity. So when the engineer liquidity comes in the marketplace in the form of a buy stop, protecting out its short position that somebody out there, you know, foolishly put in here, then the run price above it, hitting those buy stops, those buy stops to come, market orders to buy the market and they sell to those buy stops. They're long positions. They accumulated back here. That's all institutional order flow is. Understanding the storyline between what the highs and the lows are giving you. If you frame the ranges based on your understanding of what the market should be bullish or bearish, and that's easy. Don't worry about that. We'll get to that. But for now, I'm trying to try to institute a foundation for looking at price on a hard timeframe and then managing your expectations based on what you see on this timeframe. And also building the beginning basis to your anticipatory skills for looking for future moves. Wait a minute, Michael. You just form fitted this one. This is probably just only working on this chart here. What happens if you go into what happens if you go into an hourly chart? Suddenly it's all going to be different, right? It's going to be different. It's all going to be different. Well, here we have a price leg here. Okay, impulsive price swing. You map that out. Okay. Swing high, fourth candle doesn't get back down the equilibrium. No problem. We wait for it to do it. It doesn't do it. Makes another leg higher. What happened? We missed it. Don't worry about it. Don't chase it. You know exactly what you're waiting for. Price makes the new higher high. So we have the low to the high. What are we waiting for? Price to get down the equilibrium. Okay, great. But what happens when it gets below that? We're in a discount market. We have to go into what? 62% retracement level minimum right here. It does. Does it stay there long? No way it doesn't stay that long. What happens? The price moves away from it. And then what does it do? Comes back down into equilibrium again and expands again. It consolidates a little bit. Makes a short term high. Where do you take your profits at, Michael? Above an old time short term high. Boom, it rallies above it. Knocks that high out and it even comes back and clears this one out too, just by a little bit. And then look what happened. They retraced all the way back down to equilibrium again. Does it spend time much there? No. rallies back up. Where's it go back to? The bottom of this bullish candle, which is a pair of shoulder block, fills it right to the right to the pip. And I'm going to tell you something. I hate this pair. I literally hate this pair with a passion because it's this sneaky pair like the Japanese yen. And you Swiss folks and Japanese folks, please don't take the offense to that. I'm just, I don't like the currencies put that way. The, the open-air candle is 9768. And the high on this candle comes in at exactly 9768. So you take your profits right there. Not at that high. You exit before you get to that. Remember, we always want to get out before we get to the actual price like now. We have another higher high right here. See that? So we're going to wait for price to get down to equilibrium and less. It does it here. Again, 62% in the rest of 62% retracement level. Should it stay there long? No, does it? No, it doesn't. It rallies away. Retraces back to equilibrium again. And then what do we expect to equilibrium? What did I teach you about the algo? It goes from consolidation, which is always going to be at equilibrium to expansion. What's it expanding to? To liquidity. Where's the liquidity at? Right here before it takes off going vertical, where is the liquidity at? It's above this high and above this high here. What is it? Buy stops. Somebody wants to protect a short position. So if they're going to buy down here as smart money, they're going to sell it to who? Somebody wants to buy a higher price. The buy stops here and the buy stops here. Look what happens. It goes up a little bit, small little retracement and then expands aggressively. What's it going for? The stops right here and then right here. Then once we go above, look what happens. This movement here. What did I teach you? I teach that markets move in intraday price action in grades of 10. There's 10, 10, and 20 pit ranges above a high. That's how far they'll reach for a stop. Boom. There you go. There's your stop on equal highs. Remember, I told you on your charts, mark out areas where there's equal highs. They're too clean. The market's going to want to run there. Anything below 50% is discount, but it can go back to equilibrium and consolidate and then expand. I'm blending two components giving you an introduction to the interbank Alga where you'll know what the price engines were going to do before they do it. They're going to offer the price higher when it's time to do so, but they're going to have to capitalize discounted markets before it goes higher. It won't just go straight up for no reason. It doesn't operate like that. The market has to come back down to a discount and below equilibrium. Then you get explosive moves. Then it may come back to equilibrium to consolidate and wait for an expansion. Then the expansion comes and you look for the look totally above the marketplace. The difference between equilibrium is, yes, it's fair market value at equilibrium. We as traders, we want to trade at discounts. We have to get below equilibrium when it gets into 62% tradesman level or down into 70.5 or even setting up tradesman levels, you really need to be considering being interested in being long on those markets when you're underlying bullishness is there. Waiting for expansion, blending in all the tools that you'll learn. Look at the below here. We're below equilibrium. Here's a low. It comes all the way down. It hits those right there. What would you expect? Even if you didn't see the Fibonacci, what would you expect? Did this as a turtle suit? It's a run on stops and quickly rejects. It comes back down. What if it's going to go lower, Michael? It shouldn't. Why? Because it already took the stops out. It's only retracing a little bit. If you took another Fibonacci and you put it on this range because we're looking at an hourly chart here. This would be a smaller price leg in a lower timeframe. Look at it does. It goes right back down into an optimal trade entry again, below equilibrium, optimal trade entry, and does it spend lots of time down there? No. It rallies up. It hits the 62% of the tradesman level again, and then expands. Boom. Takes off. There's no magic in Fibonacci. None. The only thing it helps you do is visually see what equilibrium is in price. Then below equilibrium, where is a good price to enter at a discount? Here's the benefit. If it goes lower than the optimal trade entry between 62 and 70% of tradesman levels, and your underlying bullishness is there, wait for the turtle suit by. Boom. It's that easy. It's that easy. You don't believe me. I know you don't believe me. That's the beautiful part about this. That's why I want you to go into your charts and look for it. If we have a bullish market, and we know that markets are retracing, you won't need to see the Fibonacci. You can just eyeball it between this low and this high, midway points about right here. This market move below that is below equilibrium. It's at a discount. And guess what? It cleared out stops over here. What's it going to do? Rally. It rallies up. Equal lows in here. Too clean. Market drops down. What's it doing? Coming down to equilibrium, Fibonacci levels. Optimal trade entry. I'm not going to put the Fibonacci on it. You can do it. From this low to this high, goes right down into optimal trade entry. Explodes. Why? Because it cleared out the equal lows down here. Boom. Explodes up to the upside. What about this low over here, Michael? Sure. Come down. It cleans it out. What should it happen? It should expand. It's bullish. We're in a discount market. They're only coming down to take the stops below the marketplace out. These are sell stops. Why would the market makers want to take the market down to take out sell stops? Because it injects people that want to sell to them that want to buy. They get counter parties to their buy orders by having the sell stops tripped below that low. Boom. Explodes. Just low right here. Violated right here. Not by much. It doesn't need to be much. Once it hits that level, the orders go hot. Bang. Explodes up the upside. But it doesn't make a new high, Michael. It doesn't have to. You get exited right here at your old order box. You don't need to have everything out there to come in alignment. The stars don't have to align to get you a profitable trade. You just need a couple things that make sense. They have to start with equilibrium to discount for buys. It has to happen. If you don't get that, you're not going to have these explosive buy signals. It's going to fall on your lap. It's not just knowing. Give me a buy signal, Michael. Tell me when to get in and get out. This is why I told you you have to understand things before just looking for bullish order blocks, before turtle suit longs, before optimal trade entry longs, before stochastic divergence bullishly. None of those things work outside of understanding the central tenant to what a market is at equilibrium or below it at discount. That's a favorable buying market. Anything apart from that, you stay away from it. You wait or look for the opposite side of the market, which is what we'll talk about next week when we look at equilibrium versus premium.",
  "segments": [
    {
      "start_time": 30.0,
      "end_time": 37.0,
      "text": "This is the fourth of eight installments for the first month of the ICT Man's tour ship."
    },
    {
      "start_time": 37.0,
      "end_time": 42.0,
      "text": "We are covering equilibrium versus discount."
    },
    {
      "start_time": 42.0,
      "end_time": 55.0,
      "text": "Now, again, just as a full warning for some of you, we're actually pupils applying prior to me starting this mentorship."
    },
    {
      "start_time": 55.0,
      "end_time": 67.0,
      "text": "This is going to seem a little bit elementary initially, but I promise I'll add something to it that may bring a little bit more depth to the understanding of what optimal trade entry is."
    },
    {
      "start_time": 67.0,
      "end_time": 82.0,
      "text": "Long time ago, back in 2010, I introduced a simple idea of looking at swing projections, retracements, and identifying what would be deemed as optimal trade entry."
    },
    {
      "start_time": 82.0,
      "end_time": 90.0,
      "text": "Everyone that saw it obviously fell in love with it. It was easy for them to see. They would apply it really quick to the chart."
    },
    {
      "start_time": 90.0,
      "end_time": 96.0,
      "text": "I think the reason why is because it had an indicator applied to it and it being the Fibonacci."
    },
    {
      "start_time": 96.0,
      "end_time": 106.0,
      "text": "Now, Fibonacci doesn't have any magic, doesn't have any significance by itself yet to understand where the market may want to reach for."
    },
    {
      "start_time": 106.0,
      "end_time": 113.0,
      "text": "There's going to be a certain measure of provocation on your part. The Fib doesn't do everything for you."
    },
    {
      "start_time": 113.0,
      "end_time": 121.0,
      "text": "I want to draw your attention to looking at where markets are most likely to create by conditions."
    },
    {
      "start_time": 121.0,
      "end_time": 128.0,
      "text": "This is not by signal entries. This is just framing a context initially as a new trader."
    },
    {
      "start_time": 128.0,
      "end_time": 140.0,
      "text": "Someone new to technical analysis, someone new to my principles. It's going to give you a foundation so that we can go into the chart and start looking at these things and measure them and study them."
    },
    {
      "start_time": 140.0,
      "end_time": 154.0,
      "text": "All this is meant is to give you a framework to work within in your demo account. Everyone should be working inside the FORX LTD demo account as I established at the beginning of this mentorship."
    },
    {
      "start_time": 154.0,
      "end_time": 163.0,
      "text": "We have multiple price swings in here on this daily chart. We're looking at primarily a daily chart initially for our setups."
    },
    {
      "start_time": 163.0,
      "end_time": 176.0,
      "text": "If you're a new trader and you just seemed overwhelmed, and you probably heard me talk about certain things already in this mentorship, maybe you've watched some of my videos on YouTube or my website's tutorial section."
    },
    {
      "start_time": 176.0,
      "end_time": 194.0,
      "text": "You heard terms that went right over your head. Some of the terms are created by me. Some of them are industry standards. Some are going to require a little bit more description about what they mean later on in the mentorship."
    },
    {
      "start_time": 194.0,
      "end_time": 204.0,
      "text": "If you hear something even in this presentation, just make a note of it in your notes and then obviously you'll pick up the understanding as you go deeper every month or something new."
    },
    {
      "start_time": 204.0,
      "end_time": 225.0,
      "text": "For now, I want you to focus on a simple question. If a trader believes that the market is going to go higher, what would frame that context? What would give the trader that conclusion to trust buying a specific market?"
    },
    {
      "start_time": 225.0,
      "end_time": 236.0,
      "text": "What goes into making that decision? Well, the first thing I want you to understand is this is going to be like the very first baby step to understanding institutional order flow."
    },
    {
      "start_time": 236.0,
      "end_time": 252.0,
      "text": "The first thing you need is movement. You have to understand that to be a buyer, there has to be a willingness of somebody with bigger, bigger pockets than you, more money than you, and they are the ones that move price around and they are the banks."
    },
    {
      "start_time": 252.0,
      "end_time": 263.0,
      "text": "They are only going to let price go higher when it suits their purpose. It is not going to be a supply demand factor. It is going to be a greed factor. They want money. They are in the business of making money."
    },
    {
      "start_time": 263.0,
      "end_time": 266.0,
      "text": "After all, that is their nature of their business. That is a bank."
    },
    {
      "start_time": 266.0,
      "end_time": 280.0,
      "text": "If we are looking for buying opportunities, many retail traders look for all of these patterns and indicator based ideas. I want you to focus primarily on price."
    },
    {
      "start_time": 280.0,
      "end_time": 292.0,
      "text": "Price alone will give you everything you will ever need in terms of indicating higher or lower price and it will actually give you the actual specific entries and your exits. You don't need anything else outside of a price chart."
    },
    {
      "start_time": 292.0,
      "end_time": 301.0,
      "text": "The open high loan closed does everything for you. I want you to look at this low down here and I want you to look at this high up here."
    },
    {
      "start_time": 301.0,
      "end_time": 307.0,
      "text": "Do you see how that is the biggest price swing on this entire chart?"
    },
    {
      "start_time": 307.0,
      "end_time": 317.0,
      "text": "So between August 14th, all the way to the present time in September, there has only been one major price swing higher and lower."
    },
    {
      "start_time": 317.0,
      "end_time": 324.0,
      "text": "If we take a Fibonacci level, I am only going to use Fibonacci to illustrate equilibrium."
    },
    {
      "start_time": 324.0,
      "end_time": 335.0,
      "text": "This is the largest price range or the market range that is presently being traded in."
    },
    {
      "start_time": 335.0,
      "end_time": 344.0,
      "text": "What do I mean by present market range? This is the highest range we have seen in the last month or so."
    },
    {
      "start_time": 344.0,
      "end_time": 351.0,
      "text": "If we look at this range, there is nothing more significant than that except for this one back here."
    },
    {
      "start_time": 351.0,
      "end_time": 357.0,
      "text": "We are going to primarily use this because it has a very strong reaction. We can use these back here."
    },
    {
      "start_time": 357.0,
      "end_time": 364.0,
      "text": "I will do it for a complete mistake later on in the video. But for now, I want you to see we have a very strong and positive move away."
    },
    {
      "start_time": 364.0,
      "end_time": 370.0,
      "text": "Then it comes back, retraces, then it has another strong and positive move away and comes all up here to the high."
    },
    {
      "start_time": 370.0,
      "end_time": 384.0,
      "text": "When we say impulsive price move or what we have referred to as impulsive price swing going forward throughout this mentorship, that is the indication that there has been displacement."
    },
    {
      "start_time": 384.0,
      "end_time": 392.0,
      "text": "Now displacement is where someone with a lot of money comes in the marketplace and they have a strong conviction to move price higher."
    },
    {
      "start_time": 392.0,
      "end_time": 402.0,
      "text": "We already know that price is going to be set by the central bank. If they are letting price run this high, they are offering at a higher price as long as there is buyers coming in."
    },
    {
      "start_time": 402.0,
      "end_time": 405.0,
      "text": "They are going to keep offering at price there."
    },
    {
      "start_time": 405.0,
      "end_time": 416.0,
      "text": "As long as they keep finding buyers as they keep raising price up, they will keep expanding price higher, higher, higher until there is no longer any interest for them to pair up orders with participants."
    },
    {
      "start_time": 416.0,
      "end_time": 426.0,
      "text": "They will allow price to retreat a little bit until they can get more buy stops above the marketplace."
    },
    {
      "start_time": 426.0,
      "end_time": 434.0,
      "text": "It is not a buyer, buyer, buyer, buyer, buyer market and then keep stretching price."
    },
    {
      "start_time": 434.0,
      "end_time": 442.0,
      "text": "They have already bought down here and then they are allowing price to be offered to the marketplace at higher prices."
    },
    {
      "start_time": 442.0,
      "end_time": 450.0,
      "text": "As that happens, they are selling off their positions at a lower low."
    },
    {
      "start_time": 450.0,
      "end_time": 459.0,
      "text": "From here, the banks are in long positions in here, they are accumulating long positions. Once they are accumulating a position, they allow price to go higher."
    },
    {
      "start_time": 459.0,
      "end_time": 471.0,
      "text": "Once that price goes higher, higher, higher, higher, higher, it keeps going higher until their position is funded and they no longer want any more position held."
    },
    {
      "start_time": 471.0,
      "end_time": 477.0,
      "text": "They are looking for localization areas where they know that they are going to be willing participants to buy."
    },
    {
      "start_time": 477.0,
      "end_time": 482.0,
      "text": "That is going to be above this old high back here. Why would they want to take price above that old high here?"
    },
    {
      "start_time": 482.0,
      "end_time": 491.0,
      "text": "Because there are going to be buy stops on a fund level. That means big money managed funds will have stop loss orders right above that high."
    },
    {
      "start_time": 491.0,
      "end_time": 503.0,
      "text": "I am going to go into details in this mentorship about where stops are, how to pick out institutional funds, levels where their stops are at, where high target big money moves are going to occur."
    },
    {
      "start_time": 503.0,
      "end_time": 515.0,
      "text": "All those things will be taught to you. But for now, I just want to start you very small because there are a lot of folks that just started with this mentorship and they have never really been through the complete library of my concepts."
    },
    {
      "start_time": 515.0,
      "end_time": 527.0,
      "text": "They have really exposed themselves to technical analysis. All this seems Greek to them. I don't mean that offended by that maybe Greek, but it is an expression in the States. It means it is alien to them."
    },
    {
      "start_time": 527.0,
      "end_time": 542.0,
      "text": "The first thing I want you to look for in price is you want to see impulsive price swings. Since we are primarily looking for discount markets and relative terms to equilibrium, we first have to understand what an impulse price swing is."
    },
    {
      "start_time": 542.0,
      "end_time": 549.0,
      "text": "Let me take the fifth off real quick and go back to that price leg right here. Let me take all this off over here."
    },
    {
      "start_time": 549.0,
      "end_time": 556.0,
      "text": "We have one big strong impulsive price swing right here. It comes off this low and rallies up."
    },
    {
      "start_time": 556.0,
      "end_time": 562.0,
      "text": "We don't need to know what calls the buy down here. It is not interesting at all to me. I don't care."
    },
    {
      "start_time": 562.0,
      "end_time": 572.0,
      "text": "We don't know this price link is going to start until I'm sorry. We don't know this price leg is here until it forms."
    },
    {
      "start_time": 572.0,
      "end_time": 584.0,
      "text": "I'm giving you a perspective studying in hindsight the low to this high in here. That rally up or that impulsive price swing."
    },
    {
      "start_time": 584.0,
      "end_time": 592.0,
      "text": "We only require price to start coming down off of that and it takes at least four candles."
    },
    {
      "start_time": 592.0,
      "end_time": 605.0,
      "text": "No matter what time frame you're on, you need four candles. When the market makes a low and starts rallying up, what you're going to look for is once you see a high form, let me zoom in."
    },
    {
      "start_time": 605.0,
      "end_time": 616.0,
      "text": "Once you see a high form, you need four candles, why four candles? You need to have one candle to the left, one candle in the center of the highest one, then a lower candle to the right."
    },
    {
      "start_time": 616.0,
      "end_time": 624.0,
      "text": "That's a swing high and then you got to see price go lower. When that happens, you start waiting for price to retrace back to equilibrium."
    },
    {
      "start_time": 624.0,
      "end_time": 634.0,
      "text": "Now what is equilibrium? Equal equilibrium is a midway point of a price move."
    },
    {
      "start_time": 634.0,
      "end_time": 644.0,
      "text": "We're matching the high from this low. You take your fib, you draw it up to the low and you drop it. Equal equilibrium is over here."
    },
    {
      "start_time": 644.0,
      "end_time": 655.0,
      "text": "Let me scrunch this up a little bit more."
    },
    {
      "start_time": 655.0,
      "end_time": 669.0,
      "text": "We have this price leg up. Impulsive price swing goes higher. As soon as we get three candles, then only then will we start watching for price to come down to the equilibrium price point."
    },
    {
      "start_time": 669.0,
      "end_time": 676.0,
      "text": "That is basically the Fibonacci level 50%. We're looking for price to come down to that level."
    },
    {
      "start_time": 676.0,
      "end_time": 683.0,
      "text": "As soon as it comes back to that level and more on a daily chart, we go down into a lower time frame and we hunt buying opportunities."
    },
    {
      "start_time": 683.0,
      "end_time": 693.0,
      "text": "I'm not teaching you buying entry signals. I'm giving you context of how to discern when the market goes to discount and when it's at a premium."
    },
    {
      "start_time": 693.0,
      "end_time": 701.0,
      "text": "We're not trading at premiums. I'll teach you how to use premiums the first video of next week."
    },
    {
      "start_time": 701.0,
      "end_time": 707.0,
      "text": "We're only focusing primarily on equilibrium versus discount."
    },
    {
      "start_time": 707.0,
      "end_time": 719.0,
      "text": "We have a price swing that moves from a low aggressively up. We don't do anything until we start seeing a down move and it has to happen after three candles basically making a swing high."
    },
    {
      "start_time": 719.0,
      "end_time": 730.0,
      "text": "Swing high looks like this. You can see it has a high and a candle to the left that's lower and a candle to the right that's lower."
    },
    {
      "start_time": 730.0,
      "end_time": 739.0,
      "text": "That's a swing high. Once that swing high forms, we're waiting for the fourth candle to start coming lower."
    },
    {
      "start_time": 739.0,
      "end_time": 749.0,
      "text": "We're looking for four candles to start turning around. When that happens, that gives you now you're allowed to start looking for the market to come down into equilibrium."
    },
    {
      "start_time": 749.0,
      "end_time": 758.0,
      "text": "That means the 50% level. Once you're on a 50% level and you're in a higher time frame and we start everything at a daily chart."
    },
    {
      "start_time": 758.0,
      "end_time": 767.0,
      "text": "At the daily chart, we know now that between the low here and the high here, the market now has gone back to equilibrium."
    },
    {
      "start_time": 767.0,
      "end_time": 779.0,
      "text": "It's at fair value for it fair market value. If you get something in fair market value, obviously you're not paying a premium but you're not really getting a discount either."
    },
    {
      "start_time": 779.0,
      "end_time": 786.0,
      "text": "It's still a neutral to bullish condition. That means you're not buying at an inflated price."
    },
    {
      "start_time": 786.0,
      "end_time": 793.0,
      "text": "This time period right here to market is offering an opportunity to be long."
    },
    {
      "start_time": 793.0,
      "end_time": 806.0,
      "text": "I'm not going down to lower time frames today. I'm not going to teach you that today. The only thing I'm giving you right now is developing context around the daily institutional price levels that are derived at on the daily chart."
    },
    {
      "start_time": 806.0,
      "end_time": 812.0,
      "text": "All you're looking for is impulsive price swings first, letting price settle back down into equilibrium."
    },
    {
      "start_time": 812.0,
      "end_time": 816.0,
      "text": "Then we discern what we're going to do once we get to that level."
    },
    {
      "start_time": 816.0,
      "end_time": 821.0,
      "text": "As you see, without going to lower time frames, the price does rally again. Where does it rally back up to?"
    },
    {
      "start_time": 821.0,
      "end_time": 831.0,
      "text": "It's old institutional order flow reference point, which is an old high back here. It goes right above that previous high. See that?"
    },
    {
      "start_time": 831.0,
      "end_time": 843.0,
      "text": "Now the market trades off again and goes lower. So we have now a new range. We have to now put the Fibonacci on this high keeping it off the same low."
    },
    {
      "start_time": 843.0,
      "end_time": 850.0,
      "text": "Now why did I do that? Because this price low has not been violated. It only retraced down to here and rallyed up again."
    },
    {
      "start_time": 850.0,
      "end_time": 860.0,
      "text": "Then we wait for three candles. The high candle to the left is a lower one to the right is a lower one. This is probably a Sunday and even still this is one here."
    },
    {
      "start_time": 860.0,
      "end_time": 870.0,
      "text": "Either way, you don't want to count Sundays, by the way, empty for one else for XLTD does give you the Sunday candle. So you got to factor that out."
    },
    {
      "start_time": 870.0,
      "end_time": 878.0,
      "text": "Don't don't count Sundays candle because it's a non event. So that's probably going to end up becoming this candle here."
    },
    {
      "start_time": 878.0,
      "end_time": 886.0,
      "text": "Once you get the down candle here that the market has in fact turned it's starting to go lower. Notice what's happening here. We're not rushing."
    },
    {
      "start_time": 886.0,
      "end_time": 900.0,
      "text": "We don't need the catch to high. Okay, it gives us all kinds of time to wait and plan and build an idea about what it is specifically we're going to do when price gets to equilibrium price drops down a little bit more than it goes up."
    },
    {
      "start_time": 900.0,
      "end_time": 909.0,
      "text": "What do we do the whole time this is happening nothing. We're not doing anything. This is a higher time frame principle. Most of you are all begging for a higher time frame principle to trade with."
    },
    {
      "start_time": 909.0,
      "end_time": 918.0,
      "text": "This is the beginning building blocks to that. Okay, market trades lower lower. What do we do here nothing. We're not doing anything here yet. Okay, nothing."
    },
    {
      "start_time": 918.0,
      "end_time": 926.0,
      "text": "Train lower, lower, lower, lower. All of a sudden boom, it hits equilibrium over here. Now we can start studying price."
    },
    {
      "start_time": 926.0,
      "end_time": 935.0,
      "text": "We want to study price when the lower time frames will look for entries, but not teaching you entry signals here. I'm giving you context."
    },
    {
      "start_time": 935.0,
      "end_time": 951.0,
      "text": "As soon as we get to equilibrium, we are now at fair market value. So the market is permitted to be bought. Okay, at the banking level they will be able to buy at these levels because they're not at a premium based market."
    },
    {
      "start_time": 951.0,
      "end_time": 964.0,
      "text": "The levels of trading at this level here are fair market value. Now banks are just like anyone else. If you go to the grocery store and you see stakes for $10 of, I don't even know what they cost because my wife does all shopping."
    },
    {
      "start_time": 964.0,
      "end_time": 978.0,
      "text": "If a stake costs $10 at the market and it drops down to $8.50 a stake that's probably a discount. And it may not be that price. I don't know, but for the sake of analogy, we're using it."
    },
    {
      "start_time": 978.0,
      "end_time": 985.0,
      "text": "That means that we now at a discount anything below equilibrium is now a discount market."
    },
    {
      "start_time": 985.0,
      "end_time": 1000.0,
      "text": "When markets go below equilibrium, they do not spend much time below equilibrium and there's usually a very dynamic price move away from that, especially if the context behind the marketplace is bullish."
    },
    {
      "start_time": 1000.0,
      "end_time": 1009.0,
      "text": "Now looking at this framework we have here, we had an impulsive price swing here, a little tiny little trace and came back to equilibrium."
    },
    {
      "start_time": 1009.0,
      "end_time": 1022.0,
      "text": "One time took out the high over here and then sold off. Okay, went back down into equilibrium again and went to a discount below 50% of the impulse price swing."
    },
    {
      "start_time": 1022.0,
      "end_time": 1031.0,
      "text": "That is now at a discount. So the market on the banking perspective is that this now is now at a discount."
    },
    {
      "start_time": 1031.0,
      "end_time": 1041.0,
      "text": "It is allowed to be bought. Now you just don't go indiscriminately in there trying to buy it just because it goes back to 50% or less. That's not enough. You've got to have more information."
    },
    {
      "start_time": 1041.0,
      "end_time": 1056.0,
      "text": "But for now, I just want to give you when we have a bullish scenario for a marketplace. Okay, if we think it pairs bullish, we look for impulsive price swings on the daily chart, the frame, higher time frame ideas."
    },
    {
      "start_time": 1056.0,
      "end_time": 1073.0,
      "text": "There's other trades that you can take in lower time frames in between these, but for now, I want you primarily focused on just this because it'll give you all the things that you've probably been lacking with higher time frame ideas and the beginning box of directional bias."
    },
    {
      "start_time": 1073.0,
      "end_time": 1087.0,
      "text": "Because it's daily, it gives you a lot of time too. You don't have to be sitting in front of an intraday chart. You don't have to worry about the balls catching you doing something and stealing time at the job. This gives you a lot of flexibility and time to prepare for an idea of the trade on."
    },
    {
      "start_time": 1087.0,
      "end_time": 1099.0,
      "text": "So when we get the equilibrium, we know that we are at fair market value. It's a market that can be bought if we are bullish, but we can't buy it. We can't buy above this level up to here."
    },
    {
      "start_time": 1099.0,
      "end_time": 1112.0,
      "text": "Okay, that's the plan what I'm saying. The best buys come at equilibrium or less anything below equilibrium or 50% level is viewed as a discount."
    },
    {
      "start_time": 1112.0,
      "end_time": 1126.0,
      "text": "Now, the wonderful thing about understanding this is when a market is at discount and it's underlying basis is bullish, discount prices don't stay in the market very long."
    },
    {
      "start_time": 1126.0,
      "end_time": 1135.0,
      "text": "The market is going to want to run away from that really quick because this is a daily chart. This isn't that bad in terms of how much time it spent down here below equilibrium."
    },
    {
      "start_time": 1135.0,
      "end_time": 1152.0,
      "text": "When you can see finally it explosively moved away from that and rally up through what I asked you guys to do in the third tutorial, which was to win your charts and mark out areas of where equal highs would be and where old highs would be."
    },
    {
      "start_time": 1152.0,
      "end_time": 1166.0,
      "text": "The market rallies from that price point and goes right back up and clear that these equal highs. When these equal highs are taken out if you were a trader that only took along in this area and it don't have to be exact science as far as where it was."
    },
    {
      "start_time": 1166.0,
      "end_time": 1173.0,
      "text": "We're just going to speak in general terms if you went along somewhere in this small little consolidation before the expansion."
    },
    {
      "start_time": 1173.0,
      "end_time": 1187.0,
      "text": "Okay, between buying the 95 big figure roughly up to these equal highs that's about 98 50."
    },
    {
      "start_time": 1187.0,
      "end_time": 1203.0,
      "text": "You have about 98 50 and you bought around 95 50 sets 300 pips move on a signal that would have formed it took a little bit of while to come the fruition, but based on equilibrium and discounting."
    },
    {
      "start_time": 1203.0,
      "end_time": 1220.0,
      "text": "Okay, you can frame the ideas in which the market should react. It should be viewed as a discount across the board and if it is in fact bullish, the banks will dog pile on this and send the price higher and it should be with quick dynamic price action."
    },
    {
      "start_time": 1220.0,
      "end_time": 1230.0,
      "text": "Understanding where it should be reaching for above old highs above equal highs above close in a range."
    },
    {
      "start_time": 1230.0,
      "end_time": 1237.0,
      "text": "Okay, which we don't really have in here, but I'm just showing you just one example here already the first one it's 300 pips."
    },
    {
      "start_time": 1237.0,
      "end_time": 1248.0,
      "text": "Okay, then we have another price move all up here this there's no real retracement in here because lots we have a high equal a little bit lower here and then here's one here."
    },
    {
      "start_time": 1248.0,
      "end_time": 1268.0,
      "text": "If we were to measure the low to this high, it doesn't come down the 50% is nowhere near I can eyeball that you can probably do that too, but I probably might let's just do it because some probably going to have some of you folks that are from different countries have a hard time understanding my English low loan 4x."
    },
    {
      "start_time": 1268.0,
      "end_time": 1279.0,
      "text": "If we would have measured just this impulsive price swing right here notice that even though we had the candle here lower on the fourth one it had up close but it was still lower."
    },
    {
      "start_time": 1279.0,
      "end_time": 1287.0,
      "text": "Nothing came back down the equilibrium it stayed at a high price and it's kept going higher and higher and higher and higher and higher."
    },
    {
      "start_time": 1287.0,
      "end_time": 1299.0,
      "text": "So if we go back to adding the feed to that initial price low here and we stretch it because now we broke we broke this high."
    },
    {
      "start_time": 1299.0,
      "end_time": 1306.0,
      "text": "We're going to keep drawing the fifth up on swings that move up dynamically so we have this big parent price swing."
    },
    {
      "start_time": 1306.0,
      "end_time": 1314.0,
      "text": "So now we're going to wait until price gets back down the equilibrium when do we start waiting for that when the market show is a swing high which it does here."
    },
    {
      "start_time": 1314.0,
      "end_time": 1325.0,
      "text": "Then we start counting to the fourth candle where it drops to the fourth candle has to move lower or be lower than the highest candle that makes a swing high."
    },
    {
      "start_time": 1325.0,
      "end_time": 1334.0,
      "text": "It's all it's a very simple thing and then from there we just start waiting and count down every time it goes down to a new low low low low low low and finally what's it hit right here."
    },
    {
      "start_time": 1335.0,
      "end_time": 1348.0,
      "text": "Equilibrium at that 50% mark as soon as it does that the market is at a fair market value so that it can be bought on the banking level it cannot be bought until it gets to that level or below."
    },
    {
      "start_time": 1348.0,
      "end_time": 1361.0,
      "text": "They won't come in they won't do it it's not based on Sibonacci I'm just showing you in terms of equilibrium between old highs and old lows it's just evaluation marker that's all it is."
    },
    {
      "start_time": 1361.0,
      "end_time": 1379.0,
      "text": "Okay so the algo will kick into a buy mode in here especially if they have orders at that level or just a little bit below it and if they are there you'll know it because the price will react immediate like it does here it hits it one time it doesn't have another camera touch it this one gets close to it but it's still rallies away."
    },
    {
      "start_time": 1379.0,
      "end_time": 1401.0,
      "text": "Okay so now watch what happens we have another impulse swing here price moves away from an area where we expect it to rally why do we expect it to rally there because between this low and this high price should be sensitive here on the upside and it rallies now watch what happens this is a big big step I'm going to keep this Fibonacci just like it is I'm going to add another one."
    },
    {
      "start_time": 1401.0,
      "end_time": 1430.0,
      "text": "Right on the low that starts here and it runs up here see that so between this low up to this high why we count in this swing why are we using this Fibonacci price swing Michael and not something else because this one showed reaction to want to move away from an area we would expect it to move and now watch we have a swing high here's a high lower high lower high and this candle is lower than the one on the highest portion of the swing high so now we start counting down until we get the swing high."
    },
    {
      "start_time": 1430.0,
      "end_time": 1459.0,
      "text": "So we start counting down until price gets to what equal liberal or less the next candle doesn't do it this candle does it goes right down through equilibrium down into what we call optimal trade entry so when we get below equilibrium all this timing here look how much time it gives you opportunities to get in at 62 to 70 and a half percent which is optimal trade entry sweet spot if you look at that price gathers up more orders and we're going to get a little bit more of a swing high."
    },
    {
      "start_time": 1460.0,
      "end_time": 1467.0,
      "text": "Rally's away aggressively much it happens again now we have another reference point."
    },
    {
      "start_time": 1467.0,
      "end_time": 1488.0,
      "text": "This is where we expect it price to react and it did it gets us another price leg before all up here from this low to this high we get high a low a lower low on this one and we're already below equilibrium look at the eyes of the candle we wick through it."
    },
    {
      "start_time": 1488.0,
      "end_time": 1490.8,
      "text": "I'm not going to talk about order blocks here as much as I want to right now."
    },
    {
      "start_time": 1491.84,
      "end_time": 1495.6,
      "text": "It's for some of you guys that do know and a block you'd probably know what I'm talking about before I would say it."
    },
    {
      "start_time": 1496.24,
      "end_time": 1498.72,
      "text": "But in here we expect price to be sensitive in here."
    },
    {
      "start_time": 1499.36,
      "end_time": 1505.12,
      "text": "Okay, because we're below 50% or equilibrium, we're at a discount price should not spend much time there at all."
    },
    {
      "start_time": 1505.12,
      "end_time": 1506.56,
      "text": "It quickly rallies away."
    },
    {
      "start_time": 1507.36,
      "end_time": 1508.88,
      "text": "Okay, and it comes back down."
    },
    {
      "start_time": 1510.64,
      "end_time": 1513.12,
      "text": "I could draw a fib on this low to this high."
    },
    {
      "start_time": 1513.12,
      "end_time": 1514.08,
      "text": "I mean, just do it."
    },
    {
      "start_time": 1515.04,
      "end_time": 1517.68,
      "text": "After all that's the context of what we're teaching here today, right?"
    },
    {
      "start_time": 1518.88,
      "end_time": 1522.32,
      "text": "Coal in a fib on all these levels where there should be reaction."
    },
    {
      "start_time": 1526.0,
      "end_time": 1527.84,
      "text": "Okay, market rallies up."
    },
    {
      "start_time": 1528.8,
      "end_time": 1530.16,
      "text": "Here's the swing high."
    },
    {
      "start_time": 1530.16,
      "end_time": 1532.16,
      "text": "The next candle, the fourth candle's got to be lower."
    },
    {
      "start_time": 1532.16,
      "end_time": 1532.96,
      "text": "It does."
    },
    {
      "start_time": 1532.96,
      "end_time": 1535.68,
      "text": "It trades through equilibrium right into optimal trade entry."
    },
    {
      "start_time": 1535.68,
      "end_time": 1536.88,
      "text": "Does it stay there along?"
    },
    {
      "start_time": 1536.88,
      "end_time": 1538.48,
      "text": "No, it rallies up."
    },
    {
      "start_time": 1538.48,
      "end_time": 1539.04,
      "text": "Comes back."
    },
    {
      "start_time": 1539.04,
      "end_time": 1540.24,
      "text": "It doesn't break the high."
    },
    {
      "start_time": 1540.24,
      "end_time": 1543.76,
      "text": "Comes back one more time to equilibrium and then the aggressive moves away."
    },
    {
      "start_time": 1544.8,
      "end_time": 1547.12,
      "text": "Expans, expands, expands, expands, expands, expands, expands."
    },
    {
      "start_time": 1547.12,
      "end_time": 1549.36,
      "text": "And then finally, it gets us a reversal."
    },
    {
      "start_time": 1549.36,
      "end_time": 1554.96,
      "text": "But nonetheless, that right there from buying in here to here, let's look at that in terms of range."
    },
    {
      "start_time": 1561.6,
      "end_time": 1562.56,
      "text": "300 pips again."
    },
    {
      "start_time": 1564.32,
      "end_time": 1570.48,
      "text": "Okay, it's not every day setups."
    },
    {
      "start_time": 1570.48,
      "end_time": 1572.72,
      "text": "Okay, but it's giving you significant setups."
    },
    {
      "start_time": 1572.72,
      "end_time": 1575.92,
      "text": "If we look at the moves that we called in here using what I'm showing you,"
    },
    {
      "start_time": 1583.2,
      "end_time": 1584.4,
      "text": "if you bought down in here,"
    },
    {
      "start_time": 1586.16,
      "end_time": 1588.0,
      "text": "just to this level here's 140 pips."
    },
    {
      "start_time": 1589.44,
      "end_time": 1592.16,
      "text": "To here, it's 272 pips."
    },
    {
      "start_time": 1592.16,
      "end_time": 1595.2,
      "text": "If you held onto it, it's 400 pips."
    },
    {
      "start_time": 1599.52,
      "end_time": 1600.64,
      "text": "This price move in here."
    },
    {
      "start_time": 1602.72,
      "end_time": 1604.08,
      "text": "Price should be sensitive right here."
    },
    {
      "start_time": 1604.8,
      "end_time": 1605.52,
      "text": "I thought it in here."
    },
    {
      "start_time": 1605.52,
      "end_time": 1606.4,
      "text": "Order blocks right here."
    },
    {
      "start_time": 1606.4,
      "end_time": 1607.52,
      "text": "You'll learn about those."
    },
    {
      "start_time": 1607.52,
      "end_time": 1610.56,
      "text": "But the Fibonacci we just showed you, it's still there."
    },
    {
      "start_time": 1610.56,
      "end_time": 1611.36,
      "text": "And watch this."
    },
    {
      "start_time": 1612.88,
      "end_time": 1617.52,
      "text": "We had a price swing here that reacted off of the level that should be bullish."
    },
    {
      "start_time": 1617.52,
      "end_time": 1618.8,
      "text": "Here's our new price leg here."
    },
    {
      "start_time": 1619.6,
      "end_time": 1621.36,
      "text": "We have a high and a higher high."
    },
    {
      "start_time": 1621.36,
      "end_time": 1625.52,
      "text": "So we have a higher magnitude price swing that's going higher."
    },
    {
      "start_time": 1626.72,
      "end_time": 1628.4,
      "text": "We wait for the swing high to form."
    },
    {
      "start_time": 1628.4,
      "end_time": 1629.52,
      "text": "Down candles right here."
    },
    {
      "start_time": 1629.52,
      "end_time": 1630.96,
      "text": "Equalibrians right here."
    },
    {
      "start_time": 1631.68,
      "end_time": 1633.76,
      "text": "The optimal trade entry, which is discount."
    },
    {
      "start_time": 1633.76,
      "end_time": 1635.76,
      "text": "It's got to be below equilibrium."
    },
    {
      "start_time": 1636.4,
      "end_time": 1644.88,
      "text": "If the market is below equilibrium, we are in a discount market and it should not go below the"
    },
    {
      "start_time": 1644.88,
      "end_time": 1645.84,
      "text": "old, low it forms."
    },
    {
      "start_time": 1646.96,
      "end_time": 1649.68,
      "text": "In other words, wherever the impulse price swing is,"
    },
    {
      "start_time": 1651.28,
      "end_time": 1652.48,
      "text": "that low it starts from."
    },
    {
      "start_time": 1653.04,
      "end_time": 1654.16,
      "text": "It can't go below that."
    },
    {
      "start_time": 1654.72,
      "end_time": 1656.24,
      "text": "So think about what it's already giving you."
    },
    {
      "start_time": 1656.24,
      "end_time": 1658.08,
      "text": "It's giving you a framework to work within."
    },
    {
      "start_time": 1658.56,
      "end_time": 1660.88,
      "text": "Okay, I don't need to know exactly where I'm buying it."
    },
    {
      "start_time": 1660.88,
      "end_time": 1662.48,
      "text": "I just know a general area."
    },
    {
      "start_time": 1662.48,
      "end_time": 1666.16,
      "text": "I can fine tune that down into lower timeframes when we do top down analysis."
    },
    {
      "start_time": 1666.16,
      "end_time": 1666.8,
      "text": "I'll teach that."
    },
    {
      "start_time": 1668.0,
      "end_time": 1671.28,
      "text": "But for now, if we understand this is the low we draw our Fibonacci from,"
    },
    {
      "start_time": 1672.0,
      "end_time": 1675.44,
      "text": "a stop loss has to be below there when this time frame."
    },
    {
      "start_time": 1676.08,
      "end_time": 1679.28,
      "text": "So we can buy in this area here, put a stop loss down here,"
    },
    {
      "start_time": 1679.28,
      "end_time": 1683.76,
      "text": "define the risk between that and in how much of a risk through war will we get"
    },
    {
      "start_time": 1683.76,
      "end_time": 1685.2,
      "text": "based on how far it should reach up."
    },
    {
      "start_time": 1688.16,
      "end_time": 1693.76,
      "text": "Every time, every time that price makes an impulse price swing higher,"
    },
    {
      "start_time": 1694.4,
      "end_time": 1697.44,
      "text": "we just wait for it to come back down and there's no rush."
    },
    {
      "start_time": 1697.44,
      "end_time": 1698.48,
      "text": "We just wait."
    },
    {
      "start_time": 1698.48,
      "end_time": 1700.72,
      "text": "It takes three candles on the third candle."
    },
    {
      "start_time": 1700.72,
      "end_time": 1702.56,
      "text": "It can hit equilibrium go below it,"
    },
    {
      "start_time": 1703.12,
      "end_time": 1706.72,
      "text": "but we need to just simply wait for the swing high to form and then you watch it drop down."
    },
    {
      "start_time": 1707.28,
      "end_time": 1708.4,
      "text": "Want to drop down?"
    },
    {
      "start_time": 1708.4,
      "end_time": 1709.6,
      "text": "You know what you're going to be expecting."
    },
    {
      "start_time": 1710.48,
      "end_time": 1715.52,
      "text": "The price move should be explosive to the upside because the market goes back to a discount"
    },
    {
      "start_time": 1715.68,
      "end_time": 1716.88,
      "text": "below equilibrium."
    },
    {
      "start_time": 1716.88,
      "end_time": 1719.12,
      "text": "It can be a sensitive at equilibrium,"
    },
    {
      "start_time": 1719.12,
      "end_time": 1721.68,
      "text": "but here's what we're supposed to be focusing primarily on."
    },
    {
      "start_time": 1721.68,
      "end_time": 1723.12,
      "text": "You want high odds trades."
    },
    {
      "start_time": 1723.12,
      "end_time": 1726.88,
      "text": "You want high probability explosive price action moves in your favor."
    },
    {
      "start_time": 1726.88,
      "end_time": 1731.76,
      "text": "That happens when it goes below equilibrium because the market will go to a very,"
    },
    {
      "start_time": 1731.76,
      "end_time": 1733.28,
      "text": "very suppressed levels."
    },
    {
      "start_time": 1733.28,
      "end_time": 1736.64,
      "text": "And when they go below equilibrium to a discount level,"
    },
    {
      "start_time": 1736.64,
      "end_time": 1741.28,
      "text": "the markets will not sustain discount prices very long."
    },
    {
      "start_time": 1741.28,
      "end_time": 1743.92,
      "text": "If the underlying pinnings of the marketplace is bullish."
    },
    {
      "start_time": 1743.92,
      "end_time": 1744.88,
      "text": "So it gives you two things."
    },
    {
      "start_time": 1744.88,
      "end_time": 1746.88,
      "text": "It gives you a context to work with them when you"
    },
    {
      "start_time": 1746.88,
      "end_time": 1753.04,
      "text": "provides and it gives you also a relative strength study that's built in."
    },
    {
      "start_time": 1753.04,
      "end_time": 1754.48,
      "text": "It should be sensitive."
    },
    {
      "start_time": 1754.48,
      "end_time": 1759.04,
      "text": "It should be dynamic price action moves away from that equilibrium or less."
    },
    {
      "start_time": 1759.04,
      "end_time": 1761.84,
      "text": "More specifically, below equilibrium."
    },
    {
      "start_time": 1761.84,
      "end_time": 1766.0,
      "text": "So that's where the optimal trade entry idea came from when I was using the 62%"
    },
    {
      "start_time": 1766.0,
      "end_time": 1768.32,
      "text": "to 7% tradesmen levels that you've been using."
    },
    {
      "start_time": 1768.32,
      "end_time": 1772.24,
      "text": "I was using the 62% to 7% tradesmen levels that you see on my Fibonacci's."
    },
    {
      "start_time": 1775.44,
      "end_time": 1780.72,
      "text": "Well, it's this area 62, 70.5 and 79%."
    },
    {
      "start_time": 1780.72,
      "end_time": 1784.24,
      "text": "OK, and those levels are very, very sensitive,"
    },
    {
      "start_time": 1784.24,
      "end_time": 1786.32,
      "text": "not because of Fibonacci's sake,"
    },
    {
      "start_time": 1786.32,
      "end_time": 1790.72,
      "text": "but because it's really just measuring how far the current price range has been."
    },
    {
      "start_time": 1791.44,
      "end_time": 1794.56,
      "text": "The Alga had a low down here and it had a high here."
    },
    {
      "start_time": 1794.56,
      "end_time": 1796.88,
      "text": "This is the total range that we're trading inside of."
    },
    {
      "start_time": 1796.88,
      "end_time": 1800.08,
      "text": "Right now, OK, right now, this is,"
    },
    {
      "start_time": 1802.16,
      "end_time": 1804.0,
      "text": "this is right now current as of today."
    },
    {
      "start_time": 1804.96,
      "end_time": 1807.04,
      "text": "Friday's close of September 16th."
    },
    {
      "start_time": 1808.4,
      "end_time": 1813.44,
      "text": "So right now, we are in the range that's been defined by the high and the low here."
    },
    {
      "start_time": 1814.24,
      "end_time": 1817.68,
      "text": "So that level of equilibrium still exists, which is here."
    },
    {
      "start_time": 1818.56,
      "end_time": 1823.52,
      "text": "So any by condition that occurs below this level here is high probability."
    },
    {
      "start_time": 1824.16,
      "end_time": 1825.36,
      "text": "What does that mean?"
    },
    {
      "start_time": 1825.36,
      "end_time": 1827.92,
      "text": "That means you just measure every single impulsive price"
    },
    {
      "start_time": 1827.92,
      "end_time": 1830.4,
      "text": "lag higher when it moves up."
    },
    {
      "start_time": 1832.56,
      "end_time": 1833.52,
      "text": "Actually, let's do this."
    },
    {
      "start_time": 1833.52,
      "end_time": 1834.72,
      "text": "Let's shade this area."
    },
    {
      "start_time": 1837.12,
      "end_time": 1843.92,
      "text": "And that way, we'll understand that anything below anything below here,"
    },
    {
      "start_time": 1845.76,
      "end_time": 1850.56,
      "text": "that's in a high probability or discount market."
    },
    {
      "start_time": 1851.28,
      "end_time": 1853.92,
      "text": "OK, so now when we when we understand that,"
    },
    {
      "start_time": 1854.72,
      "end_time": 1858.16,
      "text": "we can define every single price lag that moves up,"
    },
    {
      "start_time": 1858.16,
      "end_time": 1859.52,
      "text": "which is an impulsive price swing."
    },
    {
      "start_time": 1860.16,
      "end_time": 1861.2,
      "text": "When it moves higher,"
    },
    {
      "start_time": 1864.96,
      "end_time": 1869.68,
      "text": "all we have to do is measure the new equilibrium point that which it's created."
    },
    {
      "start_time": 1870.88,
      "end_time": 1872.4,
      "text": "And here, I'm going to start right here."
    },
    {
      "start_time": 1874.72,
      "end_time": 1876.8,
      "text": "There's an impulse price lag right there."
    },
    {
      "start_time": 1877.76,
      "end_time": 1880.72,
      "text": "So we have the low up to the high swing high."
    },
    {
      "start_time": 1881.52,
      "end_time": 1882.56,
      "text": "Fourth canals gotta be down."
    },
    {
      "start_time": 1882.56,
      "end_time": 1884.08,
      "text": "It does hit equilibrium."
    },
    {
      "start_time": 1884.08,
      "end_time": 1885.04,
      "text": "Should it respond?"
    },
    {
      "start_time": 1885.04,
      "end_time": 1886.24,
      "text": "Yes, it should be dynamic."
    },
    {
      "start_time": 1886.24,
      "end_time": 1886.96,
      "text": "Does it go higher?"
    },
    {
      "start_time": 1886.96,
      "end_time": 1887.6,
      "text": "Yes, it does."
    },
    {
      "start_time": 1888.96,
      "end_time": 1889.76,
      "text": "Makes a new high."
    },
    {
      "start_time": 1890.56,
      "end_time": 1891.6,
      "text": "Where's it go to, Michael?"
    },
    {
      "start_time": 1892.48,
      "end_time": 1894.56,
      "text": "Above a previous high over here."
    },
    {
      "start_time": 1894.56,
      "end_time": 1895.92,
      "text": "And then it trades back down."
    },
    {
      "start_time": 1896.48,
      "end_time": 1897.6,
      "text": "Now, here we have equilibrium."
    },
    {
      "start_time": 1897.6,
      "end_time": 1900.16,
      "text": "It trades the equilibrium and then aggressively trades through it."
    },
    {
      "start_time": 1900.16,
      "end_time": 1901.68,
      "text": "You're probably thinking, oh, it's failed."
    },
    {
      "start_time": 1901.68,
      "end_time": 1902.56,
      "text": "It does."
    },
    {
      "start_time": 1902.56,
      "end_time": 1904.24,
      "text": "That's what's going to happen sometimes."
    },
    {
      "start_time": 1904.24,
      "end_time": 1905.6,
      "text": "You're going to lose money."
    },
    {
      "start_time": 1905.6,
      "end_time": 1908.64,
      "text": "I want you to understand that it's not going to be perfect,"
    },
    {
      "start_time": 1908.64,
      "end_time": 1911.28,
      "text": "but it's going to give you more context than you have right now,"
    },
    {
      "start_time": 1911.28,
      "end_time": 1912.32,
      "text": "especially if you're new."
    },
    {
      "start_time": 1912.32,
      "end_time": 1914.64,
      "text": "If you have been looking at price action before,"
    },
    {
      "start_time": 1914.64,
      "end_time": 1918.72,
      "text": "you probably have never looked at it like this in terms of valuation between equilibrium and discount."
    },
    {
      "start_time": 1919.2,
      "end_time": 1923.28,
      "text": "And we're going to teach the importance of that the rest of this month"
    },
    {
      "start_time": 1923.28,
      "end_time": 1924.48,
      "text": "in the remaining teachings."
    },
    {
      "start_time": 1924.48,
      "end_time": 1928.88,
      "text": "But for now, I'm going to introduce you the idea of viewing price in this context."
    },
    {
      "start_time": 1930.64,
      "end_time": 1932.8,
      "text": "Below equilibrium here, no discount."
    },
    {
      "start_time": 1932.8,
      "end_time": 1934.88,
      "text": "We come all the way back down and take out a stop."
    },
    {
      "start_time": 1934.88,
      "end_time": 1937.44,
      "text": "Stop runs is what's going to be a different profile."
    },
    {
      "start_time": 1937.44,
      "end_time": 1940.32,
      "text": "And if you take a loss, that's what you expect."
    },
    {
      "start_time": 1940.32,
      "end_time": 1944.64,
      "text": "You expect this occurrence to happen where the market takes the low out."
    },
    {
      "start_time": 1944.64,
      "end_time": 1947.36,
      "text": "Well, if it does take that low out, what is it probably really doing?"
    },
    {
      "start_time": 1947.36,
      "end_time": 1950.32,
      "text": "It's taking stops out so that it should be a turtle soup."
    },
    {
      "start_time": 1950.32,
      "end_time": 1952.24,
      "text": "Turtle soups a false breakout pattern."
    },
    {
      "start_time": 1952.24,
      "end_time": 1953.76,
      "text": "It went below that low."
    },
    {
      "start_time": 1953.76,
      "end_time": 1957.44,
      "text": "We should see a responsiveness that's aggressive that moves higher."
    },
    {
      "start_time": 1957.44,
      "end_time": 1958.64,
      "text": "We see that here."
    },
    {
      "start_time": 1959.68,
      "end_time": 1961.92,
      "text": "Market trades up makes an impulsive price leg."
    },
    {
      "start_time": 1964.96,
      "end_time": 1972.08,
      "text": "From that low, all the way up to here."
    },
    {
      "start_time": 1972.8,
      "end_time": 1974.64,
      "text": "Now watch, here's the cool part about this."
    },
    {
      "start_time": 1974.64,
      "end_time": 1975.52,
      "text": "We have a swing high."
    },
    {
      "start_time": 1975.52,
      "end_time": 1977.68,
      "text": "You have the high, the lower high, the lower high."
    },
    {
      "start_time": 1977.68,
      "end_time": 1979.44,
      "text": "And the fourth candle is damn."
    },
    {
      "start_time": 1979.44,
      "end_time": 1981.2,
      "text": "Does it ever get down to equilibrium?"
    },
    {
      "start_time": 1981.2,
      "end_time": 1982.56,
      "text": "No. So we have no trade."
    },
    {
      "start_time": 1982.56,
      "end_time": 1984.16,
      "text": "We don't catch anything that keeps going up."
    },
    {
      "start_time": 1984.16,
      "end_time": 1984.64,
      "text": "No problem."
    },
    {
      "start_time": 1984.64,
      "end_time": 1985.44,
      "text": "I'm worried about you."
    },
    {
      "start_time": 1985.44,
      "end_time": 1986.08,
      "text": "I'm worried about it."
    },
    {
      "start_time": 1986.88,
      "end_time": 1988.08,
      "text": "Next price leg."
    },
    {
      "start_time": 1988.08,
      "end_time": 1988.72,
      "text": "We look for."
    },
    {
      "start_time": 1990.8,
      "end_time": 1992.48,
      "text": "Okay, we have this price leg here."
    },
    {
      "start_time": 1993.04,
      "end_time": 1996.64,
      "text": "We're only focusing on inside the yellow area."
    },
    {
      "start_time": 1996.64,
      "end_time": 2000.16,
      "text": "That's the shaded discount portion of this market."
    },
    {
      "start_time": 2000.16,
      "end_time": 2001.52,
      "text": "The dollar is swissy."
    },
    {
      "start_time": 2002.16,
      "end_time": 2004.56,
      "text": "This current market is at discount below."
    },
    {
      "start_time": 2008.96,
      "end_time": 2013.28,
      "text": "Below this line here, this is equilibrium."
    },
    {
      "start_time": 2013.28,
      "end_time": 2015.28,
      "text": "The top of the yellow shaded area."
    },
    {
      "start_time": 2015.28,
      "end_time": 2016.64,
      "text": "And below is discount."
    },
    {
      "start_time": 2017.44,
      "end_time": 2022.16,
      "text": "So the market should be responsive at levels of discount."
    },
    {
      "start_time": 2023.44,
      "end_time": 2027.28,
      "text": "After we see this high form, we look for the high,"
    },
    {
      "start_time": 2027.28,
      "end_time": 2029.36,
      "text": "the swing high form, and the fourth candle's got to show"
    },
    {
      "start_time": 2029.36,
      "end_time": 2030.4,
      "text": "willingness to be lower."
    },
    {
      "start_time": 2030.4,
      "end_time": 2030.8,
      "text": "It does."
    },
    {
      "start_time": 2030.8,
      "end_time": 2032.0,
      "text": "And then we simply just wait."
    },
    {
      "start_time": 2032.0,
      "end_time": 2034.0,
      "text": "Wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait,"
    },
    {
      "start_time": 2034.0,
      "end_time": 2035.2,
      "text": "until it hits the equilibrium."
    },
    {
      "start_time": 2035.2,
      "end_time": 2036.8,
      "text": "And then we go down to lower time frames."
    },
    {
      "start_time": 2036.8,
      "end_time": 2038.8,
      "text": "And we look for trading signals."
    },
    {
      "start_time": 2038.8,
      "end_time": 2042.8,
      "text": "There may or may not been, they may or may not have, rather,"
    },
    {
      "start_time": 2042.8,
      "end_time": 2043.84,
      "text": "then one here."
    },
    {
      "start_time": 2043.84,
      "end_time": 2044.64,
      "text": "Okay."
    },
    {
      "start_time": 2044.64,
      "end_time": 2048.0,
      "text": "I'm going to say, maybe you took one there and maybe it took,"
    },
    {
      "start_time": 2048.0,
      "end_time": 2048.48,
      "text": "and you took a loss."
    },
    {
      "start_time": 2048.48,
      "end_time": 2049.12,
      "text": "Great."
    },
    {
      "start_time": 2049.12,
      "end_time": 2049.6,
      "text": "No problem."
    },
    {
      "start_time": 2049.6,
      "end_time": 2050.48,
      "text": "You took a loss."
    },
    {
      "start_time": 2050.88,
      "end_time": 2051.2,
      "text": "Great."
    },
    {
      "start_time": 2051.2,
      "end_time": 2052.0,
      "text": "No problem."
    },
    {
      "start_time": 2052.0,
      "end_time": 2052.88,
      "text": "You took a loss."
    },
    {
      "start_time": 2052.88,
      "end_time": 2054.72,
      "text": "Here's a here's a losing trade here."
    },
    {
      "start_time": 2054.72,
      "end_time": 2056.0,
      "text": "And here's a losing trade here."
    },
    {
      "start_time": 2056.0,
      "end_time": 2056.64,
      "text": "No problem."
    },
    {
      "start_time": 2057.76,
      "end_time": 2058.8,
      "text": "We had a winner here."
    },
    {
      "start_time": 2060.16,
      "end_time": 2062.88,
      "text": "Market's going down into a deeper discount."
    },
    {
      "start_time": 2063.52,
      "end_time": 2065.2,
      "text": "Look at this swing low over here."
    },
    {
      "start_time": 2065.2,
      "end_time": 2065.6,
      "text": "Okay."
    },
    {
      "start_time": 2065.6,
      "end_time": 2067.92,
      "text": "This is the building blocks of understanding how institutional"
    },
    {
      "start_time": 2067.92,
      "end_time": 2070.88,
      "text": "overflow will incorporate bullish order blocks."
    },
    {
      "start_time": 2071.52,
      "end_time": 2074.64,
      "text": "When market comes down into a discount and a deep retracement"
    },
    {
      "start_time": 2074.64,
      "end_time": 2076.08,
      "text": "of this impulsive price swing,"
    },
    {
      "start_time": 2076.72,
      "end_time": 2078.88,
      "text": "you're looking at the down candles"
    },
    {
      "start_time": 2078.96,
      "end_time": 2079.84,
      "text": "right at the low."
    },
    {
      "start_time": 2080.64,
      "end_time": 2080.88,
      "text": "Okay."
    },
    {
      "start_time": 2080.88,
      "end_time": 2082.72,
      "text": "If you have two of them consecutively,"
    },
    {
      "start_time": 2082.72,
      "end_time": 2085.52,
      "text": "it begins at the top of this candle right here."
    },
    {
      "start_time": 2086.16,
      "end_time": 2087.68,
      "text": "So draw that out in time."
    },
    {
      "start_time": 2088.16,
      "end_time": 2089.84,
      "text": "The market goes into that area."
    },
    {
      "start_time": 2089.84,
      "end_time": 2091.2,
      "text": "This is a buying opportunity."
    },
    {
      "start_time": 2091.2,
      "end_time": 2092.64,
      "text": "You would go down to a lower time frame."
    },
    {
      "start_time": 2092.64,
      "end_time": 2095.92,
      "text": "Again, the daily chart is very high."
    },
    {
      "start_time": 2095.92,
      "end_time": 2097.04,
      "text": "It's a tie time frame."
    },
    {
      "start_time": 2097.04,
      "end_time": 2098.88,
      "text": "So you're going to be able to break that down into"
    },
    {
      "start_time": 2098.88,
      "end_time": 2101.12,
      "text": "four hours, 60 minute, 15 minute, and five minute."
    },
    {
      "start_time": 2102.4,
      "end_time": 2103.84,
      "text": "Look for buying opportunities in that"
    },
    {
      "start_time": 2104.64,
      "end_time": 2106.4,
      "text": "that area for discounting."
    },
    {
      "start_time": 2106.48,
      "end_time": 2110.16,
      "text": "Market immediately aggressively moves away."
    },
    {
      "start_time": 2111.12,
      "end_time": 2112.88,
      "text": "When we get that, we get another price leg."
    },
    {
      "start_time": 2116.0,
      "end_time": 2120.08,
      "text": "And we can take our Fibonacci and measure it to come up with another"
    },
    {
      "start_time": 2120.8,
      "end_time": 2121.44,
      "text": "equilibrium."
    },
    {
      "start_time": 2122.08,
      "end_time": 2125.2,
      "text": "Doesn't come back down to discount or equilibrium in here."
    },
    {
      "start_time": 2125.2,
      "end_time": 2126.8,
      "text": "So we don't have any trade here."
    },
    {
      "start_time": 2126.8,
      "end_time": 2127.92,
      "text": "The market rallies again."
    },
    {
      "start_time": 2130.8,
      "end_time": 2133.36,
      "text": "From that level, we put our low on our Fibonacci."
    },
    {
      "start_time": 2133.44,
      "end_time": 2138.4,
      "text": "And here's our high here."
    },
    {
      "start_time": 2138.96,
      "end_time": 2142.0,
      "text": "So we have a high, a lower high, and a down candle."
    },
    {
      "start_time": 2142.64,
      "end_time": 2143.68,
      "text": "It hits equilibrium."
    },
    {
      "start_time": 2144.32,
      "end_time": 2146.16,
      "text": "We get a response, rallies up,"
    },
    {
      "start_time": 2146.8,
      "end_time": 2148.32,
      "text": "trades back up to an old low."
    },
    {
      "start_time": 2149.44,
      "end_time": 2150.08,
      "text": "Rejection."
    },
    {
      "start_time": 2150.8,
      "end_time": 2152.08,
      "text": "I'm not looking for cell signals."
    },
    {
      "start_time": 2152.08,
      "end_time": 2153.12,
      "text": "We're not teaching that here."
    },
    {
      "start_time": 2155.28,
      "end_time": 2158.16,
      "text": "Now we have a higher magnitude price swing."
    },
    {
      "start_time": 2159.68,
      "end_time": 2162.88,
      "text": "All this impulsive price swing, even though it's broken up into three legs."
    },
    {
      "start_time": 2163.76,
      "end_time": 2165.36,
      "text": "You still have to measure that because that's the,"
    },
    {
      "start_time": 2166.08,
      "end_time": 2169.52,
      "text": "there's the parent price swing that's currently being traded in right there."
    },
    {
      "start_time": 2170.72,
      "end_time": 2174.32,
      "text": "Okay, so this movement here, when price gets down the equilibrium,"
    },
    {
      "start_time": 2174.32,
      "end_time": 2176.32,
      "text": "we would study and see if there's a reason to be a buyer."
    },
    {
      "start_time": 2176.8,
      "end_time": 2177.68,
      "text": "There's an order block over here."
    },
    {
      "start_time": 2177.68,
      "end_time": 2179.68,
      "text": "So then maybe it's something to look at on the lower timeframe."
    },
    {
      "start_time": 2180.32,
      "end_time": 2181.28,
      "text": "Maybe there was a loss."
    },
    {
      "start_time": 2181.28,
      "end_time": 2182.4,
      "text": "Maybe you didn't take a trade."
    },
    {
      "start_time": 2182.4,
      "end_time": 2185.52,
      "text": "I don't know, but price goes down into a deeper discount."
    },
    {
      "start_time": 2186.24,
      "end_time": 2187.12,
      "text": "Trades right into."
    },
    {
      "start_time": 2188.24,
      "end_time": 2189.04,
      "text": "Bullets over block."
    },
    {
      "start_time": 2189.44,
      "end_time": 2192.08,
      "text": "Now price hits it."
    },
    {
      "start_time": 2192.08,
      "end_time": 2193.28,
      "text": "Does it spend much time there?"
    },
    {
      "start_time": 2193.28,
      "end_time": 2195.04,
      "text": "No, it rallies aggressively."
    },
    {
      "start_time": 2195.04,
      "end_time": 2198.64,
      "text": "And it fills in an area where price had already moved in rather quickly."
    },
    {
      "start_time": 2199.28,
      "end_time": 2202.8,
      "text": "And now this tosses in there for teasing purposes."
    },
    {
      "start_time": 2202.8,
      "end_time": 2206.64,
      "text": "It goes right up to the bottom of this bullish candle,"
    },
    {
      "start_time": 2206.64,
      "end_time": 2208.08,
      "text": "which is a bearish order block."
    },
    {
      "start_time": 2208.08,
      "end_time": 2211.28,
      "text": "And that's an area where you would look to take profits on a long position."
    },
    {
      "start_time": 2212.32,
      "end_time": 2213.6,
      "text": "If you did something like that,"
    },
    {
      "start_time": 2215.6,
      "end_time": 2218.08,
      "text": "buying a savings bottle made here in the middle of this range here."
    },
    {
      "start_time": 2218.16,
      "end_time": 2218.96,
      "text": "And you got out there."
    },
    {
      "start_time": 2220.8,
      "end_time": 2222.4,
      "text": "That's 175 tips."
    },
    {
      "start_time": 2223.36,
      "end_time": 2225.52,
      "text": "Factory and spend about 170 tips."
    },
    {
      "start_time": 2226.32,
      "end_time": 2228.64,
      "text": "How can anyone be upset with something like that?"
    },
    {
      "start_time": 2228.64,
      "end_time": 2230.96,
      "text": "When you're waiting around, you're not getting a million trades."
    },
    {
      "start_time": 2230.96,
      "end_time": 2234.16,
      "text": "Okay, there's not a lot of, this is the daily chart."
    },
    {
      "start_time": 2234.16,
      "end_time": 2235.68,
      "text": "So you're getting about one per week."
    },
    {
      "start_time": 2236.64,
      "end_time": 2238.32,
      "text": "Really good high odds opportunities."
    },
    {
      "start_time": 2238.8,
      "end_time": 2244.32,
      "text": "So when you see moves like this, okay, you can see there's a willingness to recapitalize"
    },
    {
      "start_time": 2244.32,
      "end_time": 2247.44,
      "text": "these levels based on the fact that market goes to a discount."
    },
    {
      "start_time": 2248.4,
      "end_time": 2251.2,
      "text": "We have the same current price swing back here."
    },
    {
      "start_time": 2251.2,
      "end_time": 2254.4,
      "text": "You always use the same ranges that we're currently in."
    },
    {
      "start_time": 2254.96,
      "end_time": 2256.64,
      "text": "This range is still in effect."
    },
    {
      "start_time": 2257.04,
      "end_time": 2260.16,
      "text": "And our comes back down into the seven-time exchange level,"
    },
    {
      "start_time": 2260.16,
      "end_time": 2262.32,
      "text": "which is still a deep discount market."
    },
    {
      "start_time": 2262.88,
      "end_time": 2265.68,
      "text": "And also it blows out an old low."
    },
    {
      "start_time": 2265.68,
      "end_time": 2268.96,
      "text": "So there may be some stops down here that the market takes out."
    },
    {
      "start_time": 2268.96,
      "end_time": 2270.56,
      "text": "Now think, if the market's going to go higher,"
    },
    {
      "start_time": 2271.04,
      "end_time": 2278.32,
      "text": "generally, now think if the market's going to go higher and it's bullish and it comes down below"
    },
    {
      "start_time": 2278.32,
      "end_time": 2282.72,
      "text": "an old low, that's generally going to be a stop loss run."
    },
    {
      "start_time": 2282.72,
      "end_time": 2287.68,
      "text": "That was the first thing I taught in 2010 to look for dynamic price moves."
    },
    {
      "start_time": 2287.68,
      "end_time": 2293.68,
      "text": "If you understand what a bullish market is, okay, you want to define every time the market"
    },
    {
      "start_time": 2293.68,
      "end_time": 2296.32,
      "text": "creates a low and then violates that low."
    },
    {
      "start_time": 2296.32,
      "end_time": 2300.8,
      "text": "If it does that, generally that means that the market makers or the institutional bank and"
    },
    {
      "start_time": 2300.8,
      "end_time": 2305.92,
      "text": "algo will go down below the lows and gather up any orders that will be resting below those orders."
    },
    {
      "start_time": 2306.96,
      "end_time": 2307.92,
      "text": "Blow that low."
    },
    {
      "start_time": 2307.92,
      "end_time": 2311.44,
      "text": "This low here, it's violated here, immediately rejects and goes higher."
    },
    {
      "start_time": 2312.24,
      "end_time": 2316.16,
      "text": "This low here, it goes below here, rejects immediately and goes higher."
    },
    {
      "start_time": 2316.8,
      "end_time": 2320.56,
      "text": "This low here, it goes down below it, rejects and immediately goes higher."
    },
    {
      "start_time": 2320.56,
      "end_time": 2322.08,
      "text": "So now think about what I've just given you."
    },
    {
      "start_time": 2322.08,
      "end_time": 2325.6,
      "text": "I've given you framework to map out what equilibrium is."
    },
    {
      "start_time": 2326.32,
      "end_time": 2327.12,
      "text": "Okay, what is that?"
    },
    {
      "start_time": 2327.92,
      "end_time": 2332.32,
      "text": "Then I told you what the benefit of knowing what below equilibrium is, it's discount."
    },
    {
      "start_time": 2333.12,
      "end_time": 2336.56,
      "text": "When you're looking for a market and when you're looking at a range in the marketplace"
    },
    {
      "start_time": 2336.56,
      "end_time": 2342.48,
      "text": "and the market goes below an old low, that gives you context to look for what? Stop rates below"
    },
    {
      "start_time": 2342.48,
      "end_time": 2346.64,
      "text": "the lows and there should be a reaction going higher. If the market's bullish,"
    },
    {
      "start_time": 2347.36,
      "end_time": 2351.36,
      "text": "if the market's underlying tone is bullish and we're going to frame all that stuff, but for now,"
    },
    {
      "start_time": 2351.36,
      "end_time": 2355.92,
      "text": "I want you to study going your charts and you'll see a plethora of these things occurring all"
    },
    {
      "start_time": 2355.92,
      "end_time": 2362.16,
      "text": "the time. And it gives you the building blocks of knowing what trading setups form, how the market"
    },
    {
      "start_time": 2362.16,
      "end_time": 2366.64,
      "text": "should react and you'll start seeing these things before they happen. You want to study them in"
    },
    {
      "start_time": 2366.64,
      "end_time": 2372.32,
      "text": "the past first, but then start looking for them to anticipate future moves based on what I'm teaching"
    },
    {
      "start_time": 2372.32,
      "end_time": 2379.52,
      "text": "in here. So it gets in summary. We understand that equilibrium is the midway point of a range."
    },
    {
      "start_time": 2379.6,
      "end_time": 2386.64,
      "text": "We need an impulsive price leg higher. Once we identify that individual impulse price swing,"
    },
    {
      "start_time": 2387.44,
      "end_time": 2391.84,
      "text": "we run our Fibonacci from the low up to the high and then we wait for four candles."
    },
    {
      "start_time": 2392.48,
      "end_time": 2396.8,
      "text": "Once there's fourth candle is lower than the highest one, we start waiting for price to come"
    },
    {
      "start_time": 2396.8,
      "end_time": 2401.92,
      "text": "down into equilibrium. When it does that, we can go in and hunt for buying opportunities on the"
    },
    {
      "start_time": 2401.92,
      "end_time": 2408.08,
      "text": "lower timeframes. We blend in institutional order flow ideas like the order blocks, mitigation blocks,"
    },
    {
      "start_time": 2408.08,
      "end_time": 2414.64,
      "text": "breakers, turtle soups, okay, and optimal trade entries. All those things, either one of them,"
    },
    {
      "start_time": 2414.64,
      "end_time": 2420.4,
      "text": "any one of them can be applied for a buying scenario. But if you ever see the conditions that's"
    },
    {
      "start_time": 2420.4,
      "end_time": 2427.04,
      "text": "bullish and a low is swept out, that's when you anticipate a turtle soup. The question I get all"
    },
    {
      "start_time": 2427.04,
      "end_time": 2431.84,
      "text": "the time is, is how do I know if the market's going to keep going lower or if it's going to just"
    },
    {
      "start_time": 2431.84,
      "end_time": 2437.44,
      "text": "go below and below and then rally up? This is the beginning basis point of knowing when that occurs"
    },
    {
      "start_time": 2437.44,
      "end_time": 2445.36,
      "text": "and when not to expect it to turn around. So we have the market reacting off of this,"
    },
    {
      "start_time": 2445.36,
      "end_time": 2450.0,
      "text": "it rallies up. Now we have another price leg rate in here. It took out an old high, so"
    },
    {
      "start_time": 2451.52,
      "end_time": 2461.04,
      "text": "we can go over here, draw our Fibonacci on that low. Up to this high, price comes down to equilibrium,"
    },
    {
      "start_time": 2461.04,
      "end_time": 2464.72,
      "text": "we start hunting for buying opportunities right in here in a lower time frame. I don't know if"
    },
    {
      "start_time": 2464.96,
      "end_time": 2469.44,
      "text": "there's anything there yet. You'll have to go and look in your chart yourself. But we go down into"
    },
    {
      "start_time": 2469.44,
      "end_time": 2478.4,
      "text": "62% trace level, which is now discount, okay. So when we identify equilibrium, that's the 50% level."
    },
    {
      "start_time": 2479.12,
      "end_time": 2485.12,
      "text": "When price goes below 50%, it's at a discount. When is it the highest probable"
    },
    {
      "start_time": 2486.24,
      "end_time": 2491.28,
      "text": "degree of bullishness at a discount price? That's when you have this."
    },
    {
      "start_time": 2495.68,
      "end_time": 2504.32,
      "text": "To 62% to 79% trace level in that area right there, that's the deep discount that we look for"
    },
    {
      "start_time": 2505.04,
      "end_time": 2512.16,
      "text": "in bullish conditions and why Fibonacci 62% to 79% trace level work. Any other time Fibonacci is"
    },
    {
      "start_time": 2512.16,
      "end_time": 2518.72,
      "text": "going to fail you all the time. It's the foundations behind price action that calls these indicators"
    },
    {
      "start_time": 2518.72,
      "end_time": 2525.28,
      "text": "to work sometimes. Even overbought nervous sold indicators will work if you apply these ideas to"
    },
    {
      "start_time": 2525.28,
      "end_time": 2532.88,
      "text": "them. Bullish divergence, trendfelling, hidden divergence, okay, or type 2 trendfelling, which is"
    },
    {
      "start_time": 2532.88,
      "end_time": 2537.76,
      "text": "really what it is developed and discovered by Nick Van Nijsen, not George Lane, by the way. The"
    },
    {
      "start_time": 2539.12,
      "end_time": 2548.0,
      "text": "the ideas have to come by way of sound price action understanding. If it's not there, based on what"
    },
    {
      "start_time": 2548.48,
      "end_time": 2553.04,
      "text": "foundations of price action are implying, then it's not going to work. It doesn't matter when"
    },
    {
      "start_time": 2553.04,
      "end_time": 2558.48,
      "text": "it's in here, you slap on your chart. You need to have the underpinnings of the market being"
    },
    {
      "start_time": 2558.48,
      "end_time": 2564.48,
      "text": "dictated by price action, not by a mathematically derived or crunching of past price to give you"
    },
    {
      "start_time": 2564.48,
      "end_time": 2569.2,
      "text": "some prognostication. It doesn't work like that. The market will not respond to an indicator."
    },
    {
      "start_time": 2569.2,
      "end_time": 2575.36,
      "text": "The indicator is only reflecting a mathematical historical reference of something that price is"
    },
    {
      "start_time": 2575.36,
      "end_time": 2580.48,
      "text": "already done. It has no basis on what the market is going to do going forward. When we look at"
    },
    {
      "start_time": 2580.48,
      "end_time": 2585.44,
      "text": "markets, we have the number one define what these price ranges are. That means number one, if we're"
    },
    {
      "start_time": 2585.44,
      "end_time": 2589.52,
      "text": "bullish, all we're doing is waiting around. When we wait around for Michael, we're waiting for a price"
    },
    {
      "start_time": 2589.52,
      "end_time": 2596.08,
      "text": "move. I'm missing all that. Yeah, you probably are. That's patience. Traders that make money,"
    },
    {
      "start_time": 2596.08,
      "end_time": 2600.96,
      "text": "professionally, or manage funds are not chasing everything that goes on in the marketplace."
    },
    {
      "start_time": 2600.96,
      "end_time": 2606.24,
      "text": "They're no exactly what they're looking for. Once you get a price run like this, it's an"
    },
    {
      "start_time": 2606.24,
      "end_time": 2611.28,
      "text": "impulsive price swing. Then you wait. What are you waiting for? Four candles up here. When the"
    },
    {
      "start_time": 2611.28,
      "end_time": 2615.2,
      "text": "fourth one comes, then you certainly wait for the comeback down the equilibrium. Once it gets the"
    },
    {
      "start_time": 2615.2,
      "end_time": 2621.2,
      "text": "equilibrium, you can look for a signal. But I'm stressing the difference between equilibrium versus"
    },
    {
      "start_time": 2621.2,
      "end_time": 2630.4,
      "text": "discount is you want it to now go below equilibrium into 62% minimum down into 79% tracement. When it"
    },
    {
      "start_time": 2630.4,
      "end_time": 2636.08,
      "text": "does that, that's when you have the highest probable degree of bullishness while in the markets in a"
    },
    {
      "start_time": 2636.08,
      "end_time": 2643.2,
      "text": "discount. Then you should see explosive price acting to the upside. If you're using a daily chart,"
    },
    {
      "start_time": 2643.2,
      "end_time": 2648.16,
      "text": "you'll be able to use this as a day trader, as a short-term trader, a position trader, swing trader."
    },
    {
      "start_time": 2649.44,
      "end_time": 2655.36,
      "text": "Nothing has been changed in the delivery of what I look for relative to bullish order blocks,"
    },
    {
      "start_time": 2656.32,
      "end_time": 2662.08,
      "text": "turtle soups, all that business. Here's the cool thing. If we understand that we're bullish in"
    },
    {
      "start_time": 2662.08,
      "end_time": 2669.12,
      "text": "the discount zone, like we've had here defined by this Fibonacci level, okay, down in this area here,"
    },
    {
      "start_time": 2669.84,
      "end_time": 2677.2,
      "text": "we're looking for specific things to happen. We're not just looking at why this used to term"
    },
    {
      "start_time": 2677.84,
      "end_time": 2684.4,
      "text": "zone, but not like zone like supply and demand zone in this section, or, well, say here, it's not"
    },
    {
      "start_time": 2684.4,
      "end_time": 2689.92,
      "text": "because it's not really defined in the sense that it's supplying demand zones, but it's a total"
    },
    {
      "start_time": 2689.92,
      "end_time": 2698.56,
      "text": "area of valuation where between equilibrium and less than it's in a discount. If you're going to"
    },
    {
      "start_time": 2698.56,
      "end_time": 2703.04,
      "text": "have this as a range to work with them, what inside of the range are you really specifically looking"
    },
    {
      "start_time": 2703.04,
      "end_time": 2709.12,
      "text": "for? Well, you're looking for specific reference points in terms of institutional order flow. That"
    },
    {
      "start_time": 2709.2,
      "end_time": 2715.76,
      "text": "means a stop run, like we defined here and here where the market went lower than a previous"
    },
    {
      "start_time": 2715.76,
      "end_time": 2721.28,
      "text": "low and here, and then you anticipate what? The market to expand the upside. If we understand that"
    },
    {
      "start_time": 2721.28,
      "end_time": 2725.68,
      "text": "that's the occurrence, it should take place when we're down here and we're looking for buy scenarios."
    },
    {
      "start_time": 2725.68,
      "end_time": 2731.36,
      "text": "So if it goes below equilibrium and blows out a Fibonacci level and you take a loss, just find the"
    },
    {
      "start_time": 2731.36,
      "end_time": 2737.12,
      "text": "low that it just blew out and then expect the buy signal there. Then you're buying at a really"
    },
    {
      "start_time": 2737.12,
      "end_time": 2742.56,
      "text": "deep discount. Then you're going to get it explosive with the upside. So now if we're using false"
    },
    {
      "start_time": 2742.56,
      "end_time": 2749.12,
      "text": "breaks below previous lows down here, what can you do to get out of a profitable position?"
    },
    {
      "start_time": 2749.12,
      "end_time": 2754.32,
      "text": "The same thing. You look for a high. If you're buying down here after a stop spin run, you take your"
    },
    {
      "start_time": 2754.32,
      "end_time": 2762.8,
      "text": "profit once this market goes above a previous high. Over here, the market makes a lower low. It rallies."
    },
    {
      "start_time": 2763.28,
      "end_time": 2767.92,
      "text": "Okay. It rallies up. It starts to retrace where you want to get out at when it gets about"
    },
    {
      "start_time": 2768.64,
      "end_time": 2772.48,
      "text": "an old high. Here's an old high. You take your profits right there. But wait a minute, Michael."
    },
    {
      "start_time": 2772.48,
      "end_time": 2776.56,
      "text": "Wait a minute. It didn't go above this one here. What if I were to help on it that one? Then you"
    },
    {
      "start_time": 2776.56,
      "end_time": 2783.36,
      "text": "would have been greedy. He gave you two chances to do it. The market made a new high here, turn"
    },
    {
      "start_time": 2783.36,
      "end_time": 2787.52,
      "text": "back a little around and then one more time, punch it above it. Get out above an old high."
    },
    {
      "start_time": 2788.48,
      "end_time": 2795.36,
      "text": "Markets will distribute, or let me say it this way, market makers and smart money will distribute"
    },
    {
      "start_time": 2795.36,
      "end_time": 2801.68,
      "text": "long positions above old highs. It doesn't have to be the oldest high. You think go above this one"
    },
    {
      "start_time": 2801.68,
      "end_time": 2806.4,
      "text": "either. You think go above this one. You don't need it to. Once it creates a high, they only allow"
    },
    {
      "start_time": 2806.4,
      "end_time": 2811.2,
      "text": "price to retrace to allow stops to build up above an old high. That's how the engineer liquidity."
    },
    {
      "start_time": 2812.24,
      "end_time": 2815.52,
      "text": "So when the engineer liquidity comes in the marketplace in the form of a buy stop,"
    },
    {
      "start_time": 2815.52,
      "end_time": 2820.24,
      "text": "protecting out its short position that somebody out there, you know, foolishly put in here,"
    },
    {
      "start_time": 2820.24,
      "end_time": 2824.32,
      "text": "then the run price above it, hitting those buy stops, those buy stops to come, market orders to buy"
    },
    {
      "start_time": 2824.32,
      "end_time": 2828.72,
      "text": "the market and they sell to those buy stops. They're long positions. They accumulated back here."
    },
    {
      "start_time": 2829.84,
      "end_time": 2835.52,
      "text": "That's all institutional order flow is. Understanding the storyline between what the highs and the"
    },
    {
      "start_time": 2835.52,
      "end_time": 2842.72,
      "text": "lows are giving you. If you frame the ranges based on your understanding of what the market should"
    },
    {
      "start_time": 2842.72,
      "end_time": 2847.76,
      "text": "be bullish or bearish, and that's easy. Don't worry about that. We'll get to that. But for now,"
    },
    {
      "start_time": 2847.76,
      "end_time": 2856.08,
      "text": "I'm trying to try to institute a foundation for looking at price on a hard timeframe and then"
    },
    {
      "start_time": 2857.12,
      "end_time": 2862.8,
      "text": "managing your expectations based on what you see on this timeframe. And also building the"
    },
    {
      "start_time": 2862.8,
      "end_time": 2870.72,
      "text": "beginning basis to your anticipatory skills for looking for future moves. Wait a minute, Michael."
    },
    {
      "start_time": 2870.72,
      "end_time": 2877.52,
      "text": "You just form fitted this one. This is probably just only working on this chart here."
    },
    {
      "start_time": 2878.4,
      "end_time": 2884.96,
      "text": "What happens if you go into what happens if you go into an hourly chart? Suddenly it's all"
    },
    {
      "start_time": 2884.96,
      "end_time": 2890.0,
      "text": "going to be different, right? It's going to be different. It's all going to be different. Well,"
    },
    {
      "start_time": 2893.12,
      "end_time": 2899.52,
      "text": "here we have a price leg here. Okay, impulsive price swing. You map that out."
    },
    {
      "start_time": 2900.32,
      "end_time": 2907.28,
      "text": "Okay. Swing high, fourth candle doesn't get back down the equilibrium. No problem. We wait for it to"
    },
    {
      "start_time": 2907.28,
      "end_time": 2912.32,
      "text": "do it. It doesn't do it. Makes another leg higher. What happened? We missed it. Don't worry about it."
    },
    {
      "start_time": 2912.32,
      "end_time": 2917.52,
      "text": "Don't chase it. You know exactly what you're waiting for. Price makes the new higher high."
    },
    {
      "start_time": 2917.52,
      "end_time": 2921.68,
      "text": "So we have the low to the high. What are we waiting for? Price to get down the equilibrium. Okay,"
    },
    {
      "start_time": 2921.68,
      "end_time": 2926.0,
      "text": "great. But what happens when it gets below that? We're in a discount market. We have to go into"
    },
    {
      "start_time": 2926.0,
      "end_time": 2931.6,
      "text": "what? 62% retracement level minimum right here. It does. Does it stay there long? No way it doesn't"
    },
    {
      "start_time": 2931.6,
      "end_time": 2937.36,
      "text": "stay that long. What happens? The price moves away from it. And then what does it do? Comes back"
    },
    {
      "start_time": 2937.36,
      "end_time": 2943.68,
      "text": "down into equilibrium again and expands again. It consolidates a little bit. Makes a short term high."
    },
    {
      "start_time": 2944.48,
      "end_time": 2947.92,
      "text": "Where do you take your profits at, Michael? Above an old time short term high."
    },
    {
      "start_time": 2948.88,
      "end_time": 2952.88,
      "text": "Boom, it rallies above it. Knocks that high out and it even comes back and clears this one out too,"
    },
    {
      "start_time": 2952.88,
      "end_time": 2957.44,
      "text": "just by a little bit. And then look what happened. They retraced all the way back down to equilibrium again."
    },
    {
      "start_time": 2957.44,
      "end_time": 2962.32,
      "text": "Does it spend time much there? No. rallies back up. Where's it go back to? The bottom of this bullish"
    },
    {
      "start_time": 2963.12,
      "end_time": 2967.92,
      "text": "candle, which is a pair of shoulder block, fills it right to the right to the pip. And I'm going to tell"
    },
    {
      "start_time": 2967.92,
      "end_time": 2974.88,
      "text": "you something. I hate this pair. I literally hate this pair with a passion because it's this"
    },
    {
      "start_time": 2974.88,
      "end_time": 2980.16,
      "text": "sneaky pair like the Japanese yen. And you Swiss folks and Japanese folks, please don't take"
    },
    {
      "start_time": 2980.16,
      "end_time": 2985.92,
      "text": "the offense to that. I'm just, I don't like the currencies put that way. The, the open-air"
    },
    {
      "start_time": 2985.92,
      "end_time": 2993.12,
      "text": "candle is 9768. And the high on this candle comes in at exactly 9768. So you take your profits"
    },
    {
      "start_time": 2993.12,
      "end_time": 2997.04,
      "text": "right there. Not at that high. You exit before you get to that. Remember, we always want to get out"
    },
    {
      "start_time": 2997.04,
      "end_time": 3004.32,
      "text": "before we get to the actual price like now. We have another higher high right here. See that? So"
    },
    {
      "start_time": 3004.32,
      "end_time": 3009.04,
      "text": "we're going to wait for price to get down to equilibrium and less. It does it here. Again, 62%"
    },
    {
      "start_time": 3009.04,
      "end_time": 3013.92,
      "text": "in the rest of 62% retracement level. Should it stay there long? No, does it? No, it doesn't."
    },
    {
      "start_time": 3013.92,
      "end_time": 3017.92,
      "text": "It rallies away. Retraces back to equilibrium again. And then what do we expect to equilibrium?"
    },
    {
      "start_time": 3017.92,
      "end_time": 3023.12,
      "text": "What did I teach you about the algo? It goes from consolidation, which is always going to be at"
    },
    {
      "start_time": 3023.12,
      "end_time": 3029.92,
      "text": "equilibrium to expansion. What's it expanding to? To liquidity. Where's the liquidity at? Right here"
    },
    {
      "start_time": 3029.92,
      "end_time": 3034.96,
      "text": "before it takes off going vertical, where is the liquidity at? It's above this high and above this"
    },
    {
      "start_time": 3035.04,
      "end_time": 3039.84,
      "text": "high here. What is it? Buy stops. Somebody wants to protect a short position. So if they're going to"
    },
    {
      "start_time": 3039.84,
      "end_time": 3045.28,
      "text": "buy down here as smart money, they're going to sell it to who? Somebody wants to buy a higher price."
    },
    {
      "start_time": 3045.28,
      "end_time": 3049.68,
      "text": "The buy stops here and the buy stops here. Look what happens. It goes up a little bit,"
    },
    {
      "start_time": 3049.68,
      "end_time": 3054.4,
      "text": "small little retracement and then expands aggressively. What's it going for? The stops right here"
    },
    {
      "start_time": 3054.4,
      "end_time": 3061.2,
      "text": "and then right here. Then once we go above, look what happens. This movement here. What did I teach you?"
    },
    {
      "start_time": 3061.2,
      "end_time": 3075.44,
      "text": "I teach that markets move in intraday price action in grades of 10. There's 10, 10, and 20"
    },
    {
      "start_time": 3075.44,
      "end_time": 3081.44,
      "text": "pit ranges above a high. That's how far they'll reach for a stop. Boom. There you go. There's your stop"
    },
    {
      "start_time": 3081.44,
      "end_time": 3087.04,
      "text": "on equal highs. Remember, I told you on your charts, mark out areas where there's equal highs."
    },
    {
      "start_time": 3087.04,
      "end_time": 3093.04,
      "text": "They're too clean. The market's going to want to run there. Anything below 50% is discount,"
    },
    {
      "start_time": 3094.48,
      "end_time": 3100.8,
      "text": "but it can go back to equilibrium and consolidate and then expand. I'm blending two components"
    },
    {
      "start_time": 3101.52,
      "end_time": 3108.08,
      "text": "giving you an introduction to the interbank Alga where you'll know what the price engines"
    },
    {
      "start_time": 3108.08,
      "end_time": 3113.6,
      "text": "were going to do before they do it. They're going to offer the price higher when it's time to do so,"
    },
    {
      "start_time": 3113.6,
      "end_time": 3119.44,
      "text": "but they're going to have to capitalize discounted markets before it goes higher. It won't just go"
    },
    {
      "start_time": 3119.44,
      "end_time": 3124.0,
      "text": "straight up for no reason. It doesn't operate like that. The market has to come back down to a"
    },
    {
      "start_time": 3124.0,
      "end_time": 3130.08,
      "text": "discount and below equilibrium. Then you get explosive moves. Then it may come back to equilibrium"
    },
    {
      "start_time": 3130.8,
      "end_time": 3134.96,
      "text": "to consolidate and wait for an expansion. Then the expansion comes and you look for the"
    },
    {
      "start_time": 3134.96,
      "end_time": 3141.2,
      "text": "look totally above the marketplace. The difference between equilibrium is, yes, it's fair market value"
    },
    {
      "start_time": 3141.2,
      "end_time": 3147.92,
      "text": "at equilibrium. We as traders, we want to trade at discounts. We have to get below equilibrium"
    },
    {
      "start_time": 3147.92,
      "end_time": 3154.16,
      "text": "when it gets into 62% tradesman level or down into 70.5 or even setting up tradesman levels,"
    },
    {
      "start_time": 3154.16,
      "end_time": 3158.4,
      "text": "you really need to be considering being interested in being long on those markets when you're"
    },
    {
      "start_time": 3158.4,
      "end_time": 3164.16,
      "text": "underlying bullishness is there. Waiting for expansion, blending in all the tools that you'll learn."
    },
    {
      "start_time": 3165.6,
      "end_time": 3170.48,
      "text": "Look at the below here. We're below equilibrium. Here's a low. It comes all the way down."
    },
    {
      "start_time": 3170.48,
      "end_time": 3173.84,
      "text": "It hits those right there. What would you expect? Even if you didn't see the Fibonacci,"
    },
    {
      "start_time": 3173.84,
      "end_time": 3179.92,
      "text": "what would you expect? Did this as a turtle suit? It's a run on stops and quickly rejects."
    },
    {
      "start_time": 3179.92,
      "end_time": 3183.12,
      "text": "It comes back down. What if it's going to go lower, Michael? It shouldn't. Why? Because it already"
    },
    {
      "start_time": 3183.12,
      "end_time": 3189.92,
      "text": "took the stops out. It's only retracing a little bit. If you took another Fibonacci and you put"
    },
    {
      "start_time": 3189.92,
      "end_time": 3193.92,
      "text": "it on this range because we're looking at an hourly chart here. This would be a smaller price"
    },
    {
      "start_time": 3193.92,
      "end_time": 3198.08,
      "text": "leg in a lower timeframe. Look at it does. It goes right back down into an optimal trade entry again,"
    },
    {
      "start_time": 3198.08,
      "end_time": 3203.52,
      "text": "below equilibrium, optimal trade entry, and does it spend lots of time down there? No. It rallies"
    },
    {
      "start_time": 3203.52,
      "end_time": 3208.4,
      "text": "up. It hits the 62% of the tradesman level again, and then expands. Boom. Takes off."
    },
    {
      "start_time": 3209.76,
      "end_time": 3217.36,
      "text": "There's no magic in Fibonacci. None. The only thing it helps you do is visually see what equilibrium"
    },
    {
      "start_time": 3217.36,
      "end_time": 3225.92,
      "text": "is in price. Then below equilibrium, where is a good price to enter at a discount? Here's the benefit."
    },
    {
      "start_time": 3226.0,
      "end_time": 3230.64,
      "text": "If it goes lower than the optimal trade entry between 62 and 70% of tradesman levels,"
    },
    {
      "start_time": 3230.64,
      "end_time": 3236.8,
      "text": "and your underlying bullishness is there, wait for the turtle suit by. Boom. It's that easy."
    },
    {
      "start_time": 3236.8,
      "end_time": 3241.6,
      "text": "It's that easy. You don't believe me. I know you don't believe me. That's the beautiful part"
    },
    {
      "start_time": 3241.6,
      "end_time": 3246.48,
      "text": "about this. That's why I want you to go into your charts and look for it. If we have a bullish market,"
    },
    {
      "start_time": 3247.92,
      "end_time": 3253.76,
      "text": "and we know that markets are retracing, you won't need to see the Fibonacci. You can just eyeball it"
    },
    {
      "start_time": 3253.76,
      "end_time": 3259.92,
      "text": "between this low and this high, midway points about right here. This market move below that"
    },
    {
      "start_time": 3259.92,
      "end_time": 3265.36,
      "text": "is below equilibrium. It's at a discount. And guess what? It cleared out stops over here. What's"
    },
    {
      "start_time": 3265.36,
      "end_time": 3273.04,
      "text": "it going to do? Rally. It rallies up. Equal lows in here. Too clean. Market drops down. What's it"
    },
    {
      "start_time": 3273.04,
      "end_time": 3278.32,
      "text": "doing? Coming down to equilibrium, Fibonacci levels. Optimal trade entry. I'm not going to put"
    },
    {
      "start_time": 3278.32,
      "end_time": 3282.72,
      "text": "the Fibonacci on it. You can do it. From this low to this high, goes right down into optimal trade"
    },
    {
      "start_time": 3282.72,
      "end_time": 3286.88,
      "text": "entry. Explodes. Why? Because it cleared out the equal lows down here. Boom. Explodes up to the"
    },
    {
      "start_time": 3286.88,
      "end_time": 3292.72,
      "text": "upside. What about this low over here, Michael? Sure. Come down. It cleans it out. What should"
    },
    {
      "start_time": 3292.72,
      "end_time": 3297.68,
      "text": "it happen? It should expand. It's bullish. We're in a discount market. They're only coming down to"
    },
    {
      "start_time": 3297.68,
      "end_time": 3302.16,
      "text": "take the stops below the marketplace out. These are sell stops. Why would the market makers want to"
    },
    {
      "start_time": 3302.16,
      "end_time": 3306.72,
      "text": "take the market down to take out sell stops? Because it injects people that want to sell to them that"
    },
    {
      "start_time": 3306.72,
      "end_time": 3312.08,
      "text": "want to buy. They get counter parties to their buy orders by having the sell stops tripped below"
    },
    {
      "start_time": 3312.16,
      "end_time": 3320.24,
      "text": "that low. Boom. Explodes. Just low right here. Violated right here. Not by much. It doesn't need to be"
    },
    {
      "start_time": 3320.24,
      "end_time": 3326.24,
      "text": "much. Once it hits that level, the orders go hot. Bang. Explodes up the upside. But it doesn't make"
    },
    {
      "start_time": 3326.24,
      "end_time": 3329.92,
      "text": "a new high, Michael. It doesn't have to. You get exited right here at your old order box."
    },
    {
      "start_time": 3331.44,
      "end_time": 3336.8,
      "text": "You don't need to have everything out there to come in alignment. The stars don't have to align"
    },
    {
      "start_time": 3336.8,
      "end_time": 3341.2,
      "text": "to get you a profitable trade. You just need a couple things that make sense. They have to start"
    },
    {
      "start_time": 3342.0,
      "end_time": 3347.04,
      "text": "with equilibrium to discount for buys. It has to happen. If you don't get that,"
    },
    {
      "start_time": 3347.68,
      "end_time": 3352.24,
      "text": "you're not going to have these explosive buy signals. It's going to fall on your lap. It's not"
    },
    {
      "start_time": 3352.24,
      "end_time": 3356.24,
      "text": "just knowing. Give me a buy signal, Michael. Tell me when to get in and get out. This is why I told"
    },
    {
      "start_time": 3356.24,
      "end_time": 3362.24,
      "text": "you you have to understand things before just looking for bullish order blocks, before turtle suit"
    },
    {
      "start_time": 3362.24,
      "end_time": 3368.48,
      "text": "longs, before optimal trade entry longs, before stochastic divergence bullishly. None of those things"
    },
    {
      "start_time": 3368.56,
      "end_time": 3374.4,
      "text": "work outside of understanding the central tenant to what a market is at equilibrium or below it at"
    },
    {
      "start_time": 3374.4,
      "end_time": 3381.52,
      "text": "discount. That's a favorable buying market. Anything apart from that, you stay away from it. You wait"
    },
    {
      "start_time": 3381.52,
      "end_time": 3385.92,
      "text": "or look for the opposite side of the market, which is what we'll talk about next week when we look"
    },
    {
      "start_time": 3385.92,
      "end_time": 3387.92,
      "text": "at equilibrium versus premium."
    }
  ],
  "word_count": 9620,
  "segment_count": 610,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:51:15.563714",
  "title": "ICT Mentorship Core Content - Month 1 - Equilibrium Vs. Discount"
}