{
  "video_id": "RP6rVMJP4hA",
  "full_text": "Okay folks, welcome back. This is volume 15 in a continuing series of 20 videos for the optimal trade entry pattern recognition series for the Industrial Trader YouTube channel. Alright, so our example today is going to be in the Australian versus the US dollar and we have our charts already trained in the 5 minute timeframe and I'm going to ask you to take a look at the chart, study it before I add the annotations. So pause your video now. Okay, I'm going to add the annotations. Alright, so we can see our standard 830 in the morning to 11 AM New York Standard Time. The optimal trade entry right in here, this leg comes down exactly at 830 AM. The price leg is here to here and then down. Not there was a smaller retracement that wasn't absolutely an optimal trade entry. That's not to diminish that as the pattern but we have to incorporate the elements of the time window. That's here. Okay, so you can see on this particular candle 830 AM dead on it. Trades down your fill would have been on that candle. Your fill is 62% Tracement level, keeping with the models minimum rules. 0.6619 as our entry, there's a four-pip drawdown from your entry and using a 10-pip stop loss below this low here. We have an old high returning almost 10-pips there, almost 20-pips and you have one standard deviation offering a handsome potential reward there, one and a half and then finally taking off at two standard deviations of the optimal trade entry range there. Offering 39 pips just in this short little run here. Now you have to weather this retracement and then ultimately it gets to it there. So if you use this one using the rules, you'd be bailing out of the trade as it hit here, even though you could have taken parcels at any one of these. Okay, so here's the secondary entry opportunity and using this price leg low, the price leg high, the retracement down in, your fill would be on this candle here with the spread and your fill would be a hypothetical 0.6639 entry. You have only a three-pip drawdown and the run above the relative equal highs, we want to see expansion there and ultimately trades to one half of a standard deviation offering more than 25 pips and this candle trades exactly to that high of 6667 and 5 pips, which is right here and doesn't go any higher than that. Consolidates and breaks down. This after trading down the here would have eventually stopped you out even on the initial entry down here. You would have trailed your stop loss out, reaped below these lows, you would have gotten stopped out at that point. So any parcels that would have been left in the marketplace to try to get to the previous days high, which is over here, that previous days high coming in at 66680 and 2 pips is an undelivered target. I mentioned this in my Twitter dialogue today, basically kind of like pushing and emphasizing what's more important, is it your target being hit or profiting. So many traders in this industry lose money and they've had open paper profit. When I say paper profit, I'm not talking about this demo trading. I'm saying that how many times have you traded with life funds and then watched a potential profit completely turn around against you and go into a loss. Now how many times could you go back in time hypothetically and say if I just would have took something off when it was given me X amount of pips or X amount of dollars for return. And you did that as a general rule of thumb, you always pay yourself. I made a remark yesterday on Twitter along the lines that if you worked a partial week at your job, say you working on Monday through Friday and you worked Monday and Tuesday and became ill and didn't finish dressfully. Because your employer get to keep all of those earned income hours that you put in on Monday and Tuesday, of course not. So when you put on a trade and the market offers you an opportunity to take something off and scaling, you have to do that. Otherwise you fall victim to something like this where both patterns offered opportunity to book a profit hypothetically. But if you don't execute those partials that are at logical levels as we talk about in the fib, again, the fib is not the magic. It's just logical levels for you to take off something. You're not forced to, but this is what will happen invariably. If you keep doing this long enough, you're going to have a trade that will look good. It'll look good. It'll look strong. It'll look like it's performing. And it may in fact look like it's going to go and run up above that high, but it peaters out and loses momentum and goes the other direction. So you're either left with being upset and emotional about not taking partials and getting stopped out or learning from that and saying, okay, I can take something off. And I'm not going to demand my best case scenario exit or target. And I'm going to take something off. And there are a plethora of so-called educators in this industry that will say partials is stupid. Partials is dumb. Partials is a rookie ploy or attempt to just satisfy the fear and greed tug of war that's going on. And the last one I agree with, because it rewards your time and risk. And it doesn't matter that you're reducing the amount of potential profit. You're reducing the same thing on a relative basis that you had in terms of risk. You're reducing it as you take something off. You're paying the trader. You're rewarding your risk, the initial risk and taking something out. Remember, that work week analogy, you have to find a way to grow comfortable taking something out of the marketplace when it off to you. If you come into this industry or if you've been unable to find profitability and you can't warm up to this idea, I guarantee you, if you try it, you'll love it. Because it manages all of that fear and greed that tug of war takes place once you put the trade on in a live setting. You want to get out of the trade. You want it to get to your target right away, but you can't force that. But as it logically moves to levels where you could take partial profits and exit some of the position, thus reducing the exposure or risk, but rewarding and adding to your bottom line. Because these targets are not guaranteed. But guess what? If you're in a market and it's trading here and you put your market order to get out, that's more likely to fill you in a profit than waiting for that undelivered target. So today, I kind of like pushed the envelope to try to get you thinking about this particular pair on Twitter and it gave two opportunities. Both yielded the potential to pay out, but it did not hit the logical level of the previous days high. It's not necessary to find profitability getting your best case scenario targets. So if we found this insightful, until next time, we should good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 12.16,
      "text": "Okay folks, welcome back."
    },
    {
      "start_time": 12.16,
      "end_time": 17.4,
      "text": "This is volume 15 in a continuing series of 20 videos for the optimal trade entry pattern"
    },
    {
      "start_time": 17.4,
      "end_time": 20.96,
      "text": "recognition series for the Industrial Trader YouTube channel."
    },
    {
      "start_time": 20.96,
      "end_time": 27.12,
      "text": "Alright, so our example today is going to be in the Australian versus the US dollar and"
    },
    {
      "start_time": 27.12,
      "end_time": 32.44,
      "text": "we have our charts already trained in the 5 minute timeframe and I'm going to ask you"
    },
    {
      "start_time": 32.44,
      "end_time": 35.76,
      "text": "to take a look at the chart, study it before I add the annotations."
    },
    {
      "start_time": 35.76,
      "end_time": 39.28,
      "text": "So pause your video now."
    },
    {
      "start_time": 39.28,
      "end_time": 44.72,
      "text": "Okay, I'm going to add the annotations."
    },
    {
      "start_time": 44.72,
      "end_time": 56.76,
      "text": "Alright, so we can see our standard 830 in the morning to 11 AM New York Standard Time."
    },
    {
      "start_time": 56.76,
      "end_time": 62.44,
      "text": "The optimal trade entry right in here, this leg comes down exactly at 830 AM."
    },
    {
      "start_time": 62.44,
      "end_time": 66.84,
      "text": "The price leg is here to here and then down."
    },
    {
      "start_time": 66.84,
      "end_time": 73.68,
      "text": "Not there was a smaller retracement that wasn't absolutely an optimal trade entry."
    },
    {
      "start_time": 73.68,
      "end_time": 79.56,
      "text": "That's not to diminish that as the pattern but we have to incorporate the elements of the"
    },
    {
      "start_time": 79.56,
      "end_time": 80.56,
      "text": "time window."
    },
    {
      "start_time": 80.56,
      "end_time": 81.56,
      "text": "That's here."
    },
    {
      "start_time": 81.56,
      "end_time": 86.72,
      "text": "Okay, so you can see on this particular candle 830 AM dead on it."
    },
    {
      "start_time": 87.72,
      "end_time": 90.84,
      "text": "Trades down your fill would have been on that candle."
    },
    {
      "start_time": 90.84,
      "end_time": 96.0,
      "text": "Your fill is 62% Tracement level, keeping with the models minimum rules."
    },
    {
      "start_time": 96.0,
      "end_time": 102.18,
      "text": "0.6619 as our entry, there's a four-pip drawdown from your entry and using a 10-pip stop loss"
    },
    {
      "start_time": 102.18,
      "end_time": 104.8,
      "text": "below this low here."
    },
    {
      "start_time": 104.8,
      "end_time": 117.72,
      "text": "We have an old high returning almost 10-pips there, almost 20-pips and you have one standard"
    },
    {
      "start_time": 117.72,
      "end_time": 124.92,
      "text": "deviation offering a handsome potential reward there, one and a half and then finally taking"
    },
    {
      "start_time": 124.92,
      "end_time": 131.12,
      "text": "off at two standard deviations of the optimal trade entry range there."
    },
    {
      "start_time": 131.12,
      "end_time": 135.68,
      "text": "Offering 39 pips just in this short little run here."
    },
    {
      "start_time": 135.68,
      "end_time": 140.32,
      "text": "Now you have to weather this retracement and then ultimately it gets to it there."
    },
    {
      "start_time": 140.32,
      "end_time": 145.6,
      "text": "So if you use this one using the rules, you'd be bailing out of the trade as it hit here,"
    },
    {
      "start_time": 145.6,
      "end_time": 148.0,
      "text": "even though you could have taken parcels at any one of these."
    },
    {
      "start_time": 148.0,
      "end_time": 153.84,
      "text": "Okay, so here's the secondary entry opportunity and using this price leg low, the price leg"
    },
    {
      "start_time": 153.84,
      "end_time": 161.88,
      "text": "high, the retracement down in, your fill would be on this candle here with the spread and"
    },
    {
      "start_time": 161.88,
      "end_time": 165.44,
      "text": "your fill would be a hypothetical 0.6639 entry."
    },
    {
      "start_time": 165.44,
      "end_time": 171.88,
      "text": "You have only a three-pip drawdown and the run above the relative equal highs, we want"
    },
    {
      "start_time": 171.88,
      "end_time": 179.36,
      "text": "to see expansion there and ultimately trades to one half of a standard deviation offering"
    },
    {
      "start_time": 179.36,
      "end_time": 188.6,
      "text": "more than 25 pips and this candle trades exactly to that high of 6667 and 5 pips, which"
    },
    {
      "start_time": 188.6,
      "end_time": 192.08,
      "text": "is right here and doesn't go any higher than that."
    },
    {
      "start_time": 192.08,
      "end_time": 194.64,
      "text": "Consolidates and breaks down."
    },
    {
      "start_time": 194.64,
      "end_time": 199.24,
      "text": "This after trading down the here would have eventually stopped you out even on the initial"
    },
    {
      "start_time": 199.24,
      "end_time": 200.56,
      "text": "entry down here."
    },
    {
      "start_time": 200.56,
      "end_time": 204.52,
      "text": "You would have trailed your stop loss out, reaped below these lows, you would have gotten"
    },
    {
      "start_time": 204.52,
      "end_time": 206.96,
      "text": "stopped out at that point."
    },
    {
      "start_time": 206.96,
      "end_time": 212.72,
      "text": "So any parcels that would have been left in the marketplace to try to get to the previous"
    },
    {
      "start_time": 212.72,
      "end_time": 220.0,
      "text": "days high, which is over here, that previous days high coming in at 66680 and 2 pips is an"
    },
    {
      "start_time": 220.0,
      "end_time": 222.0,
      "text": "undelivered target."
    },
    {
      "start_time": 222.0,
      "end_time": 229.44,
      "text": "I mentioned this in my Twitter dialogue today, basically kind of like pushing and emphasizing"
    },
    {
      "start_time": 229.44,
      "end_time": 236.28,
      "text": "what's more important, is it your target being hit or profiting."
    },
    {
      "start_time": 237.28,
      "end_time": 243.6,
      "text": "So many traders in this industry lose money and they've had open paper profit."
    },
    {
      "start_time": 243.6,
      "end_time": 246.52,
      "text": "When I say paper profit, I'm not talking about this demo trading."
    },
    {
      "start_time": 246.52,
      "end_time": 253.92,
      "text": "I'm saying that how many times have you traded with life funds and then watched a potential"
    },
    {
      "start_time": 253.92,
      "end_time": 258.32,
      "text": "profit completely turn around against you and go into a loss."
    },
    {
      "start_time": 258.32,
      "end_time": 261.84,
      "text": "Now how many times could you go back in time hypothetically and say if I just would have"
    },
    {
      "start_time": 261.84,
      "end_time": 268.52,
      "text": "took something off when it was given me X amount of pips or X amount of dollars for return."
    },
    {
      "start_time": 268.52,
      "end_time": 273.48,
      "text": "And you did that as a general rule of thumb, you always pay yourself."
    },
    {
      "start_time": 273.48,
      "end_time": 278.92,
      "text": "I made a remark yesterday on Twitter along the lines that if you worked a partial week"
    },
    {
      "start_time": 278.92,
      "end_time": 284.72,
      "text": "at your job, say you working on Monday through Friday and you worked Monday and Tuesday"
    },
    {
      "start_time": 284.72,
      "end_time": 287.12,
      "text": "and became ill and didn't finish dressfully."
    },
    {
      "start_time": 287.12,
      "end_time": 292.2,
      "text": "Because your employer get to keep all of those earned income hours that you put in on Monday"
    },
    {
      "start_time": 292.2,
      "end_time": 294.56,
      "text": "and Tuesday, of course not."
    },
    {
      "start_time": 294.56,
      "end_time": 298.68,
      "text": "So when you put on a trade and the market offers you an opportunity to take something off"
    },
    {
      "start_time": 298.68,
      "end_time": 301.84,
      "text": "and scaling, you have to do that."
    },
    {
      "start_time": 301.84,
      "end_time": 307.52,
      "text": "Otherwise you fall victim to something like this where both patterns offered opportunity"
    },
    {
      "start_time": 307.52,
      "end_time": 311.08,
      "text": "to book a profit hypothetically."
    },
    {
      "start_time": 311.08,
      "end_time": 316.72,
      "text": "But if you don't execute those partials that are at logical levels as we talk about in"
    },
    {
      "start_time": 316.72,
      "end_time": 319.56,
      "text": "the fib, again, the fib is not the magic."
    },
    {
      "start_time": 319.56,
      "end_time": 323.24,
      "text": "It's just logical levels for you to take off something."
    },
    {
      "start_time": 323.24,
      "end_time": 326.76,
      "text": "You're not forced to, but this is what will happen invariably."
    },
    {
      "start_time": 326.76,
      "end_time": 330.8,
      "text": "If you keep doing this long enough, you're going to have a trade that will look good."
    },
    {
      "start_time": 330.8,
      "end_time": 331.8,
      "text": "It'll look good."
    },
    {
      "start_time": 331.8,
      "end_time": 332.8,
      "text": "It'll look strong."
    },
    {
      "start_time": 332.8,
      "end_time": 333.8,
      "text": "It'll look like it's performing."
    },
    {
      "start_time": 333.8,
      "end_time": 338.52,
      "text": "And it may in fact look like it's going to go and run up above that high, but it peaters"
    },
    {
      "start_time": 338.52,
      "end_time": 341.68,
      "text": "out and loses momentum and goes the other direction."
    },
    {
      "start_time": 341.68,
      "end_time": 348.72,
      "text": "So you're either left with being upset and emotional about not taking partials and getting"
    },
    {
      "start_time": 348.72,
      "end_time": 354.84,
      "text": "stopped out or learning from that and saying, okay, I can take something off."
    },
    {
      "start_time": 354.84,
      "end_time": 360.36,
      "text": "And I'm not going to demand my best case scenario exit or target."
    },
    {
      "start_time": 360.36,
      "end_time": 361.68,
      "text": "And I'm going to take something off."
    },
    {
      "start_time": 361.68,
      "end_time": 368.28,
      "text": "And there are a plethora of so-called educators in this industry that will say partials is"
    },
    {
      "start_time": 368.28,
      "end_time": 369.68,
      "text": "stupid."
    },
    {
      "start_time": 369.68,
      "end_time": 371.36,
      "text": "Partials is dumb."
    },
    {
      "start_time": 371.36,
      "end_time": 380.32,
      "text": "Partials is a rookie ploy or attempt to just satisfy the fear and greed tug of war that's"
    },
    {
      "start_time": 380.32,
      "end_time": 381.32,
      "text": "going on."
    },
    {
      "start_time": 381.32,
      "end_time": 389.8,
      "text": "And the last one I agree with, because it rewards your time and risk."
    },
    {
      "start_time": 389.8,
      "end_time": 395.12,
      "text": "And it doesn't matter that you're reducing the amount of potential profit."
    },
    {
      "start_time": 395.12,
      "end_time": 400.88,
      "text": "You're reducing the same thing on a relative basis that you had in terms of risk."
    },
    {
      "start_time": 400.88,
      "end_time": 402.76,
      "text": "You're reducing it as you take something off."
    },
    {
      "start_time": 402.76,
      "end_time": 405.08,
      "text": "You're paying the trader."
    },
    {
      "start_time": 405.08,
      "end_time": 410.08,
      "text": "You're rewarding your risk, the initial risk and taking something out."
    },
    {
      "start_time": 410.08,
      "end_time": 417.32,
      "text": "Remember, that work week analogy, you have to find a way to grow comfortable taking something"
    },
    {
      "start_time": 417.32,
      "end_time": 419.64,
      "text": "out of the marketplace when it off to you."
    },
    {
      "start_time": 419.64,
      "end_time": 424.2,
      "text": "If you come into this industry or if you've been unable to find profitability and you can't"
    },
    {
      "start_time": 424.2,
      "end_time": 430.56,
      "text": "warm up to this idea, I guarantee you, if you try it, you'll love it."
    },
    {
      "start_time": 430.56,
      "end_time": 434.52,
      "text": "Because it manages all of that fear and greed that tug of war takes place once you put"
    },
    {
      "start_time": 434.52,
      "end_time": 436.2,
      "text": "the trade on in a live setting."
    },
    {
      "start_time": 436.2,
      "end_time": 437.92,
      "text": "You want to get out of the trade."
    },
    {
      "start_time": 437.92,
      "end_time": 440.76,
      "text": "You want it to get to your target right away, but you can't force that."
    },
    {
      "start_time": 440.76,
      "end_time": 445.76,
      "text": "But as it logically moves to levels where you could take partial profits and exit some"
    },
    {
      "start_time": 445.76,
      "end_time": 452.3,
      "text": "of the position, thus reducing the exposure or risk, but rewarding and adding to your"
    },
    {
      "start_time": 452.3,
      "end_time": 453.3,
      "text": "bottom line."
    },
    {
      "start_time": 453.3,
      "end_time": 457.16,
      "text": "Because these targets are not guaranteed."
    },
    {
      "start_time": 457.16,
      "end_time": 458.68,
      "text": "But guess what?"
    },
    {
      "start_time": 458.68,
      "end_time": 464.32,
      "text": "If you're in a market and it's trading here and you put your market order to get out,"
    },
    {
      "start_time": 464.32,
      "end_time": 470.12,
      "text": "that's more likely to fill you in a profit than waiting for that undelivered target."
    },
    {
      "start_time": 470.12,
      "end_time": 475.28,
      "text": "So today, I kind of like pushed the envelope to try to get you thinking about this particular"
    },
    {
      "start_time": 475.28,
      "end_time": 479.76,
      "text": "pair on Twitter and it gave two opportunities."
    },
    {
      "start_time": 479.76,
      "end_time": 487.0,
      "text": "Both yielded the potential to pay out, but it did not hit the logical level of the previous"
    },
    {
      "start_time": 487.0,
      "end_time": 488.0,
      "text": "days high."
    },
    {
      "start_time": 488.0,
      "end_time": 494.0,
      "text": "It's not necessary to find profitability getting your best case scenario targets."
    },
    {
      "start_time": 494.0,
      "end_time": 497.08,
      "text": "So if we found this insightful, until next time, we should good luck and good trading."
    }
  ],
  "word_count": 1255,
  "segment_count": 106,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:31:58.327049",
  "title": "OTE Pattern Recognition Series - Vol. 15"
}