{
  "video_id": "SiVmoeyOWZE",
  "full_text": "you Welcome back folks. This is ICT with a sixth installment of the eight teachings of September 2016, ICT Mentorship. We're me specifically dealing with fair evaluation in this teaching. And fair evaluation comes in the form of two perspectives. Fair value in regards to equal distance of a higher low or what we would call equilibrium or fair value for the perspective on valuation as regards to market makers. And I'm going to combine both of them to give you the perspective that you have to have when you look at price. This is actually a chart that we mapped out in advance talking about a lot of these very specific things here in the week of this tutorial's production September 24, 2016. We called Australian dollar higher based on the things that I'm going to cover here. I was aiming for 7665 as a weekly objective. And you can clearly see here the market did in fact hit that. What led to these ideas behind me giving these upside objectives from an area down here? Well, first you have to understand there's a lot of overlap from what we just covered in the previous two sessions that being equilibrium to discount and equilibrium to premium. Obviously if you're a buyer, if you want to be buying, you want to be looking at a discount market. That means trading in a lower third of the current trading range that the market is presently or currently created and it's most recent impulse like or impulse price swing. The cells are best taken in the most current trading range or impulse price swing, upper third portion of that range. That's a premium market. We're selling at a premium. When the market returns back to an area of fair value, that is a fair value for the market maker to either sell or buy. In this case, we're going to cover again both concepts in regards to equilibrium and the fair valuation for market maker, participation and price action. This swing here is making this high here. The market broke down and it quickly ran away. This is what we call a liquidity void. The market makes a sudden movement lower and large ranges, very little wicks, very quick movement. That is a void. That means the price spend very little time trading at these price levels and it was going to hurry to get down to this area where it started trading more efficiently back and forth from both sides of the candle and ultimately having a retracement. This range in here, as soon as we see pockets of price action where there's sudden movement lower, just like we saw a quick sudden movement lower here, this up candle at the bottom of that, that's where we start watching and measuring fair value. And the down candle here, very next candle is up candle. So we start looking at the range between this up candle and this up candle. Between those two up candles, there's what's referred to as a fair value gap. Fair value gap. The reason why this is important is because there was no up candle or up movement between the break of that low and the high of this candle here. It was all just straight down movement. So nothing filled in this area once price broke this low, it left it open. Basically, it's like a gap. The same thing occurs here when this up candle is broken here. When this candle once it started breaking lower, there's a gap between this candle's low and this candle body or a wick. So I define it by the body. I like to use those. The range in which it causes this void, when prices below that, this is going to be fair value. The market's going to want to come back to that because there was very little trading in there, just like we said, there was a gap because there was no movement up in this area here between this up candles low and this up candles high. This area and price action only saw down movement. Didn't have any up candle movement, only down movement. All this down here is down candle price action only big ranges. So this is a liquidity void. The fact that it creates it in big ranges and speed, that's what defines it. Now, because price moves so quickly in these areas, fair value is established because there's going to be a willingness to want to see price trade back up into these levels and here and closing all this. In other words, there's going to be up movement later on. It won't happen immediately always. Sometimes it takes a little bit of time, sometimes depending upon the time, when you're looking at it, it may take a great deal of time. But when price starts to move higher, we know that they will try to trade into this range here and fill that in in a later time. That is where market makers view fair value. Now, equilibrium or fair value in regards to equal distance range between high and low of a defined high and low range, that being if we have this low here and this high here, if we define that with Fib, we have equilibrium right here or 50% of that range from this high, this high to this low. Here's equilibrium. Look at the bodies of the can, they'll stay above that, but we have a lot of work around that equilibrium price point. That in itself is significant because it's showing you the market ran through a short term high. Once it ran through it, it came back down right back to the middle of the range or fair value, which is equilibrium. At this moment, price could stay in this consolidation for a period of time of any length. We don't know how long price it's going to stay in a consolidation. But at equilibrium, you need to refer to where the most recent price swing took place. In other words, we're at equilibrium here or fair value, the market can go either way at this price level. The easiest way to determine where it's most probable direction is is where did market structure break most recently? Did it break a swing high? Or did it break a swing low most recently? Well, there's no swing low in here of any significance, but there's a swing high up here that it broke through here. So when we made this low, price ran through it, clearing not these highs, right on this upcandle. Price come back down into equilibrium. Do we define the range from here to here? As you're looking at price, you always want to get a feel for where you're at in regards to those current trading range. Also, notice that we are in the lower portion of the range defined by this high in this low. So we're in a real low area where it would be deemed over sold. So we have a range concept blending with the fact that we're moving back into middle of a smaller consolidated trading range with a market structure break of recent high in here, broke to high, and it came back to equilibrium. So the highest probability in terms of direction is going to be going short or going long. Well, obviously, it's going to be going long, but the mechanics behind it was that the fact that we broke this swing high, we have this void in here. We had weakness in the dollar, which we're not going to talk so much about correlation between dollar-based analysis, the borrowing of specificity dealing with price action alone here. But what led to this bullish moving and allity dollar this week was the fact that we moved back into fair value or equilibrium. So that way, it's fair value for the market makers to build in long positions or build a net long book. That means they're building accumulating long positions. The down candle right before this move up through a short term high, that is a bullish order block. So price comes down into that hits it. At the same time, it's hitting at equilibrium. And it's deemed fair value. It's fair value because the market traded back down into an area where it would be bought again, and where it should be expected to see buying pressure come in. We don't want to buy it up here because we've already broke a swing high. What are we doing up there? We would be buying it a premium net to not what you want to do. So you're going to blend the couple things when you're looking for high probability set ups to get fair valuation. You're going to be looking at the current range from high to low. In this area right here, we're in the lower end of that range. So we have a lot more upside to build in a premium, like we just discussed in the previous tutorial. Okay, market will go to a premium. Okay, the market's buying at a discount. Okay, and it's at equilibrium. It's at fair valuation because we're in the low end of the range from this high to this low. And we have all of this open price action right in here. So the market's going to want to want to come up there and close that in. It doesn't have to come all the way back up to this candle's low, which is a bear's order block. This up candle right for the down move. All this is up needed to give us a directional bias. We have a swing high in here where we know what's going to be resting about that by stops. So we know that there is a strong likelihood that because we're in the low end of the total range, which is this low to this high. So this is the parent price swing, this high to this low. We created a short term load. It was higher. We broke through a swing high came back down into the equal distance of the high to the low. That is equilibrium. We are now at fair valuation for what? For longs to market makers can build a net long book at this price level. Now, if they're going to do that, they're going to look for fair value above the marketplace where they can do what? Sell their positions at a fair value for them. Up here, if traders are buying this chasing price, are they buying at a fair value? No, they're buying at a premium. Remember that we just discussed in regards to equal equilibrium to premium. The range from this high to this low, we're above 50% level. In here, we're in the upper portion of the optimal trade entry or 62 to 79% trade level. I'll show you what that looks like. Hello to the high. 79% chasing level, 70.5, 62% trade level. So the market goes right up into 79% tradesmen. So we're in premium here. We're below equilibrium here. So we're at a discount down here relative to the range. Down here, we're at discount. In terms of looking at the low to high, this is where the premiums built in. If we reverse it and look at the range in opposite terms, defining it from low to high, we're below the 79% tradesmen level. So we're really at a deep discount, really, really deep discount because we're below equilibrium relative to the range high and the low, we're even below the 79% tradesmen level here. So in terms of really being suppressed, in terms of the total range, high to low, we are at a deep discount in the middle of a current small little trading range from this high. To this low. So we're at equal distance price measurement of high, middle, low. In into total end or lower one third of the range of the parent price swing that we see here. Right in here, okay? Even if you didn't see this high to low as the parent price swing, this price swing high to low still gives you the same context just in a smaller scale. So you have high to low, we're in a lower one third here and we're in deep discount. Here's equal distance or equilibrium. We're below it so we're at discount. So fair evaluation for the market makers to build a book long would be so many overlapping factors there. They could be building long positions or accumulating long positions here, looking for what liquidity above marketplace. That means where above these highs that initially it just sold off of. Then you have the buy stops about here. So the market runs through that, takes those stops, runs through this short term high here and then what does it do? Goes into consolidation. Now if it's a turtle soup and it wants to go lower after blowing out buy stops, it should go lower quickly. It doesn't do that. It's staying in a sideways consolidation. In fact, during this week, actually gave five sessions explaining how this market was point to higher prices. It went back into consolidation, which means it's going back into what? It's building equilibrium. Okay, so equilibrium is building again in that small little range. So you define the high and the low right there. Look how much price access spends around the middle point at equilibrium price point. Okay, so it's hanging around fair value. Okay, one spike move lower doesn't see price go lower. It's any significant. It doesn't break the range and it expands to the upside. Once it expands to the upside, it starts filling in all of this. Again, this is another area of fair value. The market's fair for those long positions for the market maker that had already accumulated longs on. This is a good area, in this shaded area. Extend this out in the pond over here. All of this is a good place for them to sell the longs that they started accumulating down here. Look how much time they whip back and forth in that range, all these wicks. Okay, they're selling, they're selling, they're selling all the positions they've accumulated here, accumulated here and down here on the initial run down into the support. Once this range is closed in, the next area of concern is above this short term high. Okay. So I have a void filled in right here. It's filled in. So this is no longer of area of interest, no, no more. Now we still look for higher prices. Why would we still look for higher prices? Because they went long here. Okay, so if they're going to look to sell their position, where would they look to sell their positions at? Discount prices are premium. Premium. But the premium price that speculators would trade at by buying and chasing price, it's a premium to price chasers. People that feed off the desire of being in a price move, it's already been moving higher. It's fair value to the market maker to liquidate their positions at this small little pocket between this lows, this upcandles low and this upcandles high. So we can now create a new specific area of fair value for the market maker to liquidate their long positions in here, right in here. To draw that out in time, that's what you see here, price coming right into bottom of that candle, hit it perfectly to the pit, body to the candle, or still deep inside the shaded area for fair valuation. What makes it fair is because they bought it at a deep discount and they're liquidating at a premium. It's fair for them to accumulate here and it's fair for them to liquidate. See, market makers have to deal in terms of valuation for their longs and their shorts and they have to do that same valuation for their exits on both sides of the marketplace. So when we see inefficiency and price like we see here with these candles, just only going down, no up, moving in, only going down here, no up, moving in until later on, all of this area, they're scaling out their positions that they accumulated down here, here, and here. When price moves in defined trading ranges, there's going to be equilibrium. Equilibrium is in itself fair value. That means the market makers are holding it in a consolidation. When that consolidation gives way, the strongest move out of that consolidation on a long, on a hard time frame chart will give you a great deal of prognostication for directional bias. So what I mean by that is if we look at price, let me take a look at it like this, we can look at price like, turn this high down to this low to have a range defined there. Okay, the markets in this range here consolidate, it goes right back to equilibrium, hangs around equilibrium, dips down below the equilibrium. So even if we're monitoring this range from this high to this low, we're below the equilibrium price point. So are we at a premium right here, or are we at a discount, we're at a discount. Traders on a retail level, they're going to see this as a selling point, they're going to want to get short, because they're going to see this high to this low coming up to 62% in a tradesman level. Now, remember I said in the last two sessions is not enough, this look, simply looking at Pibidachi, you can get tripped up in Pibidachi if you don't understand what price is actually telling you. So getting short here is not what you want to do, even though you've seen price movement going lower, it's only coming down to an area of fair value for the market makers to accumulate longs in an area of discount. So you're having an overlap of three things, you're looking at total range from this high to this low or this high to this low, we're in a lower portion or one third of the range. So we're in high probability for a discount market to be in effect. You're also below the price point or equilibrium between the low to this high. So it's consolidating here that, but it now went below it again. So we are in an area where the market makers can buy, especially if you combine that with areas of institutional overflow. So if you're looking to buy, what would you be looking for in the area to run out below the stops, in other words, sell stops below and below, we don't see so much of that happening here, it doesn't need to do that. It's only returning down to this down candle, which is a bullish order block, a down candle before the market moves higher. That's where market support really relies, we're not really relies resides in, okay, up candles for the market drops down, that up candle is exactly where resistance is an institutional basis. So that's where selling occurs. So when we see price action like this, we can define things in terms of fair value in relationship to how the market makers are going to perceive price, the way they value price in terms of the current range that it's trading in, the same way the Algo delivers price, where are we at in proximity to the current total range. We have a nice impulsive price swing high to low here. We are in the lower portion of that range here. We have built-ins by stops above this high, above this high here, above this high here, and we have a valuation gap, okay, a fair value gap. Market's going to want to come back up there because it's spent very little time in this area, it was all down movement, all down movement, no buying was actually occurring in here, no buying was occurring in here, it was all on the sell side, one way flows. So the market ran up into just the clothes in where only selling took place in no real buyers. So now when price comes back up to that level and they shoot it up there like that, that's going to make a run on stop the bulb is swing high and we're just going to close in the range between this up candle and this up candle here, which is a fair value gap. So when we're looking at price action, it's a couple things you need to keep in consideration. The total range of trading in, the equilibrium price point relative to the most recent trading range high and low, and we defined several. In here, we did this high to this low with this high and this low and this high and this low. So we have multiple things lining up with the fact that for fair value sake, the market has a deep discount here and it's most likely going to trade higher and we have reference points that we can look for where the market makers should aim, but ultimately this is the fair value gap that they wanted to get back up into and the reason why in the basis was of me calling 7665 for the week was I want to get just below where ultimately I think it's going to go and the the low which if we look at the high, the low comes in at 7675 and I want to be about 10 pips or so before the actual level I think is actually going to be hit. I want to be getting on this a little bit before that and one more instance of the things I've talked about before it happens in the charge and why those things actually materialized in price action. So price returns back to fair fair value in the perspective of the market maker not fair value in the scope of buying this is added premium. Okay, remember that market efficiency paradigm I started you all with how you perceive the marketplace is not how retail is going to see the price. They're going to see this as the market's going to probably keep going up because it's been going up. Well, this is an area distribution. You want to be thinking accumulation down here, re-accumulation, distribution, scaling out all through these areas in here because you don't know if it's only going to come up a little bit of that range or here in the shaded liquidity boy, you don't know if it's going to fill in that and then go lower. So when you buy things down in here as deep discount, you have to scale some of it out. But the beginning basis points of valuation in terms of the market makers, you have to look at the total range, look at where the market has moved away from quickly. And those areas of liquidity voids and liquidity pulls above old highs here and here and here. That is going to be fair value for the market maker to distribute long positions. If we were looking at a cell position or a short position, we would be looking for areas in which the market in the past has moved up a great deal with speed. And we would be looking for lows where stops would be building up below it or liquidity pulls in the form of cell stops. We would look for the lower end of the most recent range for valuation. So that way, you would know by looking at things with that market efficiency paradigm, you're not looking at things like retail, you're looking at it in the scope of, okay, I am a bank. I'm making a book here. Where is the most efficient price levels for me to unload my longs or unload my short positions? We've already mentioned it so far in the teachings just for September. The easiest way to understand institutional overflow from the beginning starting point of all is understanding that markets move from buy stops and cell stops and cell stops to buy stops and it moves from fair value to discount to discount to premium to premium to fair value. And it moves back and forth between these three reference points. Are we at a discount? Are we at a premium? Are we at fair value? All those things combined together, they give you the clues as to what we're seeing in terms of the market maker's accent or the accumulating or the manipulating or the distributing. All those factors, we're going to be bringing those closely knit ideas into a more easily understood premise. When we look at price, we'll be able to see these things unfolding in in advance and you'll be able to see what should take place and it's a very encouraging to see your study in these individual components start to flesh out and have a greater understanding about price action. So, including fair value is not fair value in the realm of retail. It's in the realm of fair value of liquidating or accumulating from the market maker's perspective. Fair value in discount is fair value for buys for market maker buying. Fair value in premium is fair value for market maker selling either establishing new shorts or exiting on scaling out long positions. Discount below equilibrium in the low ends of the range that's a discount market, that's an area at which the market makers can buy or look to cover their short positions. Do not look at the marketplace in this retail mindset that we're all trained to do. We have the same well we drink from. It's the same regurgitated stuff, but it's wrong. To understand how these markets are delivered to us in the form of price action, when this price is delivered to us, it's not random. It's very specific of where it wants to go, why it wants to get there, that's what we're giving you in this mentorship. It's very specific detailed perspectives that are generic, they repeat themselves or never again, and because they repeat themselves, because they're the same phenomenon, take place almost on a daily basis, there's nothing for you to fear if you mess it up and you don't get to trade to pan out right or if you miss a move, do not worry about it. Wait for the market to give you indications of where fair valuation is. Then you'll be able to anticipate the market maker's next scale in or scale out. It may be the liquidation of a long position that's been on their way. That may give you prognostication for a future move. It may be the inception of a new price leg while you're waiting for this area to be retreated to. We'll build on this idea for now, but I want you to think in terms of where we at relative to the most current range. Are we in the lower end? Are we near the low of that current range? Are we working around an equal distance equilibrium price point between a recent high and low by defining price in current trading ranges like this? You'll be able to see where the market makers will expand the price. So there's expansion. You know prior to that expansion, there's been what? It's consolidation. So as you study more examples of when markets are in consolidation, you'll be able to forecast the next movement out of the consolidation. We don't play the breakout game. We anticipate the breakout. We know that the indications through price action will give us clues as to what side of the marketplace is going to break out. And when we get into commodities, we'll have actually a great advantage of that using open interest, but for forex, you don't need it so much. You can still see it in institutional workflow. So I'm going to close this teaching here with the promise that we're going to come back at the end of this series of eight sessions in your notes that will accompany your months summary. You'll have great detail of specific notes and things that you need to be aware of as it relates to fair evaluation, liquidity pools, voids, liquidity gaps, all those things. We'll be building more foundation on that. And in a month, two, actually, given to how to find these things, not just giving you one chart's perspective and basically, you know, trying to teach the whole thing in one chart. It can't be done. So you need the examples of it. You need to see it called for in advance, like we did this week, not so much wine into this great detail, but I gave you the areas of which price should reach for and we talked about the area here. We talked about this void here. And obviously, we don't even need to talk about the highs because we understand that that's where the buy starts going to reside. So think in terms of fair value for the market maker. If they're going to go higher, where's it fair value for them to exit their loans? Okay, it's a fair value for them to do so. They do not want to liquidate their loans at a discount or one retracement's going lower. You look for expansions on the upside. When they expand, when price expands, they should be reaching into an area fair value for price to be liquidating smart money loans. That's the only reason why markets go up. That's the only reason why prices allow to be delivered at higher prices because the market makers, the banks have books on when they're books that are net long and it's in their interest to see price higher. It doesn't matter how many of us buy, the price is going to be set by the bank and they're going to do things to line their own pockets and not yours. So it takes a perspective shift and it gets back to that market efficiency paradigm I started you with in this mentorship that you have to view things from a smart money perspective, not what retail should be doing or what retail is doing. If you do that, you're going to you're going to miss the actual clarity that comes through looking at price action, studying it through a contrary and perspective, saying okay, this is what the retail minds should be thinking now and by contrasting that with what you see in the charts for fair value, liquidity gaps, liquidity voids, liquidity pools, all these things, the market is going to seek that liquidity and run against the less informed crowd's opinion. So with that I'm going to close and wish you good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 2.0,
      "text": "you"
    },
    {
      "start_time": 30.0,
      "end_time": 46.0,
      "text": "Welcome back folks. This is ICT with a sixth installment of the eight teachings of September"
    },
    {
      "start_time": 46.0,
      "end_time": 54.0,
      "text": "2016, ICT Mentorship. We're me specifically dealing with fair evaluation in this teaching."
    },
    {
      "start_time": 54.96,
      "end_time": 62.08,
      "text": "And fair evaluation comes in the form of two perspectives. Fair value in regards to equal"
    },
    {
      "start_time": 62.08,
      "end_time": 69.2,
      "text": "distance of a higher low or what we would call equilibrium or fair value for the perspective"
    },
    {
      "start_time": 69.2,
      "end_time": 76.24,
      "text": "on valuation as regards to market makers. And I'm going to combine both of them to give you the"
    },
    {
      "start_time": 76.24,
      "end_time": 82.88,
      "text": "perspective that you have to have when you look at price. This is actually a chart that we mapped out"
    },
    {
      "start_time": 83.68,
      "end_time": 90.16,
      "text": "in advance talking about a lot of these very specific things here in the week of this"
    },
    {
      "start_time": 91.28,
      "end_time": 99.68,
      "text": "tutorial's production September 24, 2016. We called Australian dollar higher"
    },
    {
      "start_time": 100.4,
      "end_time": 106.4,
      "text": "based on the things that I'm going to cover here. I was aiming for 7665 as a weekly objective."
    },
    {
      "start_time": 107.04,
      "end_time": 113.76,
      "text": "And you can clearly see here the market did in fact hit that. What led to these ideas behind me"
    },
    {
      "start_time": 113.76,
      "end_time": 121.12,
      "text": "giving these upside objectives from an area down here? Well, first you have to understand there's"
    },
    {
      "start_time": 121.12,
      "end_time": 126.4,
      "text": "a lot of overlap from what we just covered in the previous two sessions that being equilibrium"
    },
    {
      "start_time": 126.4,
      "end_time": 131.2,
      "text": "to discount and equilibrium to premium. Obviously if you're a buyer, if you want to be buying,"
    },
    {
      "start_time": 131.2,
      "end_time": 136.16,
      "text": "you want to be looking at a discount market. That means trading in a lower third of the current"
    },
    {
      "start_time": 136.16,
      "end_time": 143.36,
      "text": "trading range that the market is presently or currently created and it's most recent impulse"
    },
    {
      "start_time": 143.36,
      "end_time": 151.6,
      "text": "like or impulse price swing. The cells are best taken in the most current trading range or"
    },
    {
      "start_time": 152.24,
      "end_time": 159.04,
      "text": "impulse price swing, upper third portion of that range. That's a premium market. We're selling"
    },
    {
      "start_time": 159.04,
      "end_time": 168.0,
      "text": "at a premium. When the market returns back to an area of fair value, that is a fair value"
    },
    {
      "start_time": 168.0,
      "end_time": 174.88,
      "text": "for the market maker to either sell or buy. In this case, we're going to cover again both"
    },
    {
      "start_time": 176.0,
      "end_time": 181.36,
      "text": "concepts in regards to equilibrium and the fair valuation for market maker,"
    },
    {
      "start_time": 182.32,
      "end_time": 190.56,
      "text": "participation and price action. This swing here is making this high here. The market broke down"
    },
    {
      "start_time": 191.92,
      "end_time": 199.44,
      "text": "and it quickly ran away. This is what we call a liquidity void. The market makes a sudden movement"
    },
    {
      "start_time": 199.44,
      "end_time": 207.36,
      "text": "lower and large ranges, very little wicks, very quick movement. That is a void. That means the price"
    },
    {
      "start_time": 207.44,
      "end_time": 211.36,
      "text": "spend very little time trading at these price levels and it was going to hurry to get down to"
    },
    {
      "start_time": 212.0,
      "end_time": 215.92,
      "text": "this area where it started trading more efficiently back and forth from both sides of the candle"
    },
    {
      "start_time": 216.56,
      "end_time": 224.64,
      "text": "and ultimately having a retracement. This range in here, as soon as we see pockets of price action"
    },
    {
      "start_time": 224.64,
      "end_time": 230.32,
      "text": "where there's sudden movement lower, just like we saw a quick sudden movement lower here,"
    },
    {
      "start_time": 230.96,
      "end_time": 238.48,
      "text": "this up candle at the bottom of that, that's where we start watching and measuring fair value."
    },
    {
      "start_time": 239.68,
      "end_time": 245.12,
      "text": "And the down candle here, very next candle is up candle. So we start looking at the range between"
    },
    {
      "start_time": 245.6,
      "end_time": 251.68,
      "text": "this up candle and this up candle. Between those two up candles, there's what's referred to as a"
    },
    {
      "start_time": 251.68,
      "end_time": 258.8,
      "text": "fair value gap. Fair value gap. The reason why this is important is because there was no"
    },
    {
      "start_time": 258.8,
      "end_time": 265.92,
      "text": "up candle or up movement between the break of that low and the high of this candle here."
    },
    {
      "start_time": 266.72,
      "end_time": 272.16,
      "text": "It was all just straight down movement. So nothing filled in this area once price broke this low,"
    },
    {
      "start_time": 272.16,
      "end_time": 278.4,
      "text": "it left it open. Basically, it's like a gap. The same thing occurs here when this up candle"
    },
    {
      "start_time": 279.12,
      "end_time": 284.64,
      "text": "is broken here. When this candle once it started breaking lower, there's a gap between this candle's"
    },
    {
      "start_time": 284.64,
      "end_time": 292.56,
      "text": "low and this candle body or a wick. So I define it by the body. I like to use those."
    },
    {
      "start_time": 293.68,
      "end_time": 303.68,
      "text": "The range in which it causes this void, when prices below that, this is going to be fair value."
    },
    {
      "start_time": 304.56,
      "end_time": 308.48,
      "text": "The market's going to want to come back to that because there was very little trading in there,"
    },
    {
      "start_time": 308.48,
      "end_time": 313.76,
      "text": "just like we said, there was a gap because there was no movement up in this area here between this"
    },
    {
      "start_time": 313.76,
      "end_time": 320.32,
      "text": "up candles low and this up candles high. This area and price action only saw down movement."
    },
    {
      "start_time": 321.44,
      "end_time": 328.0,
      "text": "Didn't have any up candle movement, only down movement. All this down here is down candle price"
    },
    {
      "start_time": 328.0,
      "end_time": 333.76,
      "text": "action only big ranges. So this is a liquidity void. The fact that it creates it in big ranges"
    },
    {
      "start_time": 333.76,
      "end_time": 341.28,
      "text": "and speed, that's what defines it. Now, because price moves so quickly in these areas, fair value"
    },
    {
      "start_time": 341.84,
      "end_time": 347.12,
      "text": "is established because there's going to be a willingness to want to see price trade back up into these"
    },
    {
      "start_time": 347.12,
      "end_time": 351.04,
      "text": "levels and here and closing all this. In other words, there's going to be up movement later on."
    },
    {
      "start_time": 351.04,
      "end_time": 354.8,
      "text": "It won't happen immediately always. Sometimes it takes a little bit of time, sometimes"
    },
    {
      "start_time": 354.8,
      "end_time": 358.72,
      "text": "depending upon the time, when you're looking at it, it may take a great deal of time. But when price"
    },
    {
      "start_time": 358.72,
      "end_time": 363.76,
      "text": "starts to move higher, we know that they will try to trade into this range here and fill that in"
    },
    {
      "start_time": 363.76,
      "end_time": 374.08,
      "text": "in a later time. That is where market makers view fair value. Now, equilibrium or fair value"
    },
    {
      "start_time": 374.08,
      "end_time": 380.56,
      "text": "in regards to equal distance range between high and low of a defined high and low range,"
    },
    {
      "start_time": 381.36,
      "end_time": 389.84,
      "text": "that being if we have this low here and this high here, if we define that with Fib,"
    },
    {
      "start_time": 394.24,
      "end_time": 402.48,
      "text": "we have equilibrium right here or 50% of that range from this high,"
    },
    {
      "start_time": 405.84,
      "end_time": 412.32,
      "text": "this high to this low. Here's equilibrium. Look at the bodies of the can, they'll stay above that,"
    },
    {
      "start_time": 412.32,
      "end_time": 419.36,
      "text": "but we have a lot of work around that equilibrium price point. That in itself is significant"
    },
    {
      "start_time": 419.36,
      "end_time": 424.88,
      "text": "because it's showing you the market ran through a short term high. Once it ran through it,"
    },
    {
      "start_time": 425.52,
      "end_time": 431.76,
      "text": "it came back down right back to the middle of the range or fair value, which is equilibrium. At"
    },
    {
      "start_time": 431.76,
      "end_time": 436.8,
      "text": "this moment, price could stay in this consolidation for a period of time of any length. We don't know"
    },
    {
      "start_time": 436.8,
      "end_time": 443.36,
      "text": "how long price it's going to stay in a consolidation. But at equilibrium, you need to refer to where the"
    },
    {
      "start_time": 443.36,
      "end_time": 449.2,
      "text": "most recent price swing took place. In other words, we're at equilibrium here or fair value,"
    },
    {
      "start_time": 449.2,
      "end_time": 453.44,
      "text": "the market can go either way at this price level. The easiest way to determine where it's most"
    },
    {
      "start_time": 453.44,
      "end_time": 459.52,
      "text": "probable direction is is where did market structure break most recently? Did it break a swing high?"
    },
    {
      "start_time": 459.52,
      "end_time": 464.32,
      "text": "Or did it break a swing low most recently? Well, there's no swing low in here of any significance,"
    },
    {
      "start_time": 464.32,
      "end_time": 469.36,
      "text": "but there's a swing high up here that it broke through here. So when we made this low,"
    },
    {
      "start_time": 469.44,
      "end_time": 473.92,
      "text": "price ran through it, clearing not these highs, right on this upcandle."
    },
    {
      "start_time": 475.2,
      "end_time": 480.32,
      "text": "Price come back down into equilibrium. Do we define the range from here to here? As you're looking"
    },
    {
      "start_time": 480.32,
      "end_time": 484.56,
      "text": "at price, you always want to get a feel for where you're at in regards to those current trading"
    },
    {
      "start_time": 484.56,
      "end_time": 491.44,
      "text": "range. Also, notice that we are in the lower portion of the range defined by this high"
    },
    {
      "start_time": 491.76,
      "end_time": 501.36,
      "text": "in this low. So we're in a real low area where it would be deemed over sold. So we have a"
    },
    {
      "start_time": 502.64,
      "end_time": 510.8,
      "text": "range concept blending with the fact that we're moving back into middle of a smaller consolidated"
    },
    {
      "start_time": 510.8,
      "end_time": 517.04,
      "text": "trading range with a market structure break of recent high in here, broke to high, and it came"
    },
    {
      "start_time": 517.12,
      "end_time": 522.88,
      "text": "back to equilibrium. So the highest probability in terms of direction is going to be going short or"
    },
    {
      "start_time": 522.88,
      "end_time": 528.88,
      "text": "going long. Well, obviously, it's going to be going long, but the mechanics behind it was"
    },
    {
      "start_time": 529.44,
      "end_time": 536.72,
      "text": "that the fact that we broke this swing high, we have this void in here. We had weakness in the"
    },
    {
      "start_time": 536.72,
      "end_time": 541.28,
      "text": "dollar, which we're not going to talk so much about correlation between dollar-based analysis,"
    },
    {
      "start_time": 541.28,
      "end_time": 545.92,
      "text": "the borrowing of specificity dealing with price action alone here. But what led to this bullish"
    },
    {
      "start_time": 545.92,
      "end_time": 552.56,
      "text": "moving and allity dollar this week was the fact that we moved back into fair value or equilibrium."
    },
    {
      "start_time": 553.2,
      "end_time": 559.44,
      "text": "So that way, it's fair value for the market makers to build in long"
    },
    {
      "start_time": 560.4,
      "end_time": 565.84,
      "text": "positions or build a net long book. That means they're building accumulating long positions."
    },
    {
      "start_time": 567.2,
      "end_time": 572.08,
      "text": "The down candle right before this move up through a short term high, that is a bullish order block."
    },
    {
      "start_time": 572.08,
      "end_time": 576.16,
      "text": "So price comes down into that hits it. At the same time, it's hitting at equilibrium."
    },
    {
      "start_time": 576.8,
      "end_time": 582.88,
      "text": "And it's deemed fair value. It's fair value because the market traded back down into an area where it"
    },
    {
      "start_time": 582.88,
      "end_time": 587.36,
      "text": "would be bought again, and where it should be expected to see buying pressure come in."
    },
    {
      "start_time": 588.4,
      "end_time": 592.8,
      "text": "We don't want to buy it up here because we've already broke a swing high. What are we doing up there?"
    },
    {
      "start_time": 592.8,
      "end_time": 597.84,
      "text": "We would be buying it a premium net to not what you want to do. So you're going to blend the"
    },
    {
      "start_time": 597.84,
      "end_time": 602.8,
      "text": "couple things when you're looking for high probability set ups to get fair valuation."
    },
    {
      "start_time": 603.68,
      "end_time": 609.6,
      "text": "You're going to be looking at the current range from high to low. In this area right here,"
    },
    {
      "start_time": 609.6,
      "end_time": 615.92,
      "text": "we're in the lower end of that range. So we have a lot more upside to build in a premium,"
    },
    {
      "start_time": 615.92,
      "end_time": 621.52,
      "text": "like we just discussed in the previous tutorial. Okay, market will go to a premium. Okay, the market's"
    },
    {
      "start_time": 621.52,
      "end_time": 628.88,
      "text": "buying at a discount. Okay, and it's at equilibrium. It's at fair valuation because we're in the"
    },
    {
      "start_time": 628.88,
      "end_time": 635.76,
      "text": "low end of the range from this high to this low. And we have all of this open price action right in"
    },
    {
      "start_time": 635.76,
      "end_time": 639.92,
      "text": "here. So the market's going to want to want to come up there and close that in. It doesn't have to"
    },
    {
      "start_time": 639.92,
      "end_time": 643.84,
      "text": "come all the way back up to this candle's low, which is a bear's order block. This up candle right"
    },
    {
      "start_time": 643.84,
      "end_time": 651.84,
      "text": "for the down move. All this is up needed to give us a directional bias. We have a swing high in"
    },
    {
      "start_time": 651.84,
      "end_time": 657.68,
      "text": "here where we know what's going to be resting about that by stops. So we know that there is a strong"
    },
    {
      "start_time": 659.12,
      "end_time": 664.64,
      "text": "likelihood that because we're in the low end of the total range, which is this low to this high. So"
    },
    {
      "start_time": 664.64,
      "end_time": 669.6,
      "text": "this is the parent price swing, this high to this low. We created a short term load. It was higher."
    },
    {
      "start_time": 669.6,
      "end_time": 675.6,
      "text": "We broke through a swing high came back down into the equal distance of the high to the low."
    },
    {
      "start_time": 676.4,
      "end_time": 683.36,
      "text": "That is equilibrium. We are now at fair valuation for what? For longs to market makers can build a"
    },
    {
      "start_time": 683.36,
      "end_time": 690.48,
      "text": "net long book at this price level. Now, if they're going to do that, they're going to look for fair value"
    },
    {
      "start_time": 690.48,
      "end_time": 696.64,
      "text": "above the marketplace where they can do what? Sell their positions at a fair value for them."
    },
    {
      "start_time": 697.6,
      "end_time": 701.84,
      "text": "Up here, if traders are buying this chasing price, are they buying at a fair value?"
    },
    {
      "start_time": 703.12,
      "end_time": 707.76,
      "text": "No, they're buying at a premium. Remember that we just discussed in regards to"
    },
    {
      "start_time": 708.64,
      "end_time": 717.28,
      "text": "equal equilibrium to premium. The range from this high to this low, we're above 50% level."
    },
    {
      "start_time": 717.28,
      "end_time": 723.36,
      "text": "In here, we're in the upper portion of the optimal trade entry or 62 to 79% trade"
    },
    {
      "start_time": 723.36,
      "end_time": 725.52,
      "text": "level. I'll show you what that looks like."
    },
    {
      "start_time": 728.96,
      "end_time": 731.36,
      "text": "Hello to the high."
    },
    {
      "start_time": 734.88,
      "end_time": 742.72,
      "text": "79% chasing level, 70.5, 62% trade level. So the market goes right up into 79%"
    },
    {
      "start_time": 742.72,
      "end_time": 750.16,
      "text": "tradesmen. So we're in premium here. We're below equilibrium here. So we're at a discount"
    },
    {
      "start_time": 750.24,
      "end_time": 756.72,
      "text": "down here relative to the range. Down here, we're at discount."
    },
    {
      "start_time": 758.4,
      "end_time": 766.72,
      "text": "In terms of looking at the low to high, this is where the premiums built in. If we reverse it"
    },
    {
      "start_time": 769.84,
      "end_time": 776.24,
      "text": "and look at the range in opposite terms, defining it from low to high,"
    },
    {
      "start_time": 776.4,
      "end_time": 783.92,
      "text": "we're below the 79% tradesmen level. So we're really at a deep discount,"
    },
    {
      "start_time": 784.48,
      "end_time": 788.48,
      "text": "really, really deep discount because we're below equilibrium relative to the range high"
    },
    {
      "start_time": 789.44,
      "end_time": 793.36,
      "text": "and the low, we're even below the 79% tradesmen level here."
    },
    {
      "start_time": 794.72,
      "end_time": 800.16,
      "text": "So in terms of really being suppressed, in terms of the total range, high to low,"
    },
    {
      "start_time": 800.88,
      "end_time": 805.76,
      "text": "we are at a deep discount in the middle of a current small little trading range from this high."
    },
    {
      "start_time": 806.24,
      "end_time": 814.0,
      "text": "To this low. So we're at equal distance price measurement of high, middle, low."
    },
    {
      "start_time": 815.68,
      "end_time": 821.04,
      "text": "In into total end or lower one third of the range of the parent price swing that we see here."
    },
    {
      "start_time": 822.24,
      "end_time": 828.48,
      "text": "Right in here, okay? Even if you didn't see this high to low as the parent price swing,"
    },
    {
      "start_time": 829.36,
      "end_time": 835.84,
      "text": "this price swing high to low still gives you the same context just in a smaller scale."
    },
    {
      "start_time": 836.72,
      "end_time": 845.2,
      "text": "So you have high to low, we're in a lower one third here and we're in deep discount."
    },
    {
      "start_time": 845.92,
      "end_time": 850.64,
      "text": "Here's equal distance or equilibrium. We're below it so we're at discount."
    },
    {
      "start_time": 851.52,
      "end_time": 856.16,
      "text": "So fair evaluation for the market makers to build a book long would be so many overlapping"
    },
    {
      "start_time": 856.16,
      "end_time": 861.68,
      "text": "factors there. They could be building long positions or accumulating long positions here,"
    },
    {
      "start_time": 862.32,
      "end_time": 866.64,
      "text": "looking for what liquidity above marketplace. That means where above these highs that initially"
    },
    {
      "start_time": 866.64,
      "end_time": 874.96,
      "text": "it just sold off of. Then you have the buy stops about here. So the market runs through that,"
    },
    {
      "start_time": 874.96,
      "end_time": 880.0,
      "text": "takes those stops, runs through this short term high here and then what does it do?"
    },
    {
      "start_time": 880.72,
      "end_time": 886.4,
      "text": "Goes into consolidation. Now if it's a turtle soup and it wants to go lower after blowing out"
    },
    {
      "start_time": 886.4,
      "end_time": 892.0,
      "text": "buy stops, it should go lower quickly. It doesn't do that. It's staying in a sideways consolidation."
    },
    {
      "start_time": 892.0,
      "end_time": 896.64,
      "text": "In fact, during this week, actually gave five sessions explaining how this market was"
    },
    {
      "start_time": 896.64,
      "end_time": 904.08,
      "text": "point to higher prices. It went back into consolidation, which means it's going back into what?"
    },
    {
      "start_time": 904.72,
      "end_time": 911.12,
      "text": "It's building equilibrium. Okay, so equilibrium is building again in that small little range."
    },
    {
      "start_time": 911.84,
      "end_time": 920.4,
      "text": "So you define the high and the low right there. Look how much price access spends around the"
    },
    {
      "start_time": 920.4,
      "end_time": 924.88,
      "text": "middle point at equilibrium price point. Okay, so it's hanging around fair value."
    },
    {
      "start_time": 926.0,
      "end_time": 932.64,
      "text": "Okay, one spike move lower doesn't see price go lower. It's any significant. It doesn't break the"
    },
    {
      "start_time": 932.64,
      "end_time": 940.64,
      "text": "range and it expands to the upside. Once it expands to the upside, it starts filling in all of this."
    },
    {
      "start_time": 941.44,
      "end_time": 948.48,
      "text": "Again, this is another area of fair value. The market's fair for those long positions for the"
    },
    {
      "start_time": 948.48,
      "end_time": 954.16,
      "text": "market maker that had already accumulated longs on. This is a good area, in this shaded area."
    },
    {
      "start_time": 954.88,
      "end_time": 957.52,
      "text": "Extend this out in the pond over here."
    },
    {
      "start_time": 962.48,
      "end_time": 967.36,
      "text": "All of this is a good place for them to sell the longs that they started accumulating down here."
    },
    {
      "start_time": 968.08,
      "end_time": 971.44,
      "text": "Look how much time they whip back and forth in that range, all these wicks."
    },
    {
      "start_time": 972.08,
      "end_time": 975.6,
      "text": "Okay, they're selling, they're selling, they're selling all the positions they've accumulated here,"
    },
    {
      "start_time": 975.6,
      "end_time": 978.96,
      "text": "accumulated here and down here on the initial run down into the support."
    },
    {
      "start_time": 980.64,
      "end_time": 985.84,
      "text": "Once this range is closed in, the next area of concern is above this short term high."
    },
    {
      "start_time": 986.48,
      "end_time": 987.44,
      "text": "Okay."
    },
    {
      "start_time": 992.4,
      "end_time": 997.2,
      "text": "So I have a void filled in right here. It's filled in. So this is no longer"
    },
    {
      "start_time": 997.2,
      "end_time": 1001.76,
      "text": "of area of interest, no, no more. Now we still look for higher prices. Why would we still look"
    },
    {
      "start_time": 1001.76,
      "end_time": 1007.6,
      "text": "for higher prices? Because they went long here. Okay, so if they're going to look to sell their"
    },
    {
      "start_time": 1007.6,
      "end_time": 1011.2,
      "text": "position, where would they look to sell their positions at? Discount prices are premium."
    },
    {
      "start_time": 1011.52,
      "end_time": 1018.72,
      "text": "Premium. But the premium price that speculators would trade at by buying and chasing price,"
    },
    {
      "start_time": 1019.28,
      "end_time": 1025.52,
      "text": "it's a premium to price chasers. People that feed off the desire of being in a price move,"
    },
    {
      "start_time": 1025.52,
      "end_time": 1033.28,
      "text": "it's already been moving higher. It's fair value to the market maker to liquidate their positions"
    },
    {
      "start_time": 1033.28,
      "end_time": 1040.16,
      "text": "at this small little pocket between this lows, this upcandles low and this upcandles high."
    },
    {
      "start_time": 1040.72,
      "end_time": 1049.76,
      "text": "So we can now create a new specific area of fair value for the market maker to liquidate"
    },
    {
      "start_time": 1049.76,
      "end_time": 1060.56,
      "text": "their long positions in here, right in here. To draw that out in time, that's what you see here,"
    },
    {
      "start_time": 1060.56,
      "end_time": 1066.16,
      "text": "price coming right into bottom of that candle, hit it perfectly to the pit, body to the candle,"
    },
    {
      "start_time": 1066.24,
      "end_time": 1071.84,
      "text": "or still deep inside the shaded area for fair valuation. What makes it fair is because they bought"
    },
    {
      "start_time": 1071.84,
      "end_time": 1077.92,
      "text": "it at a deep discount and they're liquidating at a premium. It's fair for them to accumulate here"
    },
    {
      "start_time": 1077.92,
      "end_time": 1083.6,
      "text": "and it's fair for them to liquidate. See, market makers have to deal in terms of valuation for"
    },
    {
      "start_time": 1083.6,
      "end_time": 1089.68,
      "text": "their longs and their shorts and they have to do that same valuation for their exits on both sides"
    },
    {
      "start_time": 1089.68,
      "end_time": 1095.2,
      "text": "of the marketplace. So when we see inefficiency and price like we see here with these candles,"
    },
    {
      "start_time": 1095.2,
      "end_time": 1100.4,
      "text": "just only going down, no up, moving in, only going down here, no up, moving in until later on,"
    },
    {
      "start_time": 1101.04,
      "end_time": 1104.72,
      "text": "all of this area, they're scaling out their positions that they accumulated down here, here,"
    },
    {
      "start_time": 1104.72,
      "end_time": 1115.84,
      "text": "and here. When price moves in defined trading ranges, there's going to be equilibrium. Equilibrium"
    },
    {
      "start_time": 1116.4,
      "end_time": 1120.88,
      "text": "is in itself fair value. That means the market makers are holding it in a consolidation."
    },
    {
      "start_time": 1121.84,
      "end_time": 1128.0,
      "text": "When that consolidation gives way, the strongest move out of that consolidation"
    },
    {
      "start_time": 1128.0,
      "end_time": 1133.68,
      "text": "on a long, on a hard time frame chart will give you a great deal of prognostication for directional"
    },
    {
      "start_time": 1133.68,
      "end_time": 1140.32,
      "text": "bias. So what I mean by that is if we look at price, let me take a look at it like this,"
    },
    {
      "start_time": 1140.4,
      "end_time": 1146.4,
      "text": "we can look at price like,"
    },
    {
      "start_time": 1154.4,
      "end_time": 1164.32,
      "text": "turn this high down to this low to have a range defined there. Okay, the markets in this range here"
    },
    {
      "start_time": 1164.32,
      "end_time": 1168.88,
      "text": "consolidate, it goes right back to equilibrium, hangs around equilibrium, dips down below the"
    },
    {
      "start_time": 1168.88,
      "end_time": 1175.2,
      "text": "equilibrium. So even if we're monitoring this range from this high to this low, we're below the"
    },
    {
      "start_time": 1175.2,
      "end_time": 1180.56,
      "text": "equilibrium price point. So are we at a premium right here, or are we at a discount, we're at a"
    },
    {
      "start_time": 1180.56,
      "end_time": 1186.32,
      "text": "discount. Traders on a retail level, they're going to see this as a selling point, they're going to"
    },
    {
      "start_time": 1186.32,
      "end_time": 1191.76,
      "text": "want to get short, because they're going to see this high to this low coming up to 62% in"
    },
    {
      "start_time": 1191.76,
      "end_time": 1195.12,
      "text": "a tradesman level. Now, remember I said in the last two sessions is not enough, this look,"
    },
    {
      "start_time": 1195.12,
      "end_time": 1198.56,
      "text": "simply looking at Pibidachi, you can get tripped up in Pibidachi if you don't understand what"
    },
    {
      "start_time": 1198.56,
      "end_time": 1202.24,
      "text": "price is actually telling you. So getting short here is not what you want to do, even though"
    },
    {
      "start_time": 1202.24,
      "end_time": 1207.28,
      "text": "you've seen price movement going lower, it's only coming down to an area of fair value for the"
    },
    {
      "start_time": 1207.28,
      "end_time": 1214.32,
      "text": "market makers to accumulate longs in an area of discount. So you're having an overlap of three things,"
    },
    {
      "start_time": 1214.32,
      "end_time": 1220.24,
      "text": "you're looking at total range from this high to this low or this high to this low, we're in a"
    },
    {
      "start_time": 1220.24,
      "end_time": 1226.16,
      "text": "lower portion or one third of the range. So we're in high probability for a discount market to be"
    },
    {
      "start_time": 1226.16,
      "end_time": 1234.72,
      "text": "in effect. You're also below the price point or equilibrium between the low to this high. So"
    },
    {
      "start_time": 1235.76,
      "end_time": 1240.96,
      "text": "it's consolidating here that, but it now went below it again. So we are in an area where the"
    },
    {
      "start_time": 1240.96,
      "end_time": 1246.48,
      "text": "market makers can buy, especially if you combine that with areas of institutional overflow. So if"
    },
    {
      "start_time": 1246.48,
      "end_time": 1251.12,
      "text": "you're looking to buy, what would you be looking for in the area to run out below the stops,"
    },
    {
      "start_time": 1251.12,
      "end_time": 1255.68,
      "text": "in other words, sell stops below and below, we don't see so much of that happening here, it doesn't"
    },
    {
      "start_time": 1255.68,
      "end_time": 1260.4,
      "text": "need to do that. It's only returning down to this down candle, which is a bullish order block, a"
    },
    {
      "start_time": 1260.4,
      "end_time": 1266.24,
      "text": "down candle before the market moves higher. That's where market support really relies, we're not"
    },
    {
      "start_time": 1266.24,
      "end_time": 1272.72,
      "text": "really relies resides in, okay, up candles for the market drops down, that up candle is exactly where"
    },
    {
      "start_time": 1272.72,
      "end_time": 1278.08,
      "text": "resistance is an institutional basis. So that's where selling occurs. So when we see price action"
    },
    {
      "start_time": 1278.08,
      "end_time": 1284.96,
      "text": "like this, we can define things in terms of fair value in relationship to how the market makers"
    },
    {
      "start_time": 1284.96,
      "end_time": 1291.52,
      "text": "are going to perceive price, the way they value price in terms of the current range that it's"
    },
    {
      "start_time": 1291.52,
      "end_time": 1296.88,
      "text": "trading in, the same way the Algo delivers price, where are we at in proximity to the current"
    },
    {
      "start_time": 1296.88,
      "end_time": 1303.36,
      "text": "total range. We have a nice impulsive price swing high to low here. We are in the lower portion"
    },
    {
      "start_time": 1303.36,
      "end_time": 1309.44,
      "text": "of that range here. We have built-ins by stops above this high, above this high here, above this high"
    },
    {
      "start_time": 1309.44,
      "end_time": 1315.84,
      "text": "here, and we have a valuation gap, okay, a fair value gap. Market's going to want to come back up"
    },
    {
      "start_time": 1315.84,
      "end_time": 1321.28,
      "text": "there because it's spent very little time in this area, it was all down movement, all down movement,"
    },
    {
      "start_time": 1322.08,
      "end_time": 1326.8,
      "text": "no buying was actually occurring in here, no buying was occurring in here, it was all on the"
    },
    {
      "start_time": 1326.8,
      "end_time": 1333.52,
      "text": "sell side, one way flows. So the market ran up into just the clothes in where only selling took place"
    },
    {
      "start_time": 1333.52,
      "end_time": 1339.84,
      "text": "in no real buyers. So now when price comes back up to that level and they shoot it up there like that,"
    },
    {
      "start_time": 1340.56,
      "end_time": 1345.2,
      "text": "that's going to make a run on stop the bulb is swing high and we're just going to close in the"
    },
    {
      "start_time": 1345.2,
      "end_time": 1351.52,
      "text": "range between this up candle and this up candle here, which is a fair value gap. So when we're"
    },
    {
      "start_time": 1351.52,
      "end_time": 1356.48,
      "text": "looking at price action, it's a couple things you need to keep in consideration. The total range"
    },
    {
      "start_time": 1356.48,
      "end_time": 1362.72,
      "text": "of trading in, the equilibrium price point relative to the most recent trading range high and low,"
    },
    {
      "start_time": 1362.72,
      "end_time": 1369.04,
      "text": "and we defined several. In here, we did this high to this low with this high and this low and this"
    },
    {
      "start_time": 1369.04,
      "end_time": 1376.0,
      "text": "high and this low. So we have multiple things lining up with the fact that for fair value sake,"
    },
    {
      "start_time": 1376.72,
      "end_time": 1382.4,
      "text": "the market has a deep discount here and it's most likely going to trade higher and we have reference"
    },
    {
      "start_time": 1382.4,
      "end_time": 1387.12,
      "text": "points that we can look for where the market makers should aim, but ultimately this is the fair value"
    },
    {
      "start_time": 1387.12,
      "end_time": 1392.72,
      "text": "gap that they wanted to get back up into and the reason why in the basis was of me calling 7665"
    },
    {
      "start_time": 1392.72,
      "end_time": 1397.68,
      "text": "for the week was I want to get just below where ultimately I think it's going to go and the"
    },
    {
      "start_time": 1397.68,
      "end_time": 1408.4,
      "text": "the low which if we look at the high, the low comes in at 7675 and I want to be about 10 pips or so"
    },
    {
      "start_time": 1408.4,
      "end_time": 1412.32,
      "text": "before the actual level I think is actually going to be hit. I want to be getting on this a little"
    },
    {
      "start_time": 1412.32,
      "end_time": 1418.24,
      "text": "bit before that and one more instance of the things I've talked about before it happens in the"
    },
    {
      "start_time": 1418.24,
      "end_time": 1424.24,
      "text": "charge and why those things actually materialized in price action. So price returns back to fair"
    },
    {
      "start_time": 1424.96,
      "end_time": 1430.24,
      "text": "fair value in the perspective of the market maker not fair value in the scope of buying this is"
    },
    {
      "start_time": 1430.24,
      "end_time": 1436.88,
      "text": "added premium. Okay, remember that market efficiency paradigm I started you all with how you"
    },
    {
      "start_time": 1436.88,
      "end_time": 1441.28,
      "text": "perceive the marketplace is not how retail is going to see the price. They're going to see this as"
    },
    {
      "start_time": 1442.16,
      "end_time": 1447.12,
      "text": "the market's going to probably keep going up because it's been going up. Well, this is an area"
    },
    {
      "start_time": 1447.12,
      "end_time": 1453.12,
      "text": "distribution. You want to be thinking accumulation down here, re-accumulation, distribution,"
    },
    {
      "start_time": 1454.08,
      "end_time": 1458.72,
      "text": "scaling out all through these areas in here because you don't know if it's only going to come up"
    },
    {
      "start_time": 1458.72,
      "end_time": 1463.2,
      "text": "a little bit of that range or here in the shaded liquidity boy, you don't know if it's going to"
    },
    {
      "start_time": 1463.2,
      "end_time": 1468.32,
      "text": "fill in that and then go lower. So when you buy things down in here as deep discount, you have to"
    },
    {
      "start_time": 1468.32,
      "end_time": 1476.48,
      "text": "scale some of it out. But the beginning basis points of valuation in terms of the market makers,"
    },
    {
      "start_time": 1476.48,
      "end_time": 1481.44,
      "text": "you have to look at the total range, look at where the market has moved away from quickly. And those"
    },
    {
      "start_time": 1481.44,
      "end_time": 1492.4,
      "text": "areas of liquidity voids and liquidity pulls above old highs here and here and here. That is going"
    },
    {
      "start_time": 1492.4,
      "end_time": 1498.0,
      "text": "to be fair value for the market maker to distribute long positions. If we were looking at a cell"
    },
    {
      "start_time": 1498.0,
      "end_time": 1503.52,
      "text": "position or a short position, we would be looking for areas in which the market in the past has"
    },
    {
      "start_time": 1503.52,
      "end_time": 1510.0,
      "text": "moved up a great deal with speed. And we would be looking for lows where stops would be building up"
    },
    {
      "start_time": 1510.0,
      "end_time": 1517.6,
      "text": "below it or liquidity pulls in the form of cell stops. We would look for the lower end of the"
    },
    {
      "start_time": 1517.6,
      "end_time": 1524.72,
      "text": "most recent range for valuation. So that way, you would know by looking at things with that market"
    },
    {
      "start_time": 1524.72,
      "end_time": 1529.92,
      "text": "efficiency paradigm, you're not looking at things like retail, you're looking at it in the scope of,"
    },
    {
      "start_time": 1529.92,
      "end_time": 1535.84,
      "text": "okay, I am a bank. I'm making a book here. Where is the most efficient price levels for me to"
    },
    {
      "start_time": 1535.84,
      "end_time": 1542.88,
      "text": "unload my longs or unload my short positions? We've already mentioned it so far in the"
    },
    {
      "start_time": 1543.76,
      "end_time": 1549.28,
      "text": "teachings just for September. The easiest way to understand institutional overflow from the beginning"
    },
    {
      "start_time": 1549.28,
      "end_time": 1555.2,
      "text": "starting point of all is understanding that markets move from buy stops and cell stops and"
    },
    {
      "start_time": 1555.2,
      "end_time": 1562.56,
      "text": "cell stops to buy stops and it moves from fair value to discount to discount to premium to premium"
    },
    {
      "start_time": 1562.56,
      "end_time": 1567.44,
      "text": "to fair value. And it moves back and forth between these three reference points. Are we at a"
    },
    {
      "start_time": 1567.44,
      "end_time": 1574.32,
      "text": "discount? Are we at a premium? Are we at fair value? All those things combined together, they give you"
    },
    {
      "start_time": 1574.32,
      "end_time": 1579.28,
      "text": "the clues as to what we're seeing in terms of the market maker's accent or the accumulating"
    },
    {
      "start_time": 1580.0,
      "end_time": 1585.2,
      "text": "or the manipulating or the distributing. All those factors, we're going to be bringing those"
    },
    {
      "start_time": 1585.2,
      "end_time": 1593.52,
      "text": "closely knit ideas into a more easily understood premise. When we look at price, we'll be able to see"
    },
    {
      "start_time": 1593.52,
      "end_time": 1598.8,
      "text": "these things unfolding in in advance and you'll be able to see what should take place and it's a very"
    },
    {
      "start_time": 1598.8,
      "end_time": 1604.16,
      "text": "encouraging to see your study in these individual components start to flesh out and have a greater"
    },
    {
      "start_time": 1604.16,
      "end_time": 1613.36,
      "text": "understanding about price action. So, including fair value is not fair value in the realm of retail."
    },
    {
      "start_time": 1614.48,
      "end_time": 1621.28,
      "text": "It's in the realm of fair value of liquidating or accumulating from the market maker's perspective."
    },
    {
      "start_time": 1622.4,
      "end_time": 1630.16,
      "text": "Fair value in discount is fair value for buys for market maker buying. Fair value in premium is"
    },
    {
      "start_time": 1630.16,
      "end_time": 1636.24,
      "text": "fair value for market maker selling either establishing new shorts or exiting on scaling out long"
    },
    {
      "start_time": 1636.24,
      "end_time": 1646.0,
      "text": "positions. Discount below equilibrium in the low ends of the range that's a discount market,"
    },
    {
      "start_time": 1646.0,
      "end_time": 1650.16,
      "text": "that's an area at which the market makers can buy or look to cover their short positions."
    },
    {
      "start_time": 1651.76,
      "end_time": 1657.76,
      "text": "Do not look at the marketplace in this retail mindset that we're all trained to do. We have the same"
    },
    {
      "start_time": 1658.72,
      "end_time": 1666.0,
      "text": "well we drink from. It's the same regurgitated stuff, but it's wrong. To understand how these markets are"
    },
    {
      "start_time": 1666.0,
      "end_time": 1671.76,
      "text": "delivered to us in the form of price action, when this price is delivered to us, it's not random."
    },
    {
      "start_time": 1672.32,
      "end_time": 1677.6,
      "text": "It's very specific of where it wants to go, why it wants to get there, that's what we're giving you in this"
    },
    {
      "start_time": 1678.16,
      "end_time": 1684.32,
      "text": "mentorship. It's very specific detailed perspectives that are generic, they repeat themselves"
    },
    {
      "start_time": 1684.32,
      "end_time": 1689.2,
      "text": "or never again, and because they repeat themselves, because they're the same phenomenon, take place"
    },
    {
      "start_time": 1689.2,
      "end_time": 1695.04,
      "text": "almost on a daily basis, there's nothing for you to fear if you mess it up and you don't get to"
    },
    {
      "start_time": 1695.04,
      "end_time": 1700.4,
      "text": "trade to pan out right or if you miss a move, do not worry about it. Wait for the market to give you"
    },
    {
      "start_time": 1700.4,
      "end_time": 1707.12,
      "text": "indications of where fair valuation is. Then you'll be able to anticipate the market maker's next"
    },
    {
      "start_time": 1707.12,
      "end_time": 1711.84,
      "text": "scale in or scale out. It may be the liquidation of a long position that's been on their way."
    },
    {
      "start_time": 1712.64,
      "end_time": 1719.12,
      "text": "That may give you prognostication for a future move. It may be the inception of a new"
    },
    {
      "start_time": 1719.12,
      "end_time": 1724.88,
      "text": "price leg while you're waiting for this area to be retreated to. We'll build on this idea for now,"
    },
    {
      "start_time": 1724.88,
      "end_time": 1729.12,
      "text": "but I want you to think in terms of where we at relative to the most current range."
    },
    {
      "start_time": 1729.84,
      "end_time": 1736.08,
      "text": "Are we in the lower end? Are we near the low of that current range? Are we working around an"
    },
    {
      "start_time": 1736.08,
      "end_time": 1742.32,
      "text": "equal distance equilibrium price point between a recent high and low by defining price in current"
    },
    {
      "start_time": 1742.32,
      "end_time": 1747.52,
      "text": "trading ranges like this? You'll be able to see where the market makers will expand the price."
    },
    {
      "start_time": 1748.16,
      "end_time": 1753.84,
      "text": "So there's expansion. You know prior to that expansion, there's been what? It's consolidation."
    },
    {
      "start_time": 1753.84,
      "end_time": 1759.12,
      "text": "So as you study more examples of when markets are in consolidation, you'll be able to"
    },
    {
      "start_time": 1759.52,
      "end_time": 1767.12,
      "text": "forecast the next movement out of the consolidation. We don't play the breakout game. We anticipate the"
    },
    {
      "start_time": 1767.12,
      "end_time": 1772.64,
      "text": "breakout. We know that the indications through price action will give us clues as to what side of"
    },
    {
      "start_time": 1772.64,
      "end_time": 1777.6,
      "text": "the marketplace is going to break out. And when we get into commodities, we'll have actually"
    },
    {
      "start_time": 1777.6,
      "end_time": 1783.12,
      "text": "a great advantage of that using open interest, but for forex, you don't need it so much. You can still"
    },
    {
      "start_time": 1783.12,
      "end_time": 1789.44,
      "text": "see it in institutional workflow. So I'm going to close this teaching here with the promise that"
    },
    {
      "start_time": 1789.44,
      "end_time": 1797.76,
      "text": "we're going to come back at the end of this series of eight sessions in your notes that will accompany your"
    },
    {
      "start_time": 1798.96,
      "end_time": 1806.96,
      "text": "months summary. You'll have great detail of specific notes and things that you need to be"
    },
    {
      "start_time": 1807.68,
      "end_time": 1813.84,
      "text": "aware of as it relates to fair evaluation, liquidity pools, voids, liquidity gaps, all those things."
    },
    {
      "start_time": 1813.84,
      "end_time": 1817.68,
      "text": "We'll be building more foundation on that. And in a month, two, actually,"
    },
    {
      "start_time": 1817.68,
      "end_time": 1824.4,
      "text": "given to how to find these things, not just giving you one chart's perspective and basically,"
    },
    {
      "start_time": 1824.4,
      "end_time": 1828.4,
      "text": "you know, trying to teach the whole thing in one chart. It can't be done. So you need the"
    },
    {
      "start_time": 1828.4,
      "end_time": 1834.08,
      "text": "examples of it. You need to see it called for in advance, like we did this week, not so much"
    },
    {
      "start_time": 1834.64,
      "end_time": 1841.2,
      "text": "wine into this great detail, but I gave you the areas of which price should reach for"
    },
    {
      "start_time": 1842.32,
      "end_time": 1846.88,
      "text": "and we talked about the area here. We talked about this void here. And obviously, we don't even need"
    },
    {
      "start_time": 1846.88,
      "end_time": 1850.48,
      "text": "to talk about the highs because we understand that that's where the buy starts going to reside. So"
    },
    {
      "start_time": 1852.08,
      "end_time": 1858.08,
      "text": "think in terms of fair value for the market maker. If they're going to go higher, where's it"
    },
    {
      "start_time": 1858.16,
      "end_time": 1864.48,
      "text": "fair value for them to exit their loans? Okay, it's a fair value for them to do so. They do not want"
    },
    {
      "start_time": 1864.48,
      "end_time": 1870.0,
      "text": "to liquidate their loans at a discount or one retracement's going lower. You look for expansions"
    },
    {
      "start_time": 1870.0,
      "end_time": 1875.6,
      "text": "on the upside. When they expand, when price expands, they should be reaching into an area fair value"
    },
    {
      "start_time": 1875.6,
      "end_time": 1882.4,
      "text": "for price to be liquidating smart money loans. That's the only reason why markets go up. That's"
    },
    {
      "start_time": 1882.4,
      "end_time": 1887.84,
      "text": "the only reason why prices allow to be delivered at higher prices because the market makers, the banks"
    },
    {
      "start_time": 1887.84,
      "end_time": 1893.68,
      "text": "have books on when they're books that are net long and it's in their interest to see price higher."
    },
    {
      "start_time": 1894.32,
      "end_time": 1899.92,
      "text": "It doesn't matter how many of us buy, the price is going to be set by the bank and they're going to"
    },
    {
      "start_time": 1899.92,
      "end_time": 1906.96,
      "text": "do things to line their own pockets and not yours. So it takes a perspective shift and it gets back"
    },
    {
      "start_time": 1906.96,
      "end_time": 1911.92,
      "text": "to that market efficiency paradigm I started you with in this mentorship that you have to view things"
    },
    {
      "start_time": 1911.92,
      "end_time": 1918.8,
      "text": "from a smart money perspective, not what retail should be doing or what retail is doing. If you do"
    },
    {
      "start_time": 1918.8,
      "end_time": 1923.6,
      "text": "that, you're going to you're going to miss the actual clarity that comes through looking at price"
    },
    {
      "start_time": 1923.6,
      "end_time": 1930.08,
      "text": "action, studying it through a contrary and perspective, saying okay, this is what the retail"
    },
    {
      "start_time": 1930.08,
      "end_time": 1937.04,
      "text": "minds should be thinking now and by contrasting that with what you see in the charts for fair value,"
    },
    {
      "start_time": 1937.12,
      "end_time": 1942.16,
      "text": "liquidity gaps, liquidity voids, liquidity pools, all these things, the market is going to seek"
    },
    {
      "start_time": 1942.16,
      "end_time": 1948.8,
      "text": "that liquidity and run against the less informed crowd's opinion. So with that I'm going to close and"
    },
    {
      "start_time": 1948.8,
      "end_time": 1953.6,
      "text": "wish you good luck and good trading."
    }
  ],
  "word_count": 5195,
  "segment_count": 301,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:54:21.614429",
  "title": "ICT Mentorship Core Content - Month 1 - Fair Valuation"
}