{
  "video_id": "v6ATva5DF0I",
  "full_text": "Welcome back folks, this is the second of a series of 20 videos making up the ICT optimal trade entry pattern recognition series. And we're looking at the Japanese yen today or specifically dollar yen. Alright so this is our daily chart and I want you to take a look at this chart and consider what may be unfolding why we're getting reactions or why we would expect to see our reaction. Alright so we're going to take our fit from this low to this high. This is a swing low swing high. And we get to our reaction price points. Low to high. Okay and all we'll do is continue this out in time and you'll see how price of entry trades into the optimal trade entry for the daily time frame. Alright so if price were lower than this on this swing we would use this low drug from here up to here but you want to work with what range you have available. So in the yen on the daily we know that we entered into or below the 60% or 80% level three days ago and yesterday or Thursday's trading we pierced the previous days high or Wednesday's high. Look at the high. Here's right here look at this number here. Wednesday's high comes in at 106.629 Thursday's trading goes to 106.657 so we went above Wednesday's high. We could potentially be seeing a turn or an expansion on the upside. It's already shown a willingness to go higher than the previous days range. So now we're going to look at Thursday's high which is 106.657 pipettes. Okay so that's our level and we're going to drop down into a five minute chart. Alright so here's our dollar yen five minute chart. And we'll give you a moment to take a look at this pause the video and study what you think you see here and when you're ready just unpause the video and wants the explanation for the pattern recognition exam for today. Okay so here's what we're going to do. We're going to take a look at the annotations for today. Here is the previous days range and the previous days range is defined from here to here. So we're expecting a run above the previous days high. So here's previous days high at that 106.657 level and we're looking for a reason to get long to target this high. And we can see from the previous days range we have this low up to this high and then all the way over to our New York session time from 830 AM New York time to 11 AM New York time. You can see the vertical lines that's outlined yesterday. We'll take these off to keep things clean. You can see how price drops down into it here and we're going to assume that 106.314 is at 62% of the duration level so we're going to just round it to the nearest 5-pip that. So 106.315 would be our entry below the low our stop will be at 106.215 so it's a 10-pip stop optimal trade entry. Old high that makes the range of the fib comes in at 15 pips so it meets our minimum criteria for the first scaling so you could take profits there. Second scaling for around 25 pips here and we're still below previous days high. The next level at the fib which is a 10 level is nice because it's above the previous days high and it's a 10 level so we could take a third scaling out there for around approximately 40 pips. Additionally you can see this swing here from this low to this high being 1 2 3 for another optimal trade entry because you can see the low comes in just at a 10.55 so it's five minutes before the end of our New York session for limited of time and you can see we run this old high here so from here to here as another opportunity you can study it on your own and it'll take your chart and you can see where we closed for the day. Hope you found this insightful until next time I wish you good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 18.56,
      "text": "Welcome back folks, this is the second of a series of 20 videos making up the ICT optimal"
    },
    {
      "start_time": 18.56,
      "end_time": 21.76,
      "text": "trade entry pattern recognition series."
    },
    {
      "start_time": 21.76,
      "end_time": 26.64,
      "text": "And we're looking at the Japanese yen today or specifically dollar yen."
    },
    {
      "start_time": 27.28,
      "end_time": 32.48,
      "text": "Alright so this is our daily chart and I want you to take a look at this chart and consider"
    },
    {
      "start_time": 33.2,
      "end_time": 39.76,
      "text": "what may be unfolding why we're getting reactions or why we would expect to see our reaction."
    },
    {
      "start_time": 41.84,
      "end_time": 46.24,
      "text": "Alright so we're going to take our fit from this low to this high."
    },
    {
      "start_time": 47.04,
      "end_time": 49.6,
      "text": "This is a swing low swing high."
    },
    {
      "start_time": 49.6,
      "end_time": 53.12,
      "text": "And we get to our reaction price points."
    },
    {
      "start_time": 56.32,
      "end_time": 59.84,
      "text": "Low to high."
    },
    {
      "start_time": 61.76,
      "end_time": 69.84,
      "text": "Okay and all we'll do is continue this out in time and you'll see how price"
    },
    {
      "start_time": 69.84,
      "end_time": 76.8,
      "text": "of entry trades into the optimal trade entry for the daily time frame."
    },
    {
      "start_time": 79.04,
      "end_time": 87.76,
      "text": "Alright so if price were lower than this on this swing we would use this low drug from here"
    },
    {
      "start_time": 88.48,
      "end_time": 92.4,
      "text": "up to here but you want to work with what range you have available."
    },
    {
      "start_time": 93.04,
      "end_time": 99.52,
      "text": "So in the yen on the daily we know that we entered into or below the 60% or 80% level"
    },
    {
      "start_time": 100.8,
      "end_time": 108.16,
      "text": "three days ago and yesterday or Thursday's trading we pierced the previous days high or Wednesday's"
    },
    {
      "start_time": 108.16,
      "end_time": 116.72,
      "text": "high. Look at the high. Here's right here look at this number here. Wednesday's high comes in at"
    },
    {
      "start_time": 116.72,
      "end_time": 127.2,
      "text": "106.629 Thursday's trading goes to 106.657 so we went above Wednesday's high."
    },
    {
      "start_time": 127.68,
      "end_time": 133.12,
      "text": "We could potentially be seeing a turn or an expansion on the upside."
    },
    {
      "start_time": 133.12,
      "end_time": 138.08,
      "text": "It's already shown a willingness to go higher than the previous days range."
    },
    {
      "start_time": 138.08,
      "end_time": 146.24,
      "text": "So now we're going to look at Thursday's high which is 106.657 pipettes."
    },
    {
      "start_time": 146.24,
      "end_time": 151.04,
      "text": "Okay so that's our level and we're going to drop down into a five minute chart."
    },
    {
      "start_time": 151.04,
      "end_time": 153.6,
      "text": "Alright so here's our dollar yen five minute chart."
    },
    {
      "start_time": 154.4,
      "end_time": 160.0,
      "text": "And we'll give you a moment to take a look at this pause the video and study what you think you see"
    },
    {
      "start_time": 160.0,
      "end_time": 167.68,
      "text": "here and when you're ready just unpause the video and wants the explanation for the pattern"
    },
    {
      "start_time": 167.68,
      "end_time": 174.72,
      "text": "recognition exam for today. Okay so here's what we're going to do. We're going to take a look at"
    },
    {
      "start_time": 175.6,
      "end_time": 186.48,
      "text": "the annotations for today. Here is the previous days range and the previous days range is defined"
    },
    {
      "start_time": 186.48,
      "end_time": 196.48,
      "text": "from here to here. So we're expecting a run above the previous days high. So here's previous days high"
    },
    {
      "start_time": 196.56,
      "end_time": 207.92,
      "text": "at that 106.657 level and we're looking for a reason to get long to target this high."
    },
    {
      "start_time": 210.8,
      "end_time": 217.28,
      "text": "And we can see from the previous days range we have this low up to this high"
    },
    {
      "start_time": 217.36,
      "end_time": 228.48,
      "text": "and then all the way over to our New York session time from 830 AM New York time to 11 AM New York time."
    },
    {
      "start_time": 229.92,
      "end_time": 235.68,
      "text": "You can see the vertical lines that's outlined yesterday. We'll take these off to keep things"
    },
    {
      "start_time": 235.68,
      "end_time": 245.36,
      "text": "clean. You can see how price drops down into it here and we're going to assume that 106.314"
    },
    {
      "start_time": 246.08,
      "end_time": 249.84,
      "text": "is at 62% of the duration level so we're going to just round it to the nearest 5-pip that. So"
    },
    {
      "start_time": 250.32,
      "end_time": 260.16,
      "text": "106.315 would be our entry below the low our stop will be at 106.215 so it's a 10-pip stop"
    },
    {
      "start_time": 261.28,
      "end_time": 270.64,
      "text": "optimal trade entry. Old high that makes the range of the fib comes in at 15 pips so it meets our"
    },
    {
      "start_time": 270.64,
      "end_time": 276.8,
      "text": "minimum criteria for the first scaling so you could take profits there. Second scaling for around"
    },
    {
      "start_time": 276.8,
      "end_time": 284.24,
      "text": "25 pips here and we're still below previous days high. The next level at the fib which is a 10 level"
    },
    {
      "start_time": 285.28,
      "end_time": 290.08,
      "text": "is nice because it's above the previous days high and it's a 10 level so we could take a third"
    },
    {
      "start_time": 290.08,
      "end_time": 295.68,
      "text": "scaling out there for around approximately 40 pips. Additionally you can see this swing here"
    },
    {
      "start_time": 295.68,
      "end_time": 303.84,
      "text": "from this low to this high being 1 2 3 for another optimal trade entry because you can see the low"
    },
    {
      "start_time": 303.84,
      "end_time": 311.92,
      "text": "comes in just at a 10.55 so it's five minutes before the end of our New York session for limited"
    },
    {
      "start_time": 311.92,
      "end_time": 320.88,
      "text": "of time and you can see we run this old high here so from here to here as another opportunity you"
    },
    {
      "start_time": 320.88,
      "end_time": 325.6,
      "text": "can study it on your own and it'll take your chart and you can see where we closed for the day."
    },
    {
      "start_time": 326.16,
      "end_time": 329.6,
      "text": "Hope you found this insightful until next time I wish you good luck and good trading."
    }
  ],
  "word_count": 712,
  "segment_count": 44,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:27:01.725672",
  "title": "OTE Pattern Recognition Series - Vol. 02"
}