{
  "video_id": "Vx25X2sbxPA",
  "full_text": "Okay folks, this is the volume number six in a continuing series of 20 videos from the NSCC trader's optimal trade entry pattern recognition series. Yes, that's a mouthful. So looking at the daily chart of crude oil, I'm going to take a step outside of 4x again and look at a commodity market. This is a widely traded asset. And if you look at what we have here on the daily chart, I'm going to pose a question to you. And I want you to think about what would be the most likely directional run above this candle's high or below this candle's low based on what you see here. This pattern here is pretty popular in the retail universe. They like to see these doji candles or pin bars. And they naturally assume that that's going to create a top in the marketplace and then it should go lower. I love trading against this pattern here. So one of the things if you are a collector of ICT bullet point wisdom, if you look at the doji's or pin bars, I'd like to see those purged. I'd like to see them run above that. If you look at what has happened so far, I mean, we've been running up correcting since it crashed in terms of the oil market. And if you look at this candle, which is yesterday's daily range, is it more likely to break below and trade lower or trade higher? My argument would be it would likely run this candle's high, not just this candle's high, but this candle's high because there's a lot of sentiment built into the crude oil market based on this pseudo pin bar or doji or whatever they want to classify. Steve Nielsen's patterns, I'm not here to try to kick dirt in his face, but this simply isn't enough to warrant a financial decision based on some willy-nilly pattern in a candlestick formation. Okay, so there has to be an underlying narrative and the narrative is everyone's bearish crude oil right now. So any retail idea that would paint the sentiment as bearish or maybe it's likely to go lower, they're just going to move on that. So it's not just limited to running this candle's high and the high comes in at 26.45. So that's a near term objective, but we're really interested in seeing the high on this candle here at 26.74. Okay, so 26.74, very, very likely scenario to make a run to that. It doesn't mean to very next day or the 14th, which is the time of this recording, that we would run through this high. It would just be a draw in liquidity. Okay, in other words, it means of determining bias. Okay, I get a lot of questions from people that are in my mentorship just starting out or outside the mentorship. They always ask me an email, can you teach me how to determine the bias? Because if I could learn how to do the bias, I could trade profitably. And I would argue that's probably not true because you have placed so much emphasis on whether or not you can be right or wrong on a daily bias, the assumption will be led to you trying to day trade every single day. And while you may be profitable a few times a week, there's a few times that you aren't, you'll go into revenge mode and you'll just parlay your losses into larger losses. All right, here is our five-minute chart on the Crudele Jun Delivery Contract for 2020. And we're going to put a little bit of lipstick on this. And we have the previous days high here, the daily donations. So this is the 14th of the day of this recording. You can see that we did run previous days high here, but it was done in a very shallow capacity. So we're likely to see if we get a retracement down into New York session, which you can start to see the beginning of the annotation of my chart here. I do want to put on the 26th, 74 level. And we'll just make that a black level, just to delineate what I'm referring to. All right, so again, back on this chart here, this pin bar, if you want to call it that, retail idea is 26, 74 for the high. And that's the level I have here, 26, 74. We trade up into 26, 75. So we went one point into that and then we rejected that liquidity would rest above here. And it likely run a deeper run above the previous days high. So that's what we're looking for. But the black line is specifically related to that daily pin bar or doge candle that would be deemed bearish from the retail level trader. All right. And let's take our fib and add it to the New York session. All right. So there's our fib and the low here to the high here, it retraces down into optimal trade entry, 62% trace level. We're going to use as our entry 25.90 would be our entry and the stat would have to be below below here. So we'll use 68. So 68 and 90. That's 32 points or about 320 dollars per contract risk. And we will be reaching for previous days high initially. It does that here. And then we'll be looking for one standard deviation up to 26.75. And if we get to 27.28, we would completely collapse the trade and being okay with taking that as our daily objective. And we can see here as the market runs forward. We do get our second standard deviation and we would be out there. Does run a little bit more, but I'm not teaching you swing trading. I'm not teaching you short term trading. I'm teaching you a bread and butter approach to going into looking for daily setups using specific criteria. Aiming for previous days highs or lows and using the New York session as your catalyst to do so. Hopefully you found this insightful. Until next time, I wish you good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 16.34,
      "text": "Okay folks, this is the volume number six in a continuing series of 20 videos from the"
    },
    {
      "start_time": 16.34,
      "end_time": 19.94,
      "text": "NSCC trader's optimal trade entry pattern recognition series."
    },
    {
      "start_time": 19.94,
      "end_time": 21.7,
      "text": "Yes, that's a mouthful."
    },
    {
      "start_time": 21.7,
      "end_time": 27.26,
      "text": "So looking at the daily chart of crude oil, I'm going to take a step outside of 4x again"
    },
    {
      "start_time": 27.26,
      "end_time": 29.06,
      "text": "and look at a commodity market."
    },
    {
      "start_time": 29.06,
      "end_time": 32.24,
      "text": "This is a widely traded asset."
    },
    {
      "start_time": 32.24,
      "end_time": 36.46,
      "text": "And if you look at what we have here on the daily chart, I'm going to pose a question"
    },
    {
      "start_time": 36.46,
      "end_time": 37.46,
      "text": "to you."
    },
    {
      "start_time": 37.46,
      "end_time": 44.1,
      "text": "And I want you to think about what would be the most likely directional run above this"
    },
    {
      "start_time": 44.1,
      "end_time": 52.2,
      "text": "candle's high or below this candle's low based on what you see here."
    },
    {
      "start_time": 52.2,
      "end_time": 55.5,
      "text": "This pattern here is pretty popular in the retail universe."
    },
    {
      "start_time": 55.5,
      "end_time": 60.62,
      "text": "They like to see these doji candles or pin bars."
    },
    {
      "start_time": 60.62,
      "end_time": 64.46,
      "text": "And they naturally assume that that's going to create a top in the marketplace and then"
    },
    {
      "start_time": 64.46,
      "end_time": 66.26,
      "text": "it should go lower."
    },
    {
      "start_time": 66.26,
      "end_time": 69.22,
      "text": "I love trading against this pattern here."
    },
    {
      "start_time": 69.22,
      "end_time": 75.38,
      "text": "So one of the things if you are a collector of ICT bullet point wisdom, if you look"
    },
    {
      "start_time": 75.38,
      "end_time": 80.98,
      "text": "at the doji's or pin bars, I'd like to see those purged."
    },
    {
      "start_time": 80.98,
      "end_time": 83.46,
      "text": "I'd like to see them run above that."
    },
    {
      "start_time": 84.34,
      "end_time": 88.3,
      "text": "If you look at what has happened so far, I mean, we've been running up correcting since"
    },
    {
      "start_time": 88.3,
      "end_time": 91.5,
      "text": "it crashed in terms of the oil market."
    },
    {
      "start_time": 91.5,
      "end_time": 97.78,
      "text": "And if you look at this candle, which is yesterday's daily range, is it more likely to break"
    },
    {
      "start_time": 97.78,
      "end_time": 100.9,
      "text": "below and trade lower or trade higher?"
    },
    {
      "start_time": 100.9,
      "end_time": 108.66,
      "text": "My argument would be it would likely run this candle's high, not just this candle's high,"
    },
    {
      "start_time": 108.66,
      "end_time": 112.66,
      "text": "but this candle's high because there's a lot of sentiment built into the crude oil market"
    },
    {
      "start_time": 112.66,
      "end_time": 119.06,
      "text": "based on this pseudo pin bar or doji or whatever they want to classify."
    },
    {
      "start_time": 119.06,
      "end_time": 123.86,
      "text": "Steve Nielsen's patterns, I'm not here to try to kick dirt in his face, but this simply"
    },
    {
      "start_time": 123.86,
      "end_time": 131.22,
      "text": "isn't enough to warrant a financial decision based on some willy-nilly pattern in a"
    },
    {
      "start_time": 131.22,
      "end_time": 132.7,
      "text": "candlestick formation."
    },
    {
      "start_time": 132.7,
      "end_time": 137.02,
      "text": "Okay, so there has to be an underlying narrative and the narrative is everyone's bearish crude"
    },
    {
      "start_time": 137.02,
      "end_time": 138.02,
      "text": "oil right now."
    },
    {
      "start_time": 138.02,
      "end_time": 145.02,
      "text": "So any retail idea that would paint the sentiment as bearish or maybe it's likely to go lower,"
    },
    {
      "start_time": 145.02,
      "end_time": 146.46,
      "text": "they're just going to move on that."
    },
    {
      "start_time": 146.46,
      "end_time": 153.62,
      "text": "So it's not just limited to running this candle's high and the high comes in at 26.45."
    },
    {
      "start_time": 153.62,
      "end_time": 158.02,
      "text": "So that's a near term objective, but we're really interested in seeing the high on this"
    },
    {
      "start_time": 158.02,
      "end_time": 160.62,
      "text": "candle here at 26.74."
    },
    {
      "start_time": 160.62,
      "end_time": 166.46,
      "text": "Okay, so 26.74, very, very likely scenario to make a run to that."
    },
    {
      "start_time": 166.46,
      "end_time": 170.54,
      "text": "It doesn't mean to very next day or the 14th, which is the time of this recording, that"
    },
    {
      "start_time": 170.54,
      "end_time": 172.06,
      "text": "we would run through this high."
    },
    {
      "start_time": 172.06,
      "end_time": 174.06,
      "text": "It would just be a draw in liquidity."
    },
    {
      "start_time": 174.06,
      "end_time": 178.26,
      "text": "Okay, in other words, it means of determining bias."
    },
    {
      "start_time": 178.26,
      "end_time": 182.86,
      "text": "Okay, I get a lot of questions from people that are in my mentorship just starting out"
    },
    {
      "start_time": 182.86,
      "end_time": 184.58,
      "text": "or outside the mentorship."
    },
    {
      "start_time": 184.58,
      "end_time": 189.66,
      "text": "They always ask me an email, can you teach me how to determine the bias?"
    },
    {
      "start_time": 189.66,
      "end_time": 193.46,
      "text": "Because if I could learn how to do the bias, I could trade profitably."
    },
    {
      "start_time": 193.46,
      "end_time": 199.94,
      "text": "And I would argue that's probably not true because you have placed so much emphasis on"
    },
    {
      "start_time": 199.94,
      "end_time": 205.1,
      "text": "whether or not you can be right or wrong on a daily bias, the assumption will be led to"
    },
    {
      "start_time": 205.1,
      "end_time": 207.42,
      "text": "you trying to day trade every single day."
    },
    {
      "start_time": 207.42,
      "end_time": 212.42,
      "text": "And while you may be profitable a few times a week, there's a few times that you aren't,"
    },
    {
      "start_time": 212.42,
      "end_time": 216.82,
      "text": "you'll go into revenge mode and you'll just parlay your losses into larger losses."
    },
    {
      "start_time": 216.82,
      "end_time": 222.94,
      "text": "All right, here is our five-minute chart on the Crudele Jun Delivery Contract for 2020."
    },
    {
      "start_time": 223.74,
      "end_time": 227.18,
      "text": "And we're going to put a little bit of lipstick on this."
    },
    {
      "start_time": 227.18,
      "end_time": 232.02,
      "text": "And we have the previous days high here, the daily donations."
    },
    {
      "start_time": 232.02,
      "end_time": 234.78,
      "text": "So this is the 14th of the day of this recording."
    },
    {
      "start_time": 234.78,
      "end_time": 239.58,
      "text": "You can see that we did run previous days high here, but it was done in a very shallow capacity."
    },
    {
      "start_time": 239.58,
      "end_time": 243.78,
      "text": "So we're likely to see if we get a retracement down into New York session,"
    },
    {
      "start_time": 243.78,
      "end_time": 247.5,
      "text": "which you can start to see the beginning of the annotation of my chart here."
    },
    {
      "start_time": 247.5,
      "end_time": 259.06,
      "text": "I do want to put on the 26th, 74 level."
    },
    {
      "start_time": 263.06,
      "end_time": 269.58,
      "text": "And we'll just make that a black level, just to delineate what I'm referring to."
    },
    {
      "start_time": 271.86,
      "end_time": 274.62,
      "text": "All right, so again, back on this chart here,"
    },
    {
      "start_time": 275.42,
      "end_time": 282.94,
      "text": "this pin bar, if you want to call it that, retail idea is 26, 74 for the high."
    },
    {
      "start_time": 283.82,
      "end_time": 286.54,
      "text": "And that's the level I have here, 26, 74."
    },
    {
      "start_time": 287.98,
      "end_time": 292.54,
      "text": "We trade up into 26, 75."
    },
    {
      "start_time": 292.54,
      "end_time": 299.66,
      "text": "So we went one point into that and then we rejected that liquidity would rest above here."
    },
    {
      "start_time": 300.38,
      "end_time": 303.98,
      "text": "And it likely run a deeper run above the previous days high."
    },
    {
      "start_time": 304.06,
      "end_time": 305.18,
      "text": "So that's what we're looking for."
    },
    {
      "start_time": 306.22,
      "end_time": 316.62,
      "text": "But the black line is specifically related to that daily pin bar or doge candle that would be deemed bearish from the retail level trader."
    },
    {
      "start_time": 316.98,
      "end_time": 317.3,
      "text": "All right."
    },
    {
      "start_time": 317.86,
      "end_time": 322.02,
      "text": "And let's take our fib and add it to the New York session."
    },
    {
      "start_time": 322.22,
      "end_time": 322.46,
      "text": "All right."
    },
    {
      "start_time": 322.46,
      "end_time": 330.82,
      "text": "So there's our fib and the low here to the high here, it retraces down into optimal trade entry, 62% trace level."
    },
    {
      "start_time": 330.82,
      "end_time": 339.42,
      "text": "We're going to use as our entry 25.90 would be our entry and the stat would have to be below below here."
    },
    {
      "start_time": 339.42,
      "end_time": 340.42,
      "text": "So we'll use 68."
    },
    {
      "start_time": 341.54,
      "end_time": 343.1,
      "text": "So 68 and 90."
    },
    {
      "start_time": 343.58,
      "end_time": 347.58,
      "text": "That's 32 points or about 320 dollars per contract risk."
    },
    {
      "start_time": 348.22,
      "end_time": 351.02,
      "text": "And we will be reaching for previous days high initially."
    },
    {
      "start_time": 351.02,
      "end_time": 351.98,
      "text": "It does that here."
    },
    {
      "start_time": 352.54,
      "end_time": 358.74,
      "text": "And then we'll be looking for one standard deviation up to 26.75."
    },
    {
      "start_time": 359.14,
      "end_time": 367.38,
      "text": "And if we get to 27.28, we would completely collapse the trade and being okay with taking that as our daily objective."
    },
    {
      "start_time": 368.02,
      "end_time": 371.58,
      "text": "And we can see here as the market runs forward."
    },
    {
      "start_time": 372.98,
      "end_time": 376.22,
      "text": "We do get our second standard deviation and we would be out there."
    },
    {
      "start_time": 376.7,
      "end_time": 380.42,
      "text": "Does run a little bit more, but I'm not teaching you swing trading."
    },
    {
      "start_time": 380.42,
      "end_time": 381.78,
      "text": "I'm not teaching you short term trading."
    },
    {
      "start_time": 382.26,
      "end_time": 388.46,
      "text": "I'm teaching you a bread and butter approach to going into looking for daily setups using specific criteria."
    },
    {
      "start_time": 388.46,
      "end_time": 394.38,
      "text": "Aiming for previous days highs or lows and using the New York session as your catalyst to do so."
    },
    {
      "start_time": 394.7,
      "end_time": 395.78,
      "text": "Hopefully you found this insightful."
    },
    {
      "start_time": 395.78,
      "end_time": 397.78,
      "text": "Until next time, I wish you good luck and good trading."
    }
  ],
  "word_count": 1034,
  "segment_count": 86,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:28:53.091668",
  "title": "OTE Pattern Recognition Series - Vol. 06"
}