{
  "video_id": "ZbkEvNpm-_k",
  "full_text": "Welcome back folks, this is volume number 16 in a continuing series of 20 videos for the inner circle trader optimal trade entry pattern recognition series for YouTube. All right, today's example is going to be in crude oil. This is a commodity market. We're looking at the daily chart and I want to give you a little bit of finesse, on bias, little additional insights that we can see how these optimal trade entries also manifest in terms of a little longer term or broader objectives. If you look at this chart, I want you to take a look at it for a moment, pause your video, think about what you think you see in the price action, then take a look at the annotations once I release them on the screen. Okay, so let's take a look at what we have here. Right away, this gap in price should draw your attention. Whenever you see a price action gap in a commodity or stock or 4x or anything, if it trades, just think of this area here as a magnet. Now price has been slowly working its way towards this old high. Now when price went through this high here, it repelled and went lower. Now, I'm not going to go into the reasons why it did here, but as price is doing this, what is the retail trader thinking? Well, price stopped here before, so it's probably not going to go through that. That is the logic behind 90% of how I decipher price action. I'm looking for those moments when the public or the retail trader, or as I like to do them, retail ric, they see something in price action that is so loosely hinged on factual, real underpinnings of the market. In other words, I am waiting for moments where the public or retail traders, mindset or opinion about a marketplace is so obvious based on what's taught in books and I fell victim to back in the 90s when I first started. I will look at opportunities and see the opposing view to what a retail trader would see or expect in price action. So they expect this to act as resistance. Therefore, they don't want to be buying. They don't want to see a run above that level to attack any kind of liquidity. They're thinking, I want to short this market and my stop is safe above this old high because look what it did in the past. It turned and never went back above it. So as it's been gravitating towards this old high, the natural tendency, and I admit, back in the 90s, I was being trained to see it just like this because of all the books. I got nearly 3,000 books in my library and the multitude of them are useless. They're absolutely useless. I just can't separate myself from them by discarding them because they really framed who I am today because I could go back and see where I followed that failed logic. And I guess at 99.9% of everything that's written is garbage. It's all things that's going to end up leading you to monetary loss, confusion, and no real understanding about what it is you should be doing to be consistently profitable. This gap in price will generally look to fill these gaps. That is a draw on liquidity. And what does that mean? There's going to be an interest for price to get back up into between this level here and this level here, which is the low of this candle and the high of this candle. So there's no candle or price action trading in here. So that's what we call gap. The market will want to likely trade up into that. Now how can we use that as a bias or a tool for bias? Well right away, we are looking at a market that is predisposed to go higher. More likely to go higher than lower, regardless of this so-called retail traders resistance. If we go forward in the future, we would expect to see the bias be bullish. And this is Thursday's trading here, May 28th of 2020. So the expectation would be to see that high, which is 3421, to be blown out. And if we can get a run further, we could see it run to 3518, which is this high here, 3518. Now it's not that we're looking for it just to get to that level. Remember what was said about this. There's orders that's resting above that. Or new orders entering going short with their stop loss in the form of a buy stop, which builds what? Byside liquidity. So if smart money investors or traders or people like you watch in this video, see opportunities like this and we can anticipate a run higher and you're buying low and anticipate a run above that level. Then we can, number one, formulate a bias for the day, the next trading day. We know a time of day when we're looking to seek and discover a pattern that has been identified in this series as the optimal trade entry. And it's specific to time and price. So between 8.30 in the morning and 11 o'clock in the morning, we are looking for a rally higher, a sharp rally higher, and then a pull back into that down to the 62% retracement level. That's the optimal trade entry and it has to occur between 8.30 and 11 o'clock. If it doesn't, we don't do anything. We just wait for the next trading day or trade another pair or market. But this is how we can use very simple things in the daily chart to arrive at a bias. Not in every day bias, but this is a bias model. So if we drop down into a 5 minute chart, here's your 5 minute chart, and again, you know the drill, pause the video and take a look at what you think you see here. And then when you're ready, unpause the video and I'll add the annotations. Okay, so here is the annotations for the 5 minute chart, as I mentioned on the daily chart. For the 28th of May, which is Thursday of 2020, the previous highs here, as I mentioned, 3421 price level. This line here is that old daily high or daily retail resistance coming in at 3518. Our time of day is 8.30am to 11am. And we can see a price run here. It clears a high and we trade back down into it. Now this candle right there is the candle you'd be filled on. It's inside of our time window. It fits the criteria. So it's this low up to this price high down. So it's trading back down in our hypothetical entry would be 32.75. It suffers an 8.draw down or tick. So one point or tick in the crude oil market equals $10 per contract. Now they do offer a mini contract, but I'm going to show this example in light of a regular standard contract for crude oil. You're using 0.26 or 26 ticks or point stop. So that would be a $260 loss if you got stopped out. And trading back just to the old high offered more than 35 points or $350. 1.5 standard deviation is 75 points or ticks or in monetary terms, it would be a hypothetical $750. Then over a thousand, so $1,090 at one standard deviation. Now that's even before you get to the previous days high. One and a half standard deviation takes us to 34.18 and that doesn't quite get us above the daily high from the previous day. The next one is your two standard deviations at over 175 points. That's $1,750 per contract. This is the model for taking your interdade trade, but because the logic I saw outlined on the daily chart, suppose is that we could see a run and it didn't have to happen on Friday or the 29th of May. It could have happened into the following week. But if you leave a leader in, now again, what's a leader? A leader is where you keep a small piece of the original trade on. Now the rules for this model is you collapse at two standard deviations. But if you have a criteria in price action that lends well to a likely outcome of reaching for a higher target, then at this point here you absolutely have to have 80% off and then leave 20% on. And you have to scale that for your own account or as close as you possibly can, the majority of your trade should be closed here. And then if you capture any kind of continuation to run that daily level, this is what you can participate in. So it offers as much as $290 points or $2,900 per contract. Now if you risk $260 and you walk away with $2,900, that's over 10 to 1. That's enormous. So if you can see these patterns forming and you can determine the likely direction, think about the power that's given you. It tells you exactly when to train your attention in the marketplace relative to time. So you can treat it like a business. You have operating hours between 830 AM and 11 AM. You're looking for a particular pattern to get in sync or move in a opposing direction to where you think the market's going to go. And remember, we're looking for the previous days high and maybe even a longer term high to be taken out. This rally up, we don't want to chase that. We want to see it drop. When it drops down in optimal trade entry, 62% tradesman levels are entry between 830 and 11. This is our entry. And then again, with only $80 draw down, that's the most it to trade would have hypothetically taken. So 80 bucks of suffering using the 62% tradesman levels are entry and then riding it all the way up to 290 points. And ultimately, we still have that gap that likely trade up into. Now, it doesn't mean it's going to go there on Monday, it doesn't mean it's going to go there Tuesday. It just means over a period of time, this is an upside draw on liquidity. So it's going to act like a magnet and pool price up there, which is going to lend well for daily bias. So again, study this example. And you can see there's lots of things that you can mind from this particular episode. But it's just one more evidence to this model. I created a model very simple, very easy to understand in terms of time. You only have to determine if you're going to be looking for the previous days higher or previous days low to be traded to. And then you wait for this pattern. It's very simple. You have logical levels to take profits at impartials. And now they included a little bit longer term bias idea to help frame a likely scenario that we could a continuation or explosive price action move like we see here. So if we found this insightful, until next time, I wish you good luck and good trading.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 16.88,
      "text": "Welcome back folks, this is volume number 16 in a continuing series of 20 videos for the"
    },
    {
      "start_time": 16.88,
      "end_time": 20.92,
      "text": "inner circle trader optimal trade entry pattern recognition series for YouTube."
    },
    {
      "start_time": 20.92,
      "end_time": 24.0,
      "text": "All right, today's example is going to be in crude oil."
    },
    {
      "start_time": 24.0,
      "end_time": 26.28,
      "text": "This is a commodity market."
    },
    {
      "start_time": 26.28,
      "end_time": 30.68,
      "text": "We're looking at the daily chart and I want to give you a little bit of finesse,"
    },
    {
      "start_time": 30.68,
      "end_time": 37.04,
      "text": "on bias, little additional insights that we can see how these optimal trade entries also"
    },
    {
      "start_time": 37.04,
      "end_time": 44.76,
      "text": "manifest in terms of a little longer term or broader objectives."
    },
    {
      "start_time": 44.76,
      "end_time": 49.8,
      "text": "If you look at this chart, I want you to take a look at it for a moment, pause your video,"
    },
    {
      "start_time": 49.8,
      "end_time": 53.44,
      "text": "think about what you think you see in the price action, then take a look at the annotations"
    },
    {
      "start_time": 53.44,
      "end_time": 54.6,
      "text": "once I release them on the screen."
    },
    {
      "start_time": 56.28,
      "end_time": 65.28,
      "text": "Okay, so let's take a look at what we have here."
    },
    {
      "start_time": 65.28,
      "end_time": 70.12,
      "text": "Right away, this gap in price should draw your attention."
    },
    {
      "start_time": 70.12,
      "end_time": 80.4,
      "text": "Whenever you see a price action gap in a commodity or stock or 4x or anything, if it trades,"
    },
    {
      "start_time": 80.4,
      "end_time": 83.72,
      "text": "just think of this area here as a magnet."
    },
    {
      "start_time": 83.72,
      "end_time": 89.4,
      "text": "Now price has been slowly working its way towards this old high."
    },
    {
      "start_time": 89.4,
      "end_time": 92.8,
      "text": "Now when price went through this high here, it repelled and went lower."
    },
    {
      "start_time": 92.8,
      "end_time": 98.72,
      "text": "Now, I'm not going to go into the reasons why it did here, but as price is doing this,"
    },
    {
      "start_time": 98.72,
      "end_time": 101.24,
      "text": "what is the retail trader thinking?"
    },
    {
      "start_time": 101.24,
      "end_time": 106.08,
      "text": "Well, price stopped here before, so it's probably not going to go through that."
    },
    {
      "start_time": 106.08,
      "end_time": 114.24,
      "text": "That is the logic behind 90% of how I decipher price action."
    },
    {
      "start_time": 114.24,
      "end_time": 120.24,
      "text": "I'm looking for those moments when the public or the retail trader, or as I like to do them,"
    },
    {
      "start_time": 120.24,
      "end_time": 131.44,
      "text": "retail ric, they see something in price action that is so loosely hinged on factual, real"
    },
    {
      "start_time": 131.44,
      "end_time": 132.84,
      "text": "underpinnings of the market."
    },
    {
      "start_time": 132.92,
      "end_time": 138.44,
      "text": "In other words, I am waiting for moments where the public or retail traders, mindset or"
    },
    {
      "start_time": 138.44,
      "end_time": 144.68,
      "text": "opinion about a marketplace is so obvious based on what's taught in books and I fell victim"
    },
    {
      "start_time": 144.68,
      "end_time": 147.56,
      "text": "to back in the 90s when I first started."
    },
    {
      "start_time": 147.56,
      "end_time": 155.48,
      "text": "I will look at opportunities and see the opposing view to what a retail trader would see or expect"
    },
    {
      "start_time": 155.48,
      "end_time": 157.0,
      "text": "in price action."
    },
    {
      "start_time": 157.0,
      "end_time": 159.96,
      "text": "So they expect this to act as resistance."
    },
    {
      "start_time": 160.04,
      "end_time": 163.16,
      "text": "Therefore, they don't want to be buying."
    },
    {
      "start_time": 163.16,
      "end_time": 168.2,
      "text": "They don't want to see a run above that level to attack any kind of liquidity."
    },
    {
      "start_time": 168.2,
      "end_time": 174.68,
      "text": "They're thinking, I want to short this market and my stop is safe above this old high because"
    },
    {
      "start_time": 174.68,
      "end_time": 176.44,
      "text": "look what it did in the past."
    },
    {
      "start_time": 176.44,
      "end_time": 178.92,
      "text": "It turned and never went back above it."
    },
    {
      "start_time": 178.92,
      "end_time": 186.04,
      "text": "So as it's been gravitating towards this old high, the natural tendency, and I admit,"
    },
    {
      "start_time": 186.04,
      "end_time": 191.32,
      "text": "back in the 90s, I was being trained to see it just like this because of all the books."
    },
    {
      "start_time": 192.28,
      "end_time": 198.2,
      "text": "I got nearly 3,000 books in my library and the multitude of them are useless."
    },
    {
      "start_time": 198.2,
      "end_time": 199.48,
      "text": "They're absolutely useless."
    },
    {
      "start_time": 199.48,
      "end_time": 202.84,
      "text": "I just can't separate myself from them by discarding them because they"
    },
    {
      "start_time": 204.84,
      "end_time": 210.36,
      "text": "really framed who I am today because I could go back and see where I followed that failed logic."
    },
    {
      "start_time": 210.92,
      "end_time": 215.96,
      "text": "And I guess at 99.9% of everything that's written is garbage."
    },
    {
      "start_time": 215.96,
      "end_time": 219.56,
      "text": "It's all things that's going to end up leading you to monetary loss,"
    },
    {
      "start_time": 220.36,
      "end_time": 226.12,
      "text": "confusion, and no real understanding about what it is you should be doing to be consistently profitable."
    },
    {
      "start_time": 228.12,
      "end_time": 233.56,
      "text": "This gap in price will generally look to fill these gaps."
    },
    {
      "start_time": 234.6,
      "end_time": 237.32,
      "text": "That is a draw on liquidity."
    },
    {
      "start_time": 237.32,
      "end_time": 242.2,
      "text": "And what does that mean? There's going to be an interest for price to get back up into"
    },
    {
      "start_time": 242.2,
      "end_time": 248.2,
      "text": "between this level here and this level here, which is the low of this candle and the high of this candle."
    },
    {
      "start_time": 248.2,
      "end_time": 250.92,
      "text": "So there's no candle or price action trading in here."
    },
    {
      "start_time": 250.92,
      "end_time": 251.96,
      "text": "So that's what we call gap."
    },
    {
      "start_time": 252.84,
      "end_time": 255.96,
      "text": "The market will want to likely trade up into that."
    },
    {
      "start_time": 255.96,
      "end_time": 259.56,
      "text": "Now how can we use that as a bias or a tool for bias?"
    },
    {
      "start_time": 259.56,
      "end_time": 264.68,
      "text": "Well right away, we are looking at a market that is predisposed to go higher."
    },
    {
      "start_time": 264.68,
      "end_time": 270.84,
      "text": "More likely to go higher than lower, regardless of this so-called retail traders resistance."
    },
    {
      "start_time": 273.08,
      "end_time": 279.32,
      "text": "If we go forward in the future, we would expect to see the bias be bullish."
    },
    {
      "start_time": 279.96,
      "end_time": 284.52,
      "text": "And this is Thursday's trading here, May 28th of 2020."
    },
    {
      "start_time": 285.48,
      "end_time": 292.28,
      "text": "So the expectation would be to see that high, which is 3421, to be blown out."
    },
    {
      "start_time": 292.28,
      "end_time": 299.08,
      "text": "And if we can get a run further, we could see it run to 3518, which is"
    },
    {
      "start_time": 300.6,
      "end_time": 302.28,
      "text": "this high here, 3518."
    },
    {
      "start_time": 303.16,
      "end_time": 305.56,
      "text": "Now it's not that we're looking for it just to get to that level."
    },
    {
      "start_time": 305.56,
      "end_time": 307.56,
      "text": "Remember what was said about this."
    },
    {
      "start_time": 308.2,
      "end_time": 310.6,
      "text": "There's orders that's resting above that."
    },
    {
      "start_time": 310.6,
      "end_time": 317.16,
      "text": "Or new orders entering going short with their stop loss in the form of a buy stop,"
    },
    {
      "start_time": 317.16,
      "end_time": 318.28,
      "text": "which builds what?"
    },
    {
      "start_time": 319.16,
      "end_time": 320.68,
      "text": "Byside liquidity."
    },
    {
      "start_time": 320.68,
      "end_time": 324.68,
      "text": "So if smart money investors or traders or people like you watch in this video,"
    },
    {
      "start_time": 325.48,
      "end_time": 329.88,
      "text": "see opportunities like this and we can anticipate a run higher and you're buying"
    },
    {
      "start_time": 331.16,
      "end_time": 334.44,
      "text": "low and anticipate a run above that level."
    },
    {
      "start_time": 335.8,
      "end_time": 342.36,
      "text": "Then we can, number one, formulate a bias for the day, the next trading day."
    },
    {
      "start_time": 342.36,
      "end_time": 350.44,
      "text": "We know a time of day when we're looking to seek and discover a pattern that has been identified"
    },
    {
      "start_time": 350.44,
      "end_time": 351.88,
      "text": "in this series as the optimal trade entry."
    },
    {
      "start_time": 352.6,
      "end_time": 354.92,
      "text": "And it's specific to time and price."
    },
    {
      "start_time": 354.92,
      "end_time": 357.24,
      "text": "So between 8.30 in the morning and 11 o'clock in the morning,"
    },
    {
      "start_time": 357.88,
      "end_time": 366.12,
      "text": "we are looking for a rally higher, a sharp rally higher, and then a pull back into that"
    },
    {
      "start_time": 366.68,
      "end_time": 368.44,
      "text": "down to the 62% retracement level."
    },
    {
      "start_time": 368.92,
      "end_time": 373.32,
      "text": "That's the optimal trade entry and it has to occur between 8.30 and 11 o'clock."
    },
    {
      "start_time": 373.88,
      "end_time": 376.2,
      "text": "If it doesn't, we don't do anything."
    },
    {
      "start_time": 376.2,
      "end_time": 380.36,
      "text": "We just wait for the next trading day or trade another pair or market."
    },
    {
      "start_time": 381.0,
      "end_time": 388.44,
      "text": "But this is how we can use very simple things in the daily chart to arrive at a bias."
    },
    {
      "start_time": 388.44,
      "end_time": 394.04,
      "text": "Not in every day bias, but this is a bias model."
    },
    {
      "start_time": 394.84,
      "end_time": 398.76,
      "text": "So if we drop down into a 5 minute chart, here's your 5 minute chart, and again,"
    },
    {
      "start_time": 398.76,
      "end_time": 403.0,
      "text": "you know the drill, pause the video and take a look at what you think you see here."
    },
    {
      "start_time": 403.0,
      "end_time": 405.8,
      "text": "And then when you're ready, unpause the video and I'll add the annotations."
    },
    {
      "start_time": 409.64,
      "end_time": 414.12,
      "text": "Okay, so here is the annotations for the 5 minute chart, as I mentioned on the daily chart."
    },
    {
      "start_time": 415.0,
      "end_time": 421.8,
      "text": "For the 28th of May, which is Thursday of 2020, the previous highs here, as I mentioned,"
    },
    {
      "start_time": 421.8,
      "end_time": 431.64,
      "text": "3421 price level. This line here is that old daily high or daily retail resistance coming in at 3518."
    },
    {
      "start_time": 433.4,
      "end_time": 437.16,
      "text": "Our time of day is 8.30am to 11am."
    },
    {
      "start_time": 438.36,
      "end_time": 445.24,
      "text": "And we can see a price run here. It clears a high and we trade back down into it."
    },
    {
      "start_time": 445.24,
      "end_time": 451.16,
      "text": "Now this candle right there is the candle you'd be filled on. It's inside of our time window."
    },
    {
      "start_time": 451.8,
      "end_time": 456.6,
      "text": "It fits the criteria. So it's this low up to this price high down."
    },
    {
      "start_time": 457.56,
      "end_time": 462.2,
      "text": "So it's trading back down in our hypothetical entry would be 32.75."
    },
    {
      "start_time": 462.2,
      "end_time": 469.56,
      "text": "It suffers an 8.draw down or tick. So one point or tick in the crude oil market equals $10 per contract."
    },
    {
      "start_time": 469.56,
      "end_time": 477.4,
      "text": "Now they do offer a mini contract, but I'm going to show this example in light of a regular standard"
    },
    {
      "start_time": 477.4,
      "end_time": 485.56,
      "text": "contract for crude oil. You're using 0.26 or 26 ticks or point stop."
    },
    {
      "start_time": 485.56,
      "end_time": 492.12,
      "text": "So that would be a $260 loss if you got stopped out. And trading back just to the old high offered"
    },
    {
      "start_time": 492.12,
      "end_time": 500.68,
      "text": "more than 35 points or $350. 1.5 standard deviation is 75 points or ticks or in monetary terms,"
    },
    {
      "start_time": 500.68,
      "end_time": 509.16,
      "text": "it would be a hypothetical $750. Then over a thousand, so $1,090 at one standard deviation."
    },
    {
      "start_time": 509.16,
      "end_time": 511.8,
      "text": "Now that's even before you get to the previous days high."
    },
    {
      "start_time": 513.48,
      "end_time": 520.2,
      "text": "One and a half standard deviation takes us to 34.18 and that doesn't quite get us above"
    },
    {
      "start_time": 520.2,
      "end_time": 527.48,
      "text": "the daily high from the previous day. The next one is your two standard deviations at over 175"
    },
    {
      "start_time": 527.48,
      "end_time": 536.68,
      "text": "points. That's $1,750 per contract. This is the model for taking your interdade trade, but because"
    },
    {
      "start_time": 536.68,
      "end_time": 543.32,
      "text": "the logic I saw outlined on the daily chart, suppose is that we could see a run and it didn't have"
    },
    {
      "start_time": 543.32,
      "end_time": 550.04,
      "text": "to happen on Friday or the 29th of May. It could have happened into the following week. But if you"
    },
    {
      "start_time": 550.04,
      "end_time": 555.48,
      "text": "leave a leader in, now again, what's a leader? A leader is where you keep a small piece of the"
    },
    {
      "start_time": 555.48,
      "end_time": 562.04,
      "text": "original trade on. Now the rules for this model is you collapse at two standard deviations. But"
    },
    {
      "start_time": 562.04,
      "end_time": 568.68,
      "text": "if you have a criteria in price action that lends well to a likely outcome of reaching for a higher"
    },
    {
      "start_time": 568.68,
      "end_time": 574.44,
      "text": "target, then at this point here you absolutely have to have 80% off and then leave 20% on."
    },
    {
      "start_time": 575.56,
      "end_time": 583.08,
      "text": "And you have to scale that for your own account or as close as you possibly can, the majority of"
    },
    {
      "start_time": 583.08,
      "end_time": 589.0,
      "text": "your trade should be closed here. And then if you capture any kind of continuation to run that"
    },
    {
      "start_time": 589.0,
      "end_time": 597.48,
      "text": "daily level, this is what you can participate in. So it offers as much as $290 points or $2,900"
    },
    {
      "start_time": 597.48,
      "end_time": 609.16,
      "text": "per contract. Now if you risk $260 and you walk away with $2,900, that's over 10 to 1."
    },
    {
      "start_time": 609.64,
      "end_time": 620.52,
      "text": "That's enormous. So if you can see these patterns forming and you can determine the likely"
    },
    {
      "start_time": 620.52,
      "end_time": 627.24,
      "text": "direction, think about the power that's given you. It tells you exactly when to train your attention"
    },
    {
      "start_time": 627.24,
      "end_time": 632.52,
      "text": "in the marketplace relative to time. So you can treat it like a business. You have operating hours"
    },
    {
      "start_time": 632.6,
      "end_time": 644.04,
      "text": "between 830 AM and 11 AM. You're looking for a particular pattern to get in sync or move"
    },
    {
      "start_time": 645.24,
      "end_time": 649.72,
      "text": "in a opposing direction to where you think the market's going to go. And remember, we're looking"
    },
    {
      "start_time": 649.72,
      "end_time": 655.0,
      "text": "for the previous days high and maybe even a longer term high to be taken out. This rally up,"
    },
    {
      "start_time": 655.0,
      "end_time": 660.04,
      "text": "we don't want to chase that. We want to see it drop. When it drops down in optimal trade entry,"
    },
    {
      "start_time": 661.0,
      "end_time": 669.96,
      "text": "62% tradesman levels are entry between 830 and 11. This is our entry. And then again, with only $80"
    },
    {
      "start_time": 669.96,
      "end_time": 678.6,
      "text": "draw down, that's the most it to trade would have hypothetically taken. So 80 bucks of suffering"
    },
    {
      "start_time": 678.6,
      "end_time": 685.72,
      "text": "using the 62% tradesman levels are entry and then riding it all the way up to 290 points."
    },
    {
      "start_time": 686.52,
      "end_time": 697.48,
      "text": "And ultimately, we still have that gap that likely trade up into. Now, it doesn't mean it's"
    },
    {
      "start_time": 697.48,
      "end_time": 701.24,
      "text": "going to go there on Monday, it doesn't mean it's going to go there Tuesday. It just means over"
    },
    {
      "start_time": 701.24,
      "end_time": 707.72,
      "text": "a period of time, this is an upside draw on liquidity. So it's going to act like a magnet and"
    },
    {
      "start_time": 707.72,
      "end_time": 713.72,
      "text": "pool price up there, which is going to lend well for daily bias. So again, study this example."
    },
    {
      "start_time": 714.6,
      "end_time": 719.08,
      "text": "And you can see there's lots of things that you can mind from this particular episode."
    },
    {
      "start_time": 719.72,
      "end_time": 728.28,
      "text": "But it's just one more evidence to this model. I created a model very simple, very easy to understand"
    },
    {
      "start_time": 728.28,
      "end_time": 731.88,
      "text": "in terms of time. You only have to determine if you're going to be looking for the previous days"
    },
    {
      "start_time": 731.88,
      "end_time": 737.72,
      "text": "higher or previous days low to be traded to. And then you wait for this pattern. It's very simple."
    },
    {
      "start_time": 737.72,
      "end_time": 742.68,
      "text": "You have logical levels to take profits at impartials. And now they included a little bit longer term"
    },
    {
      "start_time": 742.68,
      "end_time": 750.28,
      "text": "bias idea to help frame a likely scenario that we could a continuation or explosive price action"
    },
    {
      "start_time": 750.28,
      "end_time": 755.08,
      "text": "move like we see here. So if we found this insightful, until next time, I wish you good luck and good trading."
    }
  ],
  "word_count": 1891,
  "segment_count": 131,
  "method": "whisper",
  "whisper_model": "base",
  "transcribed_at": "2026-01-27T18:32:51.469181",
  "title": "OTE Pattern Recognition Series - Vol.16"
}